{"id":7707,"date":"2018-07-23T16:02:29","date_gmt":"2018-07-23T19:02:29","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7707"},"modified":"2019-07-16T13:42:11","modified_gmt":"2019-07-16T16:42:11","slug":"uma-discussao-sobre-aprendizado-em-equipes","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/07\/uma-discussao-sobre-aprendizado-em-equipes\/","title":{"rendered":"Uma discuss\u00e3o sobre aprendizado em equipes"},"content":{"rendered":"<p>Caso voc\u00ea tenha assistido alguma palestra sobre \u00e1gil na sua vida ou tenha participado de algum treinamento sobre o assunto, \u00e9 bem prov\u00e1vel que voc\u00ea tenha interagido com o conceito de Shu Ha Ri. Para quem n\u00e3o conhece, o nome tem origem no Aikido e foi introduzido no ambiente de desenvolvimento de software por Alistair Cockburn como uma forma de explicitar o grau de dom\u00ednio em determinada t\u00e9cnica ou m\u00e9todo. Assim como o aprendizado da arte marcial, Cockburn prop\u00f5e que uma pessoa passar\u00e1 por 3 est\u00e1gios at\u00e9 tornar-se proficiente. As etapas s\u00e3o:<\/p>\n<ul>\n<li><strong>Shu:<\/strong>\u00a0No est\u00e1gio inicial, a pessoa estudante segue os ensinamentos de um tema de forma precisa. A pessoa concentra-se em como fazer a tarefa, sem se preocupar em compreender a teoria por tr\u00e1s. Se existirem m\u00faltiplas varia\u00e7\u00f5es de como fazer a tarefa, a pessoa se at\u00e9m a realiz\u00e1-la da forma como o(a) mestre ensinou.<\/li>\n<li><strong>Ha:<\/strong>\u00a0Neste ponto, a pessoa estudante come\u00e7a a se desgarrar do(a) mestre. A partir do momento em que as pr\u00e1ticas do tema est\u00e3o em funcionamento, a pessoa come\u00e7a a aprender os princ\u00edpios e teorias por tr\u00e1s da t\u00e9cnica. Al\u00e9m disso, a pessoa aprende com outros mestres (refer\u00eancias) e integra o aprendizado \u00e0 sua pr\u00e1tica.<\/li>\n<li><strong>Ri:<\/strong>\u00a0No est\u00e1gio final, a pessoa estudante n\u00e3o aprende com outras pessoas, mas atrav\u00e9s da sua pr\u00f3pria pr\u00e1tica. Ele cria a sua forma de conduzir e adaptar o que aprendeu a partir do seu ponto de vista.<\/li>\n<\/ul>\n<p>A partir de uma interpreta\u00e7\u00e3o livre do que o autor prop\u00f5e, \u00e9 como se diss\u00e9ssemos que as organiza\u00e7\u00f5es estariam aptas a fazer adapta\u00e7\u00f5es em t\u00e9cnicas ou metodologias a partir do momento em que elas transcendessem os tr\u00eas est\u00e1gios. Tal abordagem n\u00e3o difere do que foi proposto pelo psic\u00f3logo Benjamin Bloom em 1958. Segundo o\u00a0<a href=\"https:\/\/pt.wikipedia.org\/wiki\/Taxonomia_dos_objetivos_educacionais\" rel=\"nofollow\">dom\u00ednio cognitivo descrito na teoria<\/a>, a pessoa estudante s\u00f3 consegue adquirir uma nova compet\u00eancia se ele tiver dominado e adquirido a compet\u00eancia do n\u00edvel anterior. Nomeada pelo psic\u00f3logo como Taxonomia dos Objetivos Educacionais, os n\u00edveis de habilidade elencados s\u00e3o:<\/p>\n<ul>\n<li><strong>Conhecimento:<\/strong>\u00a0recordar, definir, reconhecer ou identificar uma informa\u00e7\u00e3o espec\u00edfica a partir de situa\u00e7\u00f5es de aprendizagem anteriores;<\/li>\n<li><strong>Compreens\u00e3o:<\/strong>\u00a0demonstrar compreens\u00e3o pela informa\u00e7\u00e3o, sendo capaz de reproduzi-la por ideias e palavras pr\u00f3prias;<\/li>\n<li><strong>Aplica\u00e7\u00e3o:<\/strong>\u00a0recolher e aplicar a informa\u00e7\u00e3o em situa\u00e7\u00f5es ou problemas concretos;<\/li>\n<li><strong>An\u00e1lise:<\/strong>\u00a0subdividir a informa\u00e7\u00e3o em partes menores com a finalidade de entender a estrutura final;<\/li>\n<li><strong>S\u00edntese:<\/strong>\u00a0recolher e relacionar informa\u00e7\u00f5es de v\u00e1rias fontes, formando um produto novo;<\/li>\n<li><strong>Avalia\u00e7\u00e3o:<\/strong>\u00a0fazer julgamentos sobre o valor de algo (produtos, ideias, etc.) tendo em considera\u00e7\u00e3o crit\u00e9rios conhecidos.<\/li>\n<\/ul>\n<p>Ao categorizar os indiv\u00edduos e organiza\u00e7\u00f5es em n\u00edveis dependentes dos anteriores, desenvolvemos um pensamento linear para um cen\u00e1rio que evolui em um formato geralmente desestruturado e que carrega um passivo de conhecimento antecedente. A partir de tal afirma\u00e7\u00e3o, te convido a responder: ser\u00e1 que faz sentido uma organiza\u00e7\u00e3o utilizar tudo o que \u00e9 descrito no\u00a0<a href=\"https:\/\/www.scrumguides.org\/docs\/scrumguide\/v2017\/2017-Scrum-Guide-US.pdf\" rel=\"nofollow\">Scrum Guide<\/a>? Ser\u00e1 que ao seguir o checklist do\u00a0<a href=\"https:\/\/www.scaledagileframework.com\/what-is-safe\/\" rel=\"nofollow\">SAFe<\/a>\u00a0o \u00e1gil ser\u00e1 escalado no seu neg\u00f3cio? Ser\u00e1 que faz sentido utilizar uma abordagem evolucion\u00e1ria como o\u00a0<a href=\"https:\/\/www.youtube.com\/watch?v=cTdJgdQmlr4\" rel=\"nofollow\">modelo de maturidade do Kanban<\/a>\u00a0para avaliar o qu\u00e3o \u00e1gil meu neg\u00f3cio est\u00e1 se tornando?<\/p>\n<p>Ao estudar sobre teorias de aprendizagem e atuar em empresas &#8220;\u00e1geis&#8221; (sugiro a leitura do artigo sobre como analisar a\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2018\/03\/o-desafio-de-analisar-a-maturidade-agil-de-uma-empresa\/\" rel=\"nofollow\">maturidade da agilidade no neg\u00f3cio<\/a>) ou em &#8220;processo de transforma\u00e7\u00e3o&#8221; (tem um texto bacana sobre dicas para encarar\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2018\/05\/dicas-para-enfrentar-os-desafios-de-uma-transformacao-agil\/\" rel=\"nofollow\">os desafios de uma transforma\u00e7\u00e3o \u00e1gil<\/a>), percebi que r\u00f3tulos (categorias ou n\u00edveis) n\u00e3o respondem como as organiza\u00e7\u00f5es e as pessoas aprendem a serem \u00e1geis.<\/p>\n<h2><a id=\"user-content-teorias-de-aprendizagem\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/a3b43e001257fd5774d3285d06b24c2ab5611bac\/2018-06-learning-theories-shu-ha-ri.md#teorias-de-aprendizagem\" aria-hidden=\"true\"><\/a>Teorias de aprendizagem<\/h2>\n<p>A pedagogia apresenta tr\u00eas poss\u00edveis formas dos indiv\u00edduos aprenderem. A seguir, descreverei um paralelo de tais teorias com o que tenho observado em ambientes que buscam desenvolver a capacidade de ser \u00e1gil.<\/p>\n<p><strong>O que \u00e9 o Behavorismo?<\/strong><\/p>\n<p>O behaviorismo (ou comportamentalismo) \u00e9 uma vis\u00e3o de mundo que opera sobre um princ\u00edpio de est\u00edmulo e resposta. Todo comportamento \u00e9 causado por est\u00edmulos externos e pode ser explicado sem a necessidade de considerar estados mentais internos ou a consci\u00eancia.<\/p>\n<p>A pessoa estudante come\u00e7a como uma caixa vazia e o comportamento \u00e9 moldado atrav\u00e9s do refor\u00e7o positivo ou negativo. Tanto o refor\u00e7o positivo quanto o refor\u00e7o negativo aumentam a probabilidade de que o comportamento antecedente aconte\u00e7a novamente. Em contraste, a puni\u00e7\u00e3o (tanto positiva quanto negativa) diminui a probabilidade de que o comportamento antecedente aconte\u00e7a novamente. A aprendizagem \u00e9, portanto, definida como uma mudan\u00e7a de comportamento no aprendiz (deixo aqui um\u00a0<a href=\"https:\/\/www.youtube.com\/watch?v=_8zA18LkPR4\" rel=\"nofollow\">v\u00eddeo<\/a>\u00a0para ilustrar a explica\u00e7\u00e3o).<\/p>\n<p>Minha cr\u00edtica para esta corrente te\u00f3rica se d\u00e1 na premissa de ignorar o passado cognitivo das pessoas. Em minha opini\u00e3o, a pessoa aprende a partir do momento em que ela critica aquilo que ela j\u00e1 sabe a fim de gerar novas conex\u00f5es.<\/p>\n<p>Fazendo um paralelo com disseminar uma cultura \u00e1gil, tal abordagem \u00e9 utilizada quando desejamos que as pessoas mantenham o que est\u00e1 ocorrendo bem e mudem de comportamento ao interagirem com resultados que n\u00e3o s\u00e3o t\u00e3o interessantes (ciclos de feedback observados em retrospectivas, revis\u00f5es de OKRs, operations review do Kanban etc.).<\/p>\n<p>O lado negativo deste paradigma se d\u00e1 quando h\u00e1 o refor\u00e7o de comportamentos pouco efetivos para o neg\u00f3cio pelo simples fato de estarem atrelados a puni\u00e7\u00f5es ou metas. Alguns exemplos seriam:<\/p>\n<ul>\n<li>Para mantermos um patamar de velocidade na entrega, devemos reduzir o tempo de an\u00e1lise de c\u00f3digo, refinamento, planejamento e testes.<\/li>\n<li>Para continuarmos com 100% dos itens de um Sprint conclu\u00eddos, n\u00e3o demonstraremos todo o funcionamento em uma reuni\u00e3o de revis\u00e3o para n\u00e3o corrermos o risco de termos uma funcionalidade reprovada.<\/li>\n<li>Para continuarmos com o lead time com baixa variabilidade, vamos retirar os casos extremos do relat\u00f3rio apresentado aos stakeholders, assim eles ver\u00e3o o qu\u00e3o est\u00e1vel nossa equipe \u00e9.<\/li>\n<\/ul>\n<p><strong>O que \u00e9 o Cognitivismo?<\/strong><\/p>\n<p>O paradigma cognitivista argumenta que a &#8220;caixa preta&#8221; da mente deve ser aberta e compreendida. A mente do aprendiz \u00e9 como um computador: a informa\u00e7\u00e3o entra, \u00e9 processada e gera certos resultados.<\/p>\n<p>O aprendizado \u00e9 definido como uma mudan\u00e7a nos esquemas mentais de um aprendiz. Diferentemente do behavorismo, as pessoas n\u00e3o s\u00e3o programadas como animais que respondem ao est\u00edmulo externo. As pessoas s\u00e3o seres racionais que j\u00e1 possuem um saber e precisam de uma participa\u00e7\u00e3o ativa para aprender. Neste sentido, um bom feedback \u00e9 fundamental para guiar e dar orienta\u00e7\u00e3o para que ocorram as conex\u00f5es mentais (<a href=\"https:\/\/www.slideshare.net\/MarianaGraf\/trabalhando-a-cultura-do-feedback-por-onde-comear-64485895\" rel=\"nofollow\">deixo como dica uma palestra maravilhosa da Mari Graf sobre feedback<\/a>).<\/p>\n<p>Esse tipo de forma de aprendizado leva em considera\u00e7\u00e3o que n\u00e3o h\u00e1\u00a0<em>bala de prata<\/em>\u00a0ao ensinar algu\u00e9m. A mensagem que fica por tr\u00e1s deste estilo \u00e9: para aprender \u00e9 importante desenvolver um pensamento cr\u00edtico.<\/p>\n<p>Conectando tal teoria com o universo \u00e1gil, chegamos \u00e0 conclus\u00e3o que voc\u00ea ou sua organiza\u00e7\u00e3o n\u00e3o ser\u00e3o \u00e1geis por aplicarem ou repetirem o que est\u00e1 descrito em treinamentos ou manuais Kanban, Scrum, SAFe ou de qualquer outro m\u00e9todo.<\/p>\n<p>O neg\u00f3cio s\u00f3 entregar\u00e1 mais valor, de forma incremental, centrada no usu\u00e1rio e com feedbacks mais r\u00e1pidos a partir do momento que as pessoas:<\/p>\n<ul>\n<li>Racionalizarem o que h\u00e1 por tr\u00e1s dos m\u00e9todos;<\/li>\n<li>Avaliarem seus pontos positivos e imperfei\u00e7\u00f5es;<\/li>\n<li>Analisarem um conjunto de op\u00e7\u00f5es por meio das conex\u00f5es geradas com o aprendizado presente e com as experi\u00eancias passadas;<\/li>\n<li>Tomarem decis\u00f5es que considerem o contexto do neg\u00f3cio e resolverem problemas reais.<\/li>\n<\/ul>\n<p>Por fim, essa abordagem nos faz gerar questionamentos como:<\/p>\n<ul>\n<li>Por que preciso escalar o \u00e1gil em um contexto de poucas equipes?<\/li>\n<li>Qual \u00e9 o custo de coordena\u00e7\u00e3o de uma reuni\u00e3o que ocupa metade da empresa para gerar alinhamento?<\/li>\n<li>Ser\u00e1 que todas as decis\u00f5es precisam ser tomadas em um formato de gest\u00e3o compartilhada?<\/li>\n<li>Como estimular a colabora\u00e7\u00e3o de forma saud\u00e1vel?<\/li>\n<li>Por que a equipe deve realizar reuni\u00f5es de planejamento, reuni\u00f5es di\u00e1rias, retrospectivas etc.?<\/li>\n<li>Como o limite do trabalho em progresso pode ajudar na produtividade da equipe?<\/li>\n<\/ul>\n<p><strong>O que \u00e9 o Construtivismo?<\/strong><\/p>\n<p>O paradigma construtivista define que o conhecimento \u00e9 produzido com base em experi\u00eancias pessoais e hip\u00f3teses do ambiente. Cada pessoa tem uma interpreta\u00e7\u00e3o e constru\u00e7\u00e3o diferente do processo do conhecimento. A pessoa estudante n\u00e3o \u00e9 uma caixa vazia, mas traz experi\u00eancias passadas e fatores culturais para uma situa\u00e7\u00e3o.<\/p>\n<p>Esta linha pedag\u00f3gica entende que o aprendizado se d\u00e1 a partir de uma pesssoa mediadora e o detentor de um conhecimento pr\u00e9vio (a pessoa estudante). Assim, o mediador deve criar condi\u00e7\u00f5es para que o detentor do saber vivencie situa\u00e7\u00f5es e atividades interativas, nas quais ele pr\u00f3prio construa novas compet\u00eancias.<\/p>\n<p>Conectado com tal defini\u00e7\u00e3o, o livro\u00a0<a href=\"https:\/\/www.amazon.com\/How-Creative-Workers-Learn-creativity-ebook\/dp\/B013K8K1CU\" rel=\"nofollow\">How Creative Workers Learn: Improving creativity and learning in order to build successful careers during the XXI century<\/a>\u00a0de Alexandre Magno nos faz refletir sobre a responsabilidade do indiv\u00edduo no aprender. Sabendo que somos seres em busca de conhecimento, a obra apresenta tr\u00eas modelos de aprendizado onde somos receptores de conte\u00fado (1.0) ou esperamos respostas de um especialista a partir de nossas d\u00favidas (2.0) ou quando somos protagonistas do aprendizado (3.0). Sobre o modelo 3.0, a obra traz que o fluxo de aprendizado passa pelas etapas de problematiza\u00e7\u00e3o, pesquisa, conex\u00e3o, pr\u00e1tica e compartilhamento.<\/p>\n<p>Interligando tal conceito com agilidade nas organiza\u00e7\u00f5es, defendemos que para se aprender, \u00e9 necess\u00e1rio fazer. Nesta l\u00f3gica, a filosofia de construir, medir e aprender permitir\u00e1 que os ambientes criem robustez para lidar com as adversidades e a competi\u00e7\u00e3o inerente ao mercado. Tal paradigma me faz refletir sobre alguns questionamentos:<\/p>\n<ul>\n<li>Do que vale conte\u00fado (leia-se certifica\u00e7\u00f5es) sem pr\u00e1tica?<\/li>\n<li>O que s\u00e3o hip\u00f3teses para melhorar o neg\u00f3cio sem a constru\u00e7\u00e3o de um produto? Desilus\u00e3o das lideran\u00e7as e clientes?<\/li>\n<li>Pensando em transforma\u00e7\u00f5es, por que o estado atual nunca \u00e9 bom e s\u00f3 o que o que proponho serve? No meu ponto de vista, este tem sido um dos principais motivos das organiza\u00e7\u00f5es desperdi\u00e7arem dinheiro com &#8220;ado\u00e7\u00f5es de \u00e1gil&#8221; que geram cada vez menos resultados.<\/li>\n<\/ul>\n<p><strong>Conclus\u00e3o<\/strong><\/p>\n<p>Este texto foi um convite para refletirmos que existem diferentes formas de aprendermos e n\u00e3o ser\u00e1 uma sequ\u00eancia l\u00f3gica que nos transformar\u00e1 em uma pessoa mestre do saber. E voc\u00ea, como sua organiza\u00e7\u00e3o tem aprendido a desenvolver agilidade no neg\u00f3cio?<\/p>\n<p><strong>Deixo aqui algumas dicas aos interessados em se aprofundar mais nos temas abordados neste blog post:<\/strong><\/p>\n<ul>\n<li><a href=\"https:\/\/martinfowler.com\/bliki\/ShuHaRi.html\" rel=\"nofollow\">ShuHaRi<\/a><\/li>\n<li><a href=\"https:\/\/www.learning-theories.com\/\" rel=\"nofollow\">Learning theories<\/a><\/li>\n<li><a href=\"https:\/\/teacherofsci.com\/learning-theories-in-education\/\">15 Learning Theories in Education (A Complete Summary)<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Caso voc\u00ea tenha assistido alguma palestra sobre \u00e1gil na sua vida ou tenha participado de algum treinamento sobre o assunto, \u00e9 bem prov\u00e1vel que voc\u00ea tenha interagido com o conceito de Shu Ha Ri. Para quem n\u00e3o conhece, o nome tem origem no Aikido e foi introduzido no ambiente de desenvolvimento de software por Alistair &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/07\/uma-discussao-sobre-aprendizado-em-equipes\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,292],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7707"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7707"}],"version-history":[{"count":3,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7707\/revisions"}],"predecessor-version":[{"id":9163,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7707\/revisions\/9163"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7707"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7707"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7707"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}