{"id":8619,"date":"2019-02-13T15:00:18","date_gmt":"2019-02-13T17:00:18","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=8619"},"modified":"2019-03-08T10:51:33","modified_gmt":"2019-03-08T13:51:33","slug":"evite-mover-itens-para-tras-em-um-quadro-kanban","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/02\/evite-mover-itens-para-tras-em-um-quadro-kanban\/","title":{"rendered":"Evite mover itens para tr\u00e1s em um quadro kanban"},"content":{"rendered":"<p>Quando iniciamos uma jornada que tenha como um dos objetivos elevar a maturidade do processo dos times, costumamos come\u00e7ar tornando vis\u00edvel o fluxo de trabalho destas equipes.<\/p>\n<p>\u00c0 medida que os times come\u00e7am a enxergar as demandas fluindo pelas colunas do quadro kanban, aquele questionamento quase que inevit\u00e1vel surge:<\/p>\n<blockquote><p><em>Afinal de contas, posso mover os itens (cart\u00f5es) para tr\u00e1s?<\/em><\/p><\/blockquote>\n<p>H\u00e1 alguns poucos conte\u00fados sobre o assunto em ingl\u00eas (<a href=\"https:\/\/dzone.com\/articles\/moving-items-backwards-kanban\" target=\"_blank\" rel=\"noopener\">Moving cards backwards<\/a>,\u00a0<a href=\"https:\/\/medium.com\/@jezhalford\/kanban-avoiding-going-backwards-29077793c499\" target=\"_blank\" rel=\"noopener\">Avoiding going Backwards on Kanban<\/a>,\u00a0<a href=\"http:\/\/brodzinski.com\/2010\/10\/kanban-moving-cards-back.html\" target=\"_blank\" rel=\"noopener\">Kanban moving cards back<\/a>), por\u00e9m em portugu\u00eas o \u00fanico conte\u00fado que encontrei foi este v\u00eddeo bastante elucidativo do <a href=\"https:\/\/www.youtube.com\/watch?v=GrIu_211_OM\" target=\"_blank\" rel=\"noopener\">Rafael Buzon<\/a>. Dada esta escassez decidi compartilhar nossa opini\u00e3o a respeito.<\/p>\n<p>Caso voc\u00ea esteja com pressa, esta \u00e9 a nossa opini\u00e3o: <strong>Evite mover itens para tr\u00e1s<\/strong>.<\/p>\n<p>Agora se voc\u00ea dispuser de um pouco mais de tempo, vem comigo que vou explicar o porqu\u00ea.<\/p>\n<h2>Por que recomendamos n\u00e3o mover itens para tr\u00e1s?<\/h2>\n<p>Imagine a seguinte situa\u00e7\u00e3o: Um item de trabalho acaba de chegar em uma etapa de garantia de qualidade (coluna <strong>&#8220;Validando&#8221;<\/strong>) e alguns defeitos foram descobertos. Ser\u00e1 necess\u00e1rio um esfor\u00e7o das pessoas desenvolvedoras para corrigir estes defeitos.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8627 size-large\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-1024x576.png\" alt=\"\" width=\"1024\" height=\"576\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-1024x576.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-300x169.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-768x432.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><img decoding=\"async\" src=\"2019-01-evite-mover-itens-para-tras-em-um-quadro-kanban\/quadro1.png\" alt=\"\" \/><\/p>\n<p>Suponha que a equipe optou por dar visibilidade para isso retornando o item de trabalho defeituoso para a etapa <strong>&#8220;Pronto para fazer&#8221;<\/strong>. Observe como esta movimentac\u00e3o se reflete no quadro:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8629 size-large\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro2-1024x576.png\" alt=\"\" width=\"1024\" height=\"576\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro2-1024x576.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro2-300x169.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro2-768x432.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro2.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><br \/>\n<img decoding=\"async\" src=\"2019-01-evite-mover-itens-para-tras-em-um-quadro-kanban\/quadro2.png\" alt=\"\" \/><\/p>\n<p>Confira a seguir as implica\u00e7\u00f5es desta escolha:<\/p>\n<h3>Complica\u00e7\u00f5es extras com os limites de trabalho em progresso (limite WIP)<\/h3>\n<p>Se voc\u00ea utiliza dos <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/09\/case-study-of-a-wip-limit-implementation-why-when-and-how-to-use-wip-limits\/\" target=\"_blank\" rel=\"noopener\">limites WIP<\/a> para suavizar o fluxo de trabalho, mover itens para a esquerda pode complicar um mecanismo que deveria ser simples.<\/p>\n<p>No exemplo, o item defeituoso estoura o limite da coluna de <strong>&#8220;Pronto para fazer&#8221;<\/strong>. E agora?<\/p>\n<ul>\n<li>Deixamos de resolver o problema para n\u00e3o estourar o limite?<\/li>\n<li>Ignoramos o limite e movemos de qualquer forma?<\/li>\n<\/ul>\n<p>Acabamos de criar um dilema desnecess\u00e1rio. O quadro deveria induzir o time a tomar uma decis\u00e3o r\u00e1pida e n\u00e3o criar um debate improdutivo sobre as pol\u00edticas do fluxo (que deveriam ser claras, diga-se de passagem).<\/p>\n<h3>N\u00e3o haver\u00e1 um sinal indicando que a prioridade \u00e9 corrigir o defeito<\/h3>\n<p>O principal papel do quadro kanban \u00e9 prover sinais visuais ao time, proporcionando tomada de decis\u00e3o com autonomia e baixo custo de coordena\u00e7\u00e3o. Perceba que perdemos um pouco disso quando fizemos o item fluir para a esquerda:<\/p>\n<ul>\n<li>Ele acabou de se misturar com outros itens do backlog. E agora? O que deve ser feito primeiro? O quadro n\u00e3o comunica isso com clareza. Para que o item n\u00e3o seja esquecido, algu\u00e9m vai precisar informar que aquele item em especial merece aten\u00e7\u00e3o (menos autonomia e mais custo de coordena\u00e7\u00e3o).<\/li>\n<li>Perdemos tamb\u00e9m o efeito <a href=\"http:\/\/brodzinski.com\/2010\/05\/kanban-swarming.html\" target=\"_blank\" rel=\"noopener\"><em>swarming<\/em><\/a>, que acontece quando o time colabora para remover um impedimento do fluxo, em qualquer etapa. Uma premissa para que isso funcione de maneira aut\u00f4noma \u00e9 que seja poss\u00edvel visualizar em que etapa o problema foi descoberto, o que j\u00e1 n\u00e3o \u00e9 mais poss\u00edvel.<\/li>\n<\/ul>\n<h3>As m\u00e9tricas de processo possivelmente revelar\u00e3o falsos positivos<\/h3>\n<p>Se voc\u00ea estiver (e espero que voc\u00ea esteja) medindo seu fluxo atrav\u00e9s de m\u00e9tricas de processo, mover itens para a esquerda pode n\u00e3o ser uma boa ideia.<\/p>\n<p>Um dos grandes trunfos da instrumenta\u00e7\u00e3o de um fluxo de trabalho com indicadores \u00e9 a capacidade de diagnosticar problemas atrav\u00e9s da an\u00e1lise de <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-o-que-lead-time-fala-sobre-seu-projeto\/\" target=\"_blank\" rel=\"noopener\"><em>lead time<\/em><\/a> e das filas. Seria uma pena se estas m\u00e9tricas n\u00e3o falassem a verdade, n\u00e3o \u00e9 mesmo? Veja:<\/p>\n<ul>\n<li>Se voc\u00ea estiver medindo o <em>lead time<\/em> e tiver o h\u00e1bito de mover itens para tr\u00e1s quando encontra problemas, o <em>lead time<\/em> da etapa em que o item encontrou um bloqueio (<strong>&#8220;Validando&#8221;<\/strong>, por exemplo) n\u00e3o vai aumentar. Possivelmente isto vai acontecer em alguma outra coluna, como a <strong>&#8220;Backlog&#8221;<\/strong> ou <strong>&#8220;Fazendo&#8221;<\/strong>. Veja abaixo a compara\u00e7\u00e3o do <em>lead time<\/em> de uma mesma demanda, quando se move o item para tr\u00e1s e quando n\u00e3o se move:<img decoding=\"async\" src=\"2019-01-evite-mover-itens-para-tras-em-um-quadro-kanban\/falsopositivo.png\" alt=\"\" \/><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8630 size-large\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/falsopositivo-1024x623.png\" alt=\"\" width=\"1024\" height=\"623\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/falsopositivo-1024x623.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/falsopositivo-300x182.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/falsopositivo-768x467.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/li>\n<li>Ao analisar os gr\u00e1ficos como o <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/10\/metricas-ageis-cumulative-flow-diagrams-e-lead-time-breakdown\/\" target=\"_blank\" rel=\"noopener\"><em>Cumulative Flow Diagram<\/em> (CFD)<\/a> para fazer melhoria cont\u00ednua, etapas que n\u00e3o s\u00e3o verdadeiramente problem\u00e1ticas podem chamar sua aten\u00e7\u00e3o. Um tempo precioso pode ser perdido at\u00e9 que voc\u00ea entenda a real causa raiz do bloqueio e qual o plano de a\u00e7\u00e3o para sanar o problema.<\/li>\n<\/ul>\n<h3>Oportunidades de realizar melhoria cont\u00ednua ser\u00e3o perdidas<\/h3>\n<p>A tend\u00eancia de um sistema de trabalho, um sistema aberto, \u00e9 se deteriorar se n\u00e3o houver iniciativas de melhoria. Se estamos negligenciando a melhoria cont\u00ednua em nosso fluxo de trabalho, pagaremos o pre\u00e7o em breve, com juros e corre\u00e7\u00e3o monet\u00e1ria.<\/p>\n<p>Ter um conjunto de ferramentas que n\u00e3o nos alerta quando um problema acontece \u00e9 uma maneira de incrementar esta d\u00edvida e fazer um voo cego, vulner\u00e1vel aos riscos. Voc\u00ea j\u00e1 deve ter notado que mover itens para a esquerda quando se encontra um problema pode contribuir para isto, veja:<\/p>\n<ul>\n<li>Um item pode ser rejeitado in\u00fameras vezes na coluna <strong>&#8220;Validando&#8221;<\/strong>, voltar para o time de desenvolvimento e seguir sendo rejeitado em futuras tentativas. Isto \u00e9 um sintoma de um problema de qualidade que precisa ser resolvido. Mover o item para tr\u00e1s toda vez que esse problema surgir vai mascarar sua causa raiz, tratando-o como um acontecimento corriqueiro. Isto n\u00e3o vai bloquear o avan\u00e7o das outras demandas atrav\u00e9s do mecanismo de limite WIP, n\u00e3o vai doer nas pessoas. Se n\u00e3o d\u00f3i n\u00e3o chama a aten\u00e7\u00e3o e uma oportunidade de melhoria vai ser negligenciada, uma pena.<\/li>\n<\/ul>\n<h2>O que fazer ent\u00e3o?<\/h2>\n<p>Acredito que ficou evidente o que <strong>n\u00e3o<\/strong> se recomenda fazer ao encontrar bloqueios no fluxo de trabalho. Ent\u00e3o vamos agora \u00e0 parte onde compartilhamos maneiras de lidar com esta situa\u00e7\u00e3o de maneira saud\u00e1vel.<\/p>\n<p>Relembrando a situa\u00e7\u00e3o, acabamos de encontrar um defeito durante a etapa de valida\u00e7\u00e3o:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8627 size-large\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-1024x576.png\" alt=\"\" width=\"1024\" height=\"576\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-1024x576.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-300x169.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1-768x432.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/Imagem-1.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><img decoding=\"async\" src=\"2019-01-evite-mover-itens-para-tras-em-um-quadro-kanban\/quadro1.png\" alt=\"\" \/><\/p>\n<p>Da pr\u00f3xima vez que voc\u00ea se deparar com isto, tente o seguinte:<\/p>\n<ul>\n<li>Mantenha o item na coluna em que o problema foi encontrado.<\/li>\n<li>D\u00ea algum tipo de destaque para o item problem\u00e1tico:<\/li>\n<li>Se voc\u00ea estiver usando um quadro f\u00edsico, colar um <em>post it<\/em> chamativo sobre o item deve ser suficiente. \u00c9 interessante que este post it descreva o problema a ser resolvido.<\/li>\n<li>Se voc\u00ea utilizar um quadro digital como no <em>Trello<\/em> ou <em>JIRA<\/em>, a maioria das ferramentas conta com uma funcionalidade de &#8220;bloqueio&#8221; que destaca o item desejado. Voc\u00ea tamb\u00e9m pode usar sub tarefas representando os problemas, para que o time consiga dar visibilidade para o progresso das corre\u00e7\u00f5es.<\/li>\n<\/ul>\n<p>O quadro vai ficar com uma apar\u00eancia semelhante \u00e0 esta:<br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8631 size-large\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro3-1024x576.png\" alt=\"\" width=\"1024\" height=\"576\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro3-1024x576.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro3-300x169.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro3-768x432.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/quadro3.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><img decoding=\"async\" src=\"2019-01-evite-mover-itens-para-tras-em-um-quadro-kanban\/quadro3.png\" alt=\"\" \/><\/p>\n<p>Deste modo:<\/p>\n<ul>\n<li>Ao olhar para o quadro, ficaria evidente que um problema aconteceu, e que por ele estar mais \u00e0 direita \u00e9 mais importante elimin\u00e1-lo do que focar nas etapas anteriores. Isto tende a diminuir o <em>lead time<\/em> pois o time consumir\u00e1 menos tempo pra responder ao problema e solucion\u00e1-lo. Abordamos este assunto em um <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/03\/desenvolvendo-melhoria-continua-em-seu-processo-agil-um-daily-meeting-diferente\/\" target=\"_blank\" rel=\"noopener\">blog post<\/a> sobre <em>daily meetings<\/em>.<\/li>\n<li>Se um item fica bloqueado nesta coluna por muito tempo, gr\u00e1ficos como a distribui\u00e7\u00e3o de <em>lead time<\/em> e o CFD evidenciar\u00e3o que h\u00e1 um gargalo ali. A coluna que vai chamar a aten\u00e7\u00e3o ser\u00e1 claramente a <strong>&#8220;Validando&#8221;<\/strong>, onde a maioria dos problemas \u00e9 descoberto em nosso exemplo. Esta informa\u00e7\u00e3o \u00e9 valiosa e vai proporcionar uma an\u00e1lise de causa raiz bem mais certeira.<\/li>\n<li>Se um item for corrigido diversas vezes e mesmo assim n\u00e3o satisfizer os crit\u00e9rios para sair da coluna <strong>&#8220;Validando&#8221;<\/strong>, tanto o quadro quanto as m\u00e9tricas passar\u00e3o a evidenciar que h\u00e1 um gargalo ali, que algo est\u00e1 doendo e precisa ser remediado. Este \u00e9 um belo convite \u00e0 melhoria cont\u00ednua.<\/li>\n<\/ul>\n<h2>Por que as pessoas sentem vontade de mover itens para tr\u00e1s?<\/h2>\n<p>Antes de seguir para o encerramento do texto, eu gostaria de propor um exerc\u00edcio de empatia. A frequ\u00eancia com a qual vivencio a situa\u00e7\u00e3o que descrevi \u00e9 consider\u00e1vel, o que me fez pensar:<\/p>\n<blockquote><p>Por que \u00e9 t\u00e3o intuitivo para as pessoas mover os cart\u00f5es para tr\u00e1s?<\/p><\/blockquote>\n<p>Formulei ent\u00e3o algumas hip\u00f3teses a respeito:<\/p>\n<h3>Favorece o <em>status report<\/em><\/h3>\n<p>Ambientes onde a confian\u00e7a \u00e9 baixa tendem \u00e0 microgest\u00e3o. Reportar com precis\u00e3o o que te mant\u00e9m ocupado agora \u00e9 incentivado em detrimento de dar visibilidade aos problemas do sistema.<\/p>\n<p>Vejo isto se materializado naqueles <em>dailies<\/em> em que as pessoas falam o que est\u00e3o fazendo e o que pretendem fazer, mas pouco se discute sobre os problemas que estamos enfrentando e como resolv\u00ea-los.<\/p>\n<h3>Em ambientes pouco colaborativos, \u00e9 uma maneira de se eximir da culpa por um problema<\/h3>\n<p>Se o ambiente valoriza mais as contribui\u00e7\u00f5es individuais do que as coletivas e a responsabilidade de uma das pessoas do time \u00e9 fazer a valida\u00e7\u00e3o de qualidade dos itens de trabalho desenvolvidos, um ac\u00famulo de itens na coluna <strong>&#8220;Validando&#8221;<\/strong> poderia denotar que esta pessoa n\u00e3o est\u00e1 conseguindo dar a vaz\u00e3o necess\u00e1ria ao trabalho, ou que o problema descoberto foi causado por ela (quando na verdade foi apenas descoberto na etapa em que ela costuma atuar).<\/p>\n<p>\u00c9 muito mais confort\u00e1vel transferir esta reponsabilidade para outra pessoa movendo o item para outra coluna.<\/p>\n<p>Para ambos os casos citados, parece fazer sentido demonstrar as vantagens da colabora\u00e7\u00e3o para a sa\u00fade do fluxo de trabalho, e por que n\u00e3o, das pessoas envolvidas nele. Para ler mais a respeito de colabora\u00e7\u00e3o e gest\u00e3o de fluxo, confira este ebook que escrevi: <a href=\"http:\/\/pages.plataformatec.com.br\/5-estrategias-para-otimizar-fluxo-de-desenvolvimento-de-software\" target=\"_blank\" rel=\"noopener\">http:\/\/pages.plataformatec.com.br\/5-estrategias-para-otimizar-fluxo-de-desenvolvimento-de-software<\/a>.<\/p>\n<h2>Finalizando<\/h2>\n<p>Quero aproveitar o trecho final para destacar que a minha inten\u00e7\u00e3o n\u00e3o \u00e9 mostrar o que \u00e9 certo e o que \u00e9 errado, \u00e9 simplesmente discutir pr\u00e1ticas que funcionaram melhor nas situa\u00e7\u00f5es que n\u00f3s j\u00e1 enfrentamos. Imagino que sim, deve haver algum cen\u00e1rio em que fa\u00e7a sentido mover os itens para tr\u00e1s, e tudo bem.<\/p>\n<p>Outro ponto que gostaria de destacar \u00e9 que \u00e9 importante deixar as pessoas experimentarem um contexo, para que depois reflitam sobre como podem melhorar sua situa\u00e7\u00e3o atual e fa\u00e7am a sua escolha. Para o assunto que foi levantado, n\u00e3o vejo problema algum em permitir que um time rode por algumas semanas movendo itens para tr\u00e1s para que depois seja apresentado ao outro modelo. Um bom momento para se fazer isso parece ser quando se inicia a ado\u00e7\u00e3o das m\u00e9tricas de processo.<\/p>\n<p>E voc\u00ea? J\u00e1 passou por esta situa\u00e7\u00e3o com algum time? J\u00e1 sentiu vontade de mover itens para a esquerda? Como lidou com isso? Quero ouvir sua opini\u00e3o nos coment\u00e1rios!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Quando iniciamos uma jornada que tenha como um dos objetivos elevar a maturidade do processo dos times, costumamos come\u00e7ar tornando vis\u00edvel o fluxo de trabalho destas equipes. \u00c0 medida que os times come\u00e7am a enxergar as demandas fluindo pelas colunas do quadro kanban, aquele questionamento quase que inevit\u00e1vel surge: Afinal de contas, posso mover os &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/02\/evite-mover-itens-para-tras-em-um-quadro-kanban\/\">\u00bb<\/a><\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8619"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=8619"}],"version-history":[{"count":19,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8619\/revisions"}],"predecessor-version":[{"id":8848,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8619\/revisions\/8848"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=8619"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=8619"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=8619"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}