{"id":6091,"date":"2017-02-09T11:04:44","date_gmt":"2017-02-09T13:04:44","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6091"},"modified":"2017-02-09T12:51:38","modified_gmt":"2017-02-09T14:51:38","slug":"desenvolvendo-melhoria-continua-em-seu-processo-agil-a-cerimonia-de-reality-check","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/02\/desenvolvendo-melhoria-continua-em-seu-processo-agil-a-cerimonia-de-reality-check\/","title":{"rendered":"Desenvolvendo melhoria cont\u00ednua em seu processo \u00e1gil: A cerim\u00f4nia de Reality Check"},"content":{"rendered":"<p>Voc\u00ea come\u00e7ar\u00e1 a desenvolver um novo produto. \u00d3timo! Voc\u00ea re\u00fane um time de desenvolvimento not\u00e1vel para montar um MVP. J\u00e1 que voc\u00ea teve a ideia, nada mais justo de se tornar o CEO dessa nova startup e, portanto, decidir as partes relacionadas ao neg\u00f3cio do produto (data de lan\u00e7amento, segmenta\u00e7\u00e3o de mercado, decis\u00f5es de neg\u00f3cio e etc.).<\/p>\n<p>Voc\u00ea decide estrat\u00e9gias de marketing e neg\u00f3cios. Voc\u00ea decide as datas de lan\u00e7amento de acordo com os planos de competidores em potencial. Tudo parece estar bem planejado!<\/p>\n<p>A primeira coisa que voc\u00ea faz em rela\u00e7\u00e3o ao desenvolvimento \u00e9 dar in\u00edcio \u00e0 fase de <em>inception<\/em> com seu time. Voc\u00ea diz o que quer construir, eles d\u00e3o feedbacks e fazem sugest\u00f5es, voc\u00ea muda algumas coisas de acordo com as novas opini\u00f5es e todos encontram um consenso sobre como o produto deve estar em cada data importante, e como o time deve come\u00e7ar o desenvolvimento. Perfeito!<\/p>\n<p>Com tudo organizado, voc\u00ea decide deixar o time dar seus pr\u00f3prios passos e n\u00e3o microgerenci\u00e1-los. Voc\u00ea foca nas estrat\u00e9gias de neg\u00f3cio enquanto o time est\u00e1 trabalhando no backlog do produto. Voc\u00ea at\u00e9 olha como as hist\u00f3rias do backlog est\u00e3o sendo consumidas, mas j\u00e1 que decidiu se afastar, perdeu o contexto e isso n\u00e3o fala muito sobre andamento das entregas.<\/p>\n<p>Um m\u00eas depois, voc\u00ea est\u00e1 a dois dias do primeiro lan\u00e7amento. Seu time se encontra com voc\u00ea e diz que tem muita coisa para desenvolver e que definitivamente n\u00e3o entregar\u00e3o tudo at\u00e9 a data&#8230; Oi?!<\/p>\n<hr \/>\n<p>Ent\u00e3o, isso \u00e9 algo comum de se acontecer&#8230; A \u00e1rea de neg\u00f3cios e a \u00e1rea t\u00e9cnica raramente trocam informa\u00e7\u00f5es ao longo do processo de desenvolvimento. Geralmente as duas come\u00e7am com as mesmas ideias e mesmos planejamentos, mas divergem rapidamente.<\/p>\n<p>O que n\u00f3s da Plataformatec fazemos para evitar isso \u00e9 realizar o que chamamos de cerim\u00f4nia de Reality Check. N\u00f3s a realizamos sob demanda, toda vez que o time de desenvolvimento sente que eles tem muito trabalho para fazer em um pequeno intervalo de tempo. Esse sentimento \u00e9 geralmente captado nas reuni\u00f5es di\u00e1rias e\/ou em retrospectivas. Tentamos ent\u00e3o realizar a cerim\u00f4nia o quanto antes para evitar cenas como a mencionada acima.<\/p>\n<h2>A cerim\u00f4nia<\/h2>\n<p>Os participantes dessa cerim\u00f4nia devem ser o time de desenvolvimento e as pessoas que decidem o plano de neg\u00f3cios, como o pr\u00f3prio CEO, um Product Owner que sirva de proxy para a \u00e1rea de neg\u00f3cios, ou qualquer outra pessoa que possa influenciar os planos do projeto.<\/p>\n<p>Antes da cerim\u00f4nia, o facilitador cola, em uma parede ou quadro, post-its representando cada uma das hist\u00f3rias restantes para alcan\u00e7ar um certo deadline (poderia ser um novo lan\u00e7amento ou apenas datas fixas).<\/p>\n<p>Assim que a cerim\u00f4nia come\u00e7a, o time de desenvolvimento discute e explica cada uma das hist\u00f3rias que est\u00e3o ali, destacando as dificuldades t\u00e9cnicas de implement\u00e1-las. A ideia \u00e9 colocar todos na mesma p\u00e1gina em rela\u00e7\u00e3o ao andamento do projeto e informar a todos os stakeholders presentes quanto ao progresso.<\/p>\n<p>Ap\u00f3s a explica\u00e7\u00e3o e debate de todas as hist\u00f3rias, o facilitador d\u00e1 a cada membro um papel no qual ele dever\u00e1 escrever o qu\u00e3o confort\u00e1vel se sente em entregar o necess\u00e1rio at\u00e9 a pr\u00f3xima deadline. Geralmente usamos um intervalo de 1-5 para facilitar a vota\u00e7\u00e3o, no qual 5 \u00e9 totalmente confort\u00e1vel e 1 \u00e9 o totalmente desconfort\u00e1vel. Algumas vezes vemos que \u00e9 necess\u00e1rio remover o elemento central do intervalo, reestruturando a vota\u00e7\u00e3o de 1 a 4, pois muitas pessoas se prendem ao valor central (3 no caso 1-5).<\/p>\n<p>Com os n\u00fameros mostrados ao mesmo tempo, para n\u00e3o enviesar uns aos outros, deixamos que as pessoas com os maiores e menores n\u00fameros expliquem suas vis\u00f5es sobre a possibilidade da entrega. Se a maioria das pessoas continuarem com o sentimento de que a entrega \u00e9 improv\u00e1vel, a \u00e1rea de neg\u00f3cios deve intervir, repriorizar e cortar o backlog, ou ajustar o deadline.<\/p>\n<p>Outra abordagem que seguimos \u00e9 esta:<\/p>\n<ul>\n<li>Colocamos uma coluna com o backlog priorizado;<\/li>\n<li>Colocamos uma coluna para cada semana restante, at\u00e9 o deadline;<\/li>\n<li>O grupo tenta encaixar as hist\u00f3rias dentro das semanas restantes;<\/li>\n<li>Depois disso, a mesma vota\u00e7\u00e3o com os intervalos de 1-4 ou 1-5 acontece para saber o qu\u00e3o confort\u00e1veis est\u00e3o com o plano;<\/li>\n<li>Se os votos s\u00e3o baixos, tentamos decidir a\u00e7\u00f5es para que os fa\u00e7am aumentar.<\/li>\n<\/ul>\n<h2>Conclus\u00e3o<\/h2>\n<p>A ideia da cerim\u00f4nia \u00e9 aumentar a visibilidade do desenvolvimento do projeto para aqueles que n\u00e3o est\u00e3o ali o tempo todo e, se necess\u00e1rio, desencadear mudan\u00e7as no plano de neg\u00f3cios. Quanto mais r\u00e1pido o feedback, mais f\u00e1cil e indolor ser\u00e1 pensar em uma solu\u00e7\u00e3o. As duas abordagens apresentadas servem para mostrar que n\u00e3o existe uma regra de como realizar esta cerim\u00f4nia. Se os objetivos da mesma for cumprido, voc\u00ea est\u00e1 fazendo do jeito certo! \ud83d\ude09<\/p>\n<p>O que achou da cerim\u00f4nia? Voc\u00ea a usaria? Deixe seus coment\u00e1rios abaixo!<\/p>\n<hr>\n<div style=\"margin:20px 0 60px;\">\n<a href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=curso-metricas-agile&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\"><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile.png\" alt=\"M\u00e9tricas para Projetos Agile em 7 e-mails\" width=\"831\" height=\"147\" class=\"aligncenter size-full wp-image-5972\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile.png 831w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile-300x53.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile-768x136.png 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Voc\u00ea come\u00e7ar\u00e1 a desenvolver um novo produto. \u00d3timo! Voc\u00ea re\u00fane um time de desenvolvimento not\u00e1vel para montar um MVP. J\u00e1 que voc\u00ea teve a ideia, nada mais justo de se tornar o CEO dessa nova startup e, portanto, decidir as partes relacionadas ao neg\u00f3cio do produto (data de lan\u00e7amento, segmenta\u00e7\u00e3o de mercado, decis\u00f5es de neg\u00f3cio &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/02\/desenvolvendo-melhoria-continua-em-seu-processo-agil-a-cerimonia-de-reality-check\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,254],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6091"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6091"}],"version-history":[{"count":5,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6091\/revisions"}],"predecessor-version":[{"id":6101,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6091\/revisions\/6101"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6091"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6091"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6091"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}