{"id":7715,"date":"2018-08-02T09:30:11","date_gmt":"2018-08-02T12:30:11","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7715"},"modified":"2018-08-01T19:16:39","modified_gmt":"2018-08-01T22:16:39","slug":"ta-quantos-por-cento-pronto-agile-para-pmps-e-pmbok-para-agilistas","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/08\/ta-quantos-por-cento-pronto-agile-para-pmps-e-pmbok-para-agilistas\/","title":{"rendered":"T\u00e1 quantos por cento pronto? Agile para PMPs e PMBok para agilistas"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Pol\u00eamica! Ainda esses dias, conversava com um respons\u00e1vel pelo cap\u00edtulo de agilidade de uma startup sobre reports de projeto sedutores e o mal que eles podem fazer. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A situa\u00e7\u00e3o \u00e9 a seguinte: n\u00e3o habituados com a forma como as m\u00e9tricas de projetos \u00e1geis s\u00e3o apresentadas &#8211; <\/span><i><span style=\"font-weight: 400;\">CFDs<\/span><\/i><span style=\"font-weight: 400;\">, histogramas de <\/span><i><span style=\"font-weight: 400;\">Throughput<\/span><\/i><span style=\"font-weight: 400;\">, <\/span><i><span style=\"font-weight: 400;\">Lead Time<\/span><\/i><span style=\"font-weight: 400;\"> etc. &#8211; e na \u00e2nsia de mostrar que tudo vai bem, um dos POs pede para um designer experiente criar um report mais bonitinho. O designer cria um dashboard lind\u00e3o com alguns sem\u00e1foros, barras de progresso mostrando percentuais de completude, aceler\u00f4metros e uma s\u00e9rie de <\/span><i><span style=\"font-weight: 400;\">pirotecnias<\/span><\/i><span style=\"font-weight: 400;\"> para comparar o avan\u00e7o das iniciativas que est\u00e3o em paralelo. Seduzido pela beleza daquele report, o head de produtos &#8220;sugere de maneira convincente&#8221; aos outros POs a utiliza\u00e7\u00e3o daquele formato <\/span><i><span style=\"font-weight: 400;\">lindoso<\/span><\/i><span style=\"font-weight: 400;\">. E a\u00ed \u00e9 que come\u00e7am os problemas.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-7721 aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2centro-1024x875.png\" alt=\"\" width=\"980\" height=\"837\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2centro-1024x875.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2centro-300x256.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2centro-768x656.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2centro.png 1290w\" sizes=\"(max-width: 980px) 100vw, 980px\" \/><br \/>\n<span style=\"font-weight: 400;\">Nos tempos em que o PMBoK reinava como padr\u00e3o inquestion\u00e1vel de boas pr\u00e1ticas em gest\u00e3o de projetos, come\u00e7aram a surgir os PMOs (escrit\u00f3rios de projetos) corporativos e tamb\u00e9m a maior parte das distor\u00e7\u00f5es na interpreta\u00e7\u00e3o dessas boas pr\u00e1ticas. Logo, PMO virou um papel. O PMO (pessoa), quando empoderado pela corpora\u00e7\u00e3o, rapidamente lan\u00e7ava sua MGP (Metodologia de Gest\u00e3o de Projetos), acompanhada de seu <\/span><i><span style=\"font-weight: 400;\">&#8220;Kit PMO&#8221;<\/span><\/i><span style=\"font-weight: 400;\">, composto de template de termo de abertura, 3 planilhas, <\/span><i><span style=\"font-weight: 400;\">&#8220;Template de Change Request&#8221;<\/span><\/i><span style=\"font-weight: 400;\">, e, pra fechar o kit, o famoso &#8220;<\/span><i><span style=\"font-weight: 400;\">Template Powerpoint de Status Report&#8221;<\/span><\/i><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A abordagem \u00e1gil simplifica tremendamente os reports. Para quem usa &#8220;\u00e1gil b\u00e1sico&#8221; como Scrum, o mais comum \u00e9 usar medidas de velocidade e gr\u00e1ficos de <\/span><i><span style=\"font-weight: 400;\">Burndown<\/span><\/i><span style=\"font-weight: 400;\">. Numa abordagem \u00e1gil mais avan\u00e7ada, podemos usar <\/span><i><span style=\"font-weight: 400;\">Throughput, Burnup, Lead Time<\/span><\/i><span style=\"font-weight: 400;\"> dentre outras varia\u00e7\u00f5es. Essas abordagens costumam ser bem mais precisas, mas n\u00e3o s\u00e3o t\u00e3o elegantes quanto os reports <\/span><i><span style=\"font-weight: 400;\">&#8220;dashboard style&#8221;<\/span><\/i><span style=\"font-weight: 400;\">; Mais que isso, ainda n\u00e3o existe massa cr\u00edtica cultural suficiente para ado\u00e7\u00e3o dessas m\u00e9tricas e v\u00e1rias pessoas que s\u00e3o gestores atualmente foram &#8220;educadas&#8221; com as m\u00e9tricas tradicionais. Talvez uma abordagem h\u00edbrida possa ajudar, mas pra chegar l\u00e1 precisamos entender, afinal, porque fazemos esses reports.<\/span><\/p>\n<p><b>Mas afinal, para que servem os Reports? <\/b><\/p>\n<p><span style=\"font-weight: 400;\">Reports de projeto tem duas fun\u00e7\u00f5es b\u00e1sicas:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Manter as expectativas dos stakeholders alinhadas<\/b><span style=\"font-weight: 400;\">: um projeto envolve investimento e expectativas. \u00c9 muito ruim frustrar essas expectativas. Pior que isso, \u00e9 frustrar essas expectativas tarde demais. Os reports buscam manter as expectativas sob controle, diluir a frustra\u00e7\u00e3o ao longo do projeto.<\/span><\/li>\n<li><b>Transparecer a situa\u00e7\u00e3o do projeto e tomar a\u00e7\u00f5es de controle: <\/b><span style=\"font-weight: 400;\">\u00c9 normal um projeto n\u00e3o sair conforme o planejado. O que n\u00e3o pode faltar, entretanto, s\u00e3o a\u00e7\u00f5es para trazer o projeto de volta a uma situa\u00e7\u00e3o saud\u00e1vel. Mas voc\u00ea s\u00f3 consegue tomar a\u00e7\u00f5es de controle e adaptar o projeto se tiver a consci\u00eancia da situa\u00e7\u00e3o do projeto. <\/span><b><\/b><br \/>\n<b>Como o PMBoK aborda os reports?<\/b><span style=\"font-weight: 400;\">De maneira resumida, o PMBoK prop\u00f5e que esses objetivos sejam obtidos atrav\u00e9s de 3 vis\u00f5es:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Passado: <\/span><i><span style=\"font-weight: 400;\">Progress Report<\/span><\/i><span style=\"font-weight: 400;\">, ou relat\u00f3rio de progresso;<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Presente: <\/span><i><span style=\"font-weight: 400;\">Status Report<\/span><\/i><span style=\"font-weight: 400;\">, ou relat\u00f3rio de status\/situa\u00e7\u00e3o do projeto<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Futuro: <\/span><i><span style=\"font-weight: 400;\">Forecast Report<\/span><\/i><span style=\"font-weight: 400;\">, ou relat\u00f3rio de previs\u00f5es\/proje\u00e7\u00f5es<\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7722\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3centro-1024x428.png\" alt=\"\" width=\"1024\" height=\"428\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3centro-1024x428.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3centro-300x125.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3centro-768x321.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3centro.png 1464w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Para gerar essas vis\u00f5es, o PMBoK utiliza &#8220;<\/span><i><span style=\"font-weight: 400;\">Baselines<\/span><\/i><span style=\"font-weight: 400;\">&#8220;, ou linhas de compara\u00e7\u00e3o. O conceito \u00e9 bem simples: comparar o planejado contra o realizado. O baseline representa o planejado. O realizado \u00e9 obtido atrav\u00e9s das medi\u00e7\u00f5es que voc\u00ea faz ao longo do projeto.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">O PMBoK prop\u00f5e tamb\u00e9m o uso do m\u00e9todo do valor agregado. A ideia originalmente \u00e9 boa: desenhe uma linha do tempo do projeto numa dimens\u00e3o horizontal. \u00a0Essa linha representa o baseline de tempo, tamb\u00e9m chamado de Cronograma. Desenhe tamb\u00e9m uma linha representando os custos na dimens\u00e3o vertical.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7723\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/4centro-1024x631.png\" alt=\"\" width=\"980\" height=\"604\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/4centro-1024x631.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/4centro-300x185.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/4centro-768x473.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/4centro.png 1218w\" sizes=\"(max-width: 980px) 100vw, 980px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Entenda quanto custa cada entreg\u00e1vel do projeto e em que momento ele deveria ser entregue. Plote uma linha de &#8220;Valor Planejado Acumulado&#8221;, que representa quanto voc\u00ea deveria gastar ao longo do projeto. Essa linha representa o baseline de custos, tamb\u00e9m chamado de Or\u00e7amento;<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7724\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/5centro-1024x703.png\" alt=\"\" width=\"1024\" height=\"703\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/5centro-1024x703.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/5centro-300x206.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/5centro-768x528.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/5centro.png 1214w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Ao longo do projeto, desenhe uma segunda linha representando a grana que voc\u00ea realmente gastou no projeto. Essa \u00e9 a linha de custos. Apresente tamb\u00e9m uma terceira linha com o valor planejado inicialmente das entregas realizadas. Essa \u00e9 a linha do valor agregado, que mede o escopo entregue. Nessa \u00fanica vis\u00e3o voc\u00ea representa os baselines de tempo, custo, e escopo, nas dimens\u00f5es de planejado e realizado. Assim, voc\u00ea \u00e9 capaz de dizer se o projeto est\u00e1 adiantado, atrasado e se o or\u00e7amento est\u00e1 sendo cumprido ou se voc\u00ea est\u00e1 torrando grana al\u00e9m do necess\u00e1rio. No exemplo abaixo voc\u00ea pode notar que o Valor Agregado est\u00e1 abaixo do valor planejado, portanto foi produzido menos do que era esperado para aquela data. Logo, \u00e9 um sinal de que o projeto est\u00e1 atrasado.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7725\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/6centro-1024x711.png\" alt=\"\" width=\"1024\" height=\"711\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/6centro-1024x711.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/6centro-300x208.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/6centro-768x533.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/6centro.png 1236w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Adicionando nessa mesma vis\u00e3o o custo real do projeto, voc\u00ea pode dizer se est\u00e1 abaixo ou acima do or\u00e7amento, se vai precisar de mais grana ou a grana prevista inicialmente vai dar pro gasto. No exemplo abaixo, o Custo Real est\u00e1 acima do planejado na data do status, logo, o projeto est\u00e1 gastando mais grana do que deveria:<\/span><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7731\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/entrarosa-1024x685.png\" alt=\"\" width=\"1024\" height=\"685\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/entrarosa-1024x685.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/entrarosa-300x201.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/entrarosa-768x514.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/entrarosa.png 1220w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Usando os \u00edndices de performance obtidos pela compara\u00e7\u00e3o do planejado contra o realizado, voc\u00ea consegue fazer proje\u00e7\u00f5es de tend\u00eancias como as da figura abaixo e dizer quando o projeto terminar\u00e1 e quanta grana vai precisar al\u00e9m daquilo que previu. Consegue calcular percentuais de completude do projeto e desenhar indicadores super precisos. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7726\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/8centro-1024x708.png\" alt=\"\" width=\"1024\" height=\"708\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/8centro-1024x708.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/8centro-300x208.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/8centro-768x531.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/8centro.png 1220w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">S\u00d3 QUE\u2026 essa vis\u00e3o tem algumas premissas muito claras:<\/span><\/p>\n<ul>\n<li><b>Voc\u00ea sabe exatamente qual \u00e9 o custo de cada entreg\u00e1vel do seu projeto:<\/b><span style=\"font-weight: 400;\"> Essa premissa \u00e9 \u00f3tima para trabalhos preditivos, mas n\u00e3o servem para o trabalho do conhecimento, onde as entregas s\u00e3o &#8220;soft&#8221; e \u00e9 imposs\u00edvel determinar o custo exato de cada pacote ou entrega;<\/span><\/li>\n<li><b>Voc\u00ea controla os custos do seu projeto por entreg\u00e1vel: <span style=\"font-weight: 400;\">A maior parte da for\u00e7a de trabalho das organiza\u00e7\u00f5es hoje \u00e9 composta por trabalhadores do conhecimento. Isso faz com que os custos dos projetos, incluindo m\u00e3o de obra, materiais etc., seja alocado principalmente em forma de bols\u00f5es, para facilitar a gest\u00e3o. Isso faz com que na maioria dos projetos, no m\u00e1ximo, \u00a0seja controlado o apontamento de horas e nunca por entreg\u00e1vel (pelo menos eu nunca vi);<\/span><\/b><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<ul>\n<li><b>Existe pouca variabilidade no escopo: <span style=\"font-weight: 400;\">Numa abordagem preditiva, seu n\u00edvel de risco em rela\u00e7\u00e3o ao escopo \u00e9 pouco; Isso permite que voc\u00ea tenha uma vis\u00e3o do projeto como um todo e por consequ\u00eancia um n\u00edvel de conforto para se comprometer com o escopo num ponto muito pr\u00f3ximo ao in\u00edcio do projeto, tornando essas proje\u00e7\u00f5es mais valiosas<\/span><\/b><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Essa distor\u00e7\u00e3o entre a teoria baseada em projetos preditivos e a pr\u00e1tica da gest\u00e3o de projetos na vida real faz com que esses reports baseados em valor agregado gerem a falta de transpar\u00eancia. Como \u00e9 imposs\u00edvel calcular corretamente esses percentuais no trabalho do conhecimento, sempre (pelo menos eu nunca vi n\u00e3o acontecer) os gestores respons\u00e1veis acabam inferindo alguns valores e gerando os famosos indicadores melancias: aqueles que s\u00e3o verdinhos por fora, mas por dentro, na verdade s\u00e3o vermelhos. O gestor do projeto reporta que est\u00e1 tudo bem, mas na verdade o projeto est\u00e1 com problemas. Isso fere os pilares de transpar\u00eancia e adapta\u00e7\u00e3o da agilidade.<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">O PMBoK tamb\u00e9m prop\u00f5e algumas &#8220;regras&#8221; como forma de avaliar o percentual de completude das entregas de um projeto, para evitar infer\u00eancias e a s\u00edndrome dos 99%, tamb\u00e9m conhecida como barra de progresso do Windows, que ocorre quando o 1% final do trabalho de uma entrega leva mais tempo que os outros 99% juntos:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">20\/80: Quando o trabalho \u00e9 iniciado, s\u00e3o reportados 20% de progresso. Os outros 80% s\u00e3o reportados apenas quando o trabalho \u00e9 conclu\u00eddo.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">50\/50: Quando o trabalho \u00e9 iniciado, s\u00e3o reportados 50% de progresso. Os outros 50% s\u00e3o reportados apenas quando o trabalho \u00e9 conclu\u00eddo.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">0\/100: N\u00e3o tem meio termo. O progresso \u00e9 medido apenas quando o trabalho \u00e9 conclu\u00eddo.<\/span><\/li>\n<\/ul>\n<p><b>Abordagem Agile<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Minha inten\u00e7\u00e3o com esse artigo n\u00e3o \u00e9 explicar em detalhes como funcionam m\u00e9tricas numa abordagem \u00e1gil. Se voc\u00ea quiser se aprofundar, <\/span><a href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=curso-metricas-agile&amp;utm_content=pagina-blog-materiais-agile\"><span style=\"font-weight: 400;\">sugiro <\/span><\/a><span style=\"font-weight: 400;\">voc\u00ea fazer o curso por email do meu colega Raphael Albino, que j\u00e1 escreveu at\u00e9 livro sobre o assunto. Limitar-me-ei a citar alguns exemplos, na profundidade suficiente para que possa rolar uma compara\u00e7\u00e3o entre a proposta do PMBoK, que \u00e9 mais preditiva, com a proposta mais adaptativa:<\/span><\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li><b>O Burnup \u00e9 o MVP da Curva S.<\/b><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Como n\u00e3o conseguimos estimar custos em trabalhos do conhecimento, surgiu ent\u00e3o uma vers\u00e3o simplificada da curva &#8220;S&#8221;, o &#8220;Burnup&#8221;, que traz apenas as dimens\u00f5es de tempo e escopo.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Veja que o burnup permite acompanhar o progresso e tamb\u00e9m fazer proje\u00e7\u00f5es, igualzinho ao que era proposto pelo m\u00e9todo do valor agregado, s\u00f3 que de forma bem mais simples.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7727\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/9centro-1024x399.png\" alt=\"\" width=\"1024\" height=\"399\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/9centro-1024x399.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/9centro-300x117.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/9centro-768x300.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/9centro.png 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li><b>D\u00e1 pra fazer Forecast at\u00e9 quando o escopo n\u00e3o est\u00e1 fechado.<\/b><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Uma outra quest\u00e3o que surge quando trabalhamos com Agile \u00e9 que o escopo n\u00e3o tem um limite claro. Quando a gente trava o escopo por sprint, por exemplo, podemos usar o burndown para acompanhar esse progresso, mas fica complicado fazer um burndown para a iniciativa como um todo, pois a flexibilidade do escopo pode distorcer essa proje\u00e7\u00e3o.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Quando trabalhamos com sistema puxado e queremos saber quanto tempo \u00a0alguma coisa vai demorar para ficar pronta depois de iniciada, podemos usar uma an\u00e1lise de &#8220;lead time&#8221;, baseado no hist\u00f3rico de entregas, bastando para isso o cuidado de manter os pacotes medidos com tamanhos similares.<\/span><\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li><b>No Agile \u00e9 sempre 0\/100<\/b><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">A principal medida de progresso \u00e9 software em funcionamento. Princ\u00edpio 7\/12 do manifesto \u00e1gil. Substituamos software por produto\/servi\u00e7o. Significa que para contar progresso de verdade, s\u00f3 vale quando aquilo que voc\u00ea est\u00e1 produzindo atingir sua &#8220;Defini\u00e7\u00e3o de pronto&#8221;. A\u00ed voc\u00ea pode reportar progresso.<\/span><\/p>\n<p><b>Uma abordagem h\u00edbrida &#8211; T\u00e1 quantos por cento pronto?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Gostaria de compartilhar com voc\u00eas uma abordagem que eu utilizei para conseguir reportar em formato <\/span><i><span style=\"font-weight: 400;\">lindoso<\/span><\/i><span style=\"font-weight: 400;\">, com percentuais de completude, a Sponsors e Stakeholders que n\u00e3o estavam acostumados com m\u00e9tricas \u00e1geis. <\/span><b>Voc\u00ea tamb\u00e9m pode usar isso como estrat\u00e9gia de transi\u00e7\u00e3o.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Utilizei essa abordagem em projetos nas seguintes situa\u00e7\u00f5es:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Medir o progresso da especifica\u00e7\u00e3o de um novo sistema: Nessa ocasi\u00e3o estava prevista a constru\u00e7\u00e3o de aproximadamente 200 Casos de Uso para um sistema de controle jur\u00eddico para um grande banco. Ah! Mas Caso de Uso n\u00e3o \u00e9 Agile. Fazer essa especifica\u00e7\u00e3o toda \u00e9 cascata. Pois \u00e9, eu sei disso. Pe\u00e7o que ignore essa parte e mantenha o foco no escopo desse projeto: Trabalho do conhecimento, produzir 200 itens de <\/span><b>tamanho variado.<\/b><span style=\"font-weight: 400;\"> Necessidade de acompanhar o progresso do projeto em percentuais para um p\u00fablico que n\u00e3o fazia ideia do que era Agilidade.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Criar uma base de conhecimento de li\u00e7\u00f5es aprendidas e melhores pr\u00e1ticas para gest\u00e3o de incidentes e gest\u00e3o de problemas num grande banco: Esses problemas envolviam toda a \u00e1rea de tecnologia, passando por sistemas, infraestrutura de servidores, telecomunica\u00e7\u00f5es etc. Os itens tamb\u00e9m tinham tamanhos variados.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Um programa de otimiza\u00e7\u00e3o do value stream de desenvolvimento de sistemas, com diversos projetos, sendo que alguns adotavam abordagens \u00e1geis e outros n\u00e3o, mas o report do programa precisava ser feito de maneira unificada.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Constru\u00e7\u00e3o de um novo sistema usando m\u00e9todos \u00e1geis; Construir um sistema novo usando Scrum, mas reportando para alguns stakeholders que s\u00f3 entendiam abordagens preditivas.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">A receita que veremos a seguir \u00e9 bem simples; No final, voc\u00ea sai com um percentual de completude <\/span><b>realista <\/b><span style=\"font-weight: 400;\">e consegue montar reports <\/span><i><span style=\"font-weight: 400;\">lindosos<\/span><\/i><span style=\"font-weight: 400;\"> com ajuda de designers experientes.<\/span><\/p>\n<p><b>Passo 1: Tenha um backlog para a iniciativa.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Essa parte \u00e9 f\u00e1cil, todo mundo que trabalha com Agile tem um backlog. Quem trabalha com o modelo preditivo tamb\u00e9m. Basta fazer uma lista das suas entregas do projeto.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7733\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela1.png\" alt=\"\" width=\"913\" height=\"601\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela1.png 1000w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela1-300x197.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela1-768x505.png 768w\" sizes=\"(max-width: 913px) 100vw, 913px\" \/><\/p>\n<p><b>\u00a0<\/b><\/p>\n<p><b>Passo 2: Escolha uma das regras de completude.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Eu sei que pra Agile \u00e9 0\/100, mas o problema com essa vis\u00e3o \u00e9 que, num projeto de longa dura\u00e7\u00e3o ou num projeto h\u00edbrido, que tamb\u00e9m tenha entreg\u00e1veis preditivos, o progresso pode demorar muito para acontecer. Essa abordagem, apesar de mais realista e conservadora, pode gerar muita<\/span><b> ansiedade<\/b><span style=\"font-weight: 400;\"> nos stakeholders. Por vezes, essa ansiedade pode se transformar em press\u00e3o para voltar \u00e0s abordagens preditivas, o que \u00e9 &#8220;n\u00e3o bom\u02dc.<\/span><b><\/b><\/p>\n<p><span style=\"font-weight: 400;\">No exemplo abaixo, escolhi aplicar a regra de 20\/80; Significa que os itens que ainda n\u00e3o foram iniciados ser\u00e3o reportados com 0% de progresso; Os itens que j\u00e1 foram iniciados ser\u00e3o reportados com 20% de progresso; Os itens conclu\u00eddos ser\u00e3o reportados com 100% de progresso.<\/span><b><\/b><\/p>\n<p><b>Passo 3: Apure o percentual de completude dos itens do seu projeto<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Thchanaaam!!! Note que dos itens iniciados, um deles est\u00e1 no in\u00edcio da esteira (item 4, em constru\u00e7\u00e3o) e outro j\u00e1 est\u00e1 num passo mais avan\u00e7ado (item 2, em QA). Mas usando essa abordagem, ambos s\u00e3o reportados com 20% de completude.<\/span><\/p>\n<p><b>\u00a0<\/b><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7734\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela2-1024x412.png\" alt=\"\" width=\"937\" height=\"377\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela2-1024x412.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela2-300x121.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela2-768x309.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/tabela2.png 1600w\" sizes=\"(max-width: 937px) 100vw, 937px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">O percentual de completude do projeto \u00e9 obtido atrav\u00e9s da m\u00e9dia dos percentuais de cada item. No caso (0% + 20% + 100% +20%) \/ 4 itens = 35%. J\u00e1 imaginou o tipo de coisa bonita que voc\u00ea pode fazer com essa informa\u00e7\u00e3o?<\/span><\/p>\n<p><b>Passo 4: Fa\u00e7a as previs\u00f5es.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Esse \u00e9 o principal valor dos reports: Manter as expectativas alinhadas. Sugest\u00f5es de coisas que voc\u00ea pode fazer:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Se voc\u00ea tem uma data alvo, voc\u00ea pode calcular o percentual de progresso necess\u00e1rio por semana do projeto e estabelecer um baseline de qual o progresso necess\u00e1rio para atingir essa data. A\u00ed voc\u00ea pode fazer um burndown para demonstrar o progresso!<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Voc\u00ea pode pegar o progresso semanal e fazer uma proje\u00e7\u00e3o para calcular quantas semanas ser\u00e3o necess\u00e1rias para chegar no 100%. A\u00ed voc\u00ea pode fazer um burnup para demonstrar seu forecast!<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Voc\u00ea pode construir barrinhas de progresso divididas por semana, para ter uma vis\u00e3o do passado.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Voc\u00ea pode aproveitar o status para reportar poss\u00edveis impedimentos aos itens que j\u00e1 est\u00e3o na esteira produtiva. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Voc\u00ea pode acrescentar outras vari\u00e1veis ao seu backlog e calcular percentuais de progresso independentes, por exemplo: \u00c9picos, frentes de trabalho. Se estiver gerindo um programa, voc\u00ea pode demonstrar equipe respons\u00e1vel ou o projeto.<\/span><\/li>\n<\/ul>\n<p><b>Passo 5: Cuidado!<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Veja, essa \u00e9 uma abordagem h\u00edbrida. Ela est\u00e1 sujeita aos mesmos desvios comportamentais que os relat\u00f3rios de progresso dos kits PMO tinham ao tentar aplicar abordagens preditivas a trabalhos do conhecimento.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Coisas que podem rolar e voc\u00ea tem que ficar esperto:<\/span><\/p>\n<ul>\n<li><b>Alguns stakeholders podem se sentir tentados a iniciar itens e abrir muito WIP<\/b><span style=\"font-weight: 400;\">, s\u00f3 pra ganhar os 20% do progresso inicial e aparecerem bonitos na foto, digo, no report. Nesse caso voc\u00ea tem algumas sa\u00eddas: mude a regra de progresso para 0\/100; mantenha r\u00edgida a regra de limite de WIP; Use outras m\u00e9tricas \u00e1geis para demonstrar o efeito negativo de muito WIP aberto: CFD costuma ser uma boa, mas vale Lead Time e Throughput tamb\u00e9m.<\/span><\/li>\n<li><b>O percentual de completude pode regredir em algumas situa\u00e7\u00f5es;<\/b>\n<p style=\"display: inline !important;\">\n<\/li>\n<li>\n<p style=\"display: inline !important;\"><span style=\"font-weight: 400;\">O aparecimento de defeitos pode fazer com que se gere um certo retrabalho. Para lidar com isso voc\u00ea pode: refor\u00e7ar na sua defini\u00e7\u00e3o de pronto que somente itens com defeitos resolvidos s\u00e3o considerados prontos.<\/span><\/p>\n<\/li>\n<li><span style=\"font-weight: 400;\">O crescimento do backlog por d\u00e9bitos t\u00e9cnicos, descobertas e refinamento vai fazer o percentual de completude total regredir. Se esse for um problema mais constante, voc\u00ea pode calcular a taxa de crescimento do backlog e fazer uma proje\u00e7\u00e3o baseada nessa taxa. Voc\u00ea pode tamb\u00e9m demonstrar o percentual \u00a0de completude apenas dos itens cuja produ\u00e7\u00e3o j\u00e1 est\u00e1 acordada e n\u00e3o do backlog completo. \u00c9 o ponto do replenishment do Kanban ou do planning do Scrum. Voc\u00ea cria uma cerim\u00f4nia para assumir o compromisso e nessa cerim\u00f4nia voc\u00ea j\u00e1 informa que o escopo do projeto aumentou e que portanto o percentual de completude ir\u00e1 regredir.\u00a0<\/span><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>\u00c9 isso minha gente, espero que com essas dicas voc\u00ea tenha ampliado sua &#8220;caixinha de ferramentas&#8221; e possa escolher a abordagem de reports mais adequada! As abordagens h\u00edbridas cabem muito bem em contextos onde est\u00e1 ocorrendo a transi\u00e7\u00e3o para abordagens \u00e1geis, como forma de minimizar a resist\u00eancia \u00e0 essa mudan\u00e7a. Cabem tamb\u00e9m nos contextos de escala de programas, para ter um report padronizado quando onde a melhor abordagem para parte das entregas \u00e9 preditiva e outra parte \u00e9 adaptativa. Deixe seus coment\u00e1rios, feedbacks e conte pra gente sua hist\u00f3ria com reports de projetos sedutores.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pol\u00eamica! Ainda esses dias, conversava com um respons\u00e1vel pelo cap\u00edtulo de agilidade de uma startup sobre reports de projeto sedutores e o mal que eles podem fazer. A situa\u00e7\u00e3o \u00e9 a seguinte: n\u00e3o habituados com a forma como as m\u00e9tricas de projetos \u00e1geis s\u00e3o apresentadas &#8211; CFDs, histogramas de Throughput, Lead Time etc. &#8211; e &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/08\/ta-quantos-por-cento-pronto-agile-para-pmps-e-pmbok-para-agilistas\/\">\u00bb<\/a><\/p>\n","protected":false},"author":66,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7715"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/66"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7715"}],"version-history":[{"count":14,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7715\/revisions"}],"predecessor-version":[{"id":7740,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7715\/revisions\/7740"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7715"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7715"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7715"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}