{"id":593,"date":"2010-01-17T21:00:37","date_gmt":"2010-01-18T00:00:37","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=593"},"modified":"2010-04-22T14:56:31","modified_gmt":"2010-04-22T17:56:31","slug":"o-que-aprendemos-em-2009-the-plataforma-way","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2010\/01\/o-que-aprendemos-em-2009-the-plataforma-way\/","title":{"rendered":"O que aprendemos em 2009 &#8211; The Plataforma Way"},"content":{"rendered":"<p>2009 se foi. Foram 10 meses muito agitados para n\u00f3s. Aprendizado intenso, momentos de cansa\u00e7o f\u00edsico, desafios constantes e d\u00favidas sobre o futuro s\u00e3o fatores que est\u00e3o presentes no nosso dia-a-dia.<\/p>\n<p>Antes de iniciar as opera\u00e7\u00f5es da Plataforma Tecnologia (fev\/09), nos question\u00e1vamos duas perguntas que davam frio na barriga:<\/p>\n<p><em>Como fazer uma empresa de servi\u00e7os dar certo?!<br \/>\nComo sair da in\u00e9rcia e conquistar os primeiros clientes?!<\/em><\/p>\n<p>N\u00e3o sab\u00edamos as respostas. Mas est\u00e1vamos l\u00e1.<br \/>\nCada um com suas habilidades e todos com um sentimento que se equilibrava entre arrog\u00e2ncia e inoc\u00eancia. Sem motivos muito claros, n\u00f3s simplesmente acredit\u00e1vamos que poderia dar certo.\u00a0 Ent\u00e3o, por que n\u00e3o tentar?<\/p>\n<p>Aqui estamos: tentando.<\/p>\n<p>\u00c9 dif\u00edcil dizer se a Plataforma Tecnologia ser\u00e1 bem sucedida ou n\u00e3o. S\u00f3 o futuro dir\u00e1.<\/p>\n<p>O que podemos dizer \u00e9 que avan\u00e7amos muito mais do que imagin\u00e1vamos e acreditamos estar na dire\u00e7\u00e3o certa. \u00a0Sabemos onde queremos chegar, mas h\u00e1 in\u00fameros caminhos para escolher. Uns melhores, outros piores.<\/p>\n<p>Fato \u00e9 que durante 2009 descobrimos algumas coisas que consideramos valiosas e queremos compartilhar nossa opini\u00e3o. \u00a0Seguem abaixo.<\/p>\n<ul>\n<li><strong>Contrate pessoas cujo trabalho voc\u00ea confia (e vice-versa):<\/strong> se voc\u00ea precisa micro-gerenciar sua equipe, ent\u00e3o algo est\u00e1 errado. Micro-gerenciar times de desenvolvimento de software \u00e9 uma tentativa (ruim) de assegurar a qualidade durante o processo produtivo. \u00c9 preciso entender que o processo em si n\u00e3o \u00e9 t\u00e3o importante. O importante \u00e9 o resultado final. D\u00ea autonomia a sua equipe. Parta do pressuposto que sua equipe \u00e9 capaz de atingir os objetivos at\u00e9 que seja provado o contr\u00e1rio (e se o &#8220;contr\u00e1rio&#8221; ocorrer, h\u00e1 diversas a\u00e7\u00f5es que podem ser tomadas, mas isso rende assunto para um outro post inteiro).<\/li>\n<li><strong>A maioria dos clientes descrevem solu\u00e7\u00f5es ao inv\u00e9s de descrever as reais necessidades:<\/strong> \u00e9 natural que isso ocorra. E ao inv\u00e9s de culp\u00e1-los por n\u00e3o saberem descrever corretamente as necessidades, ajude-os a esclarecer qual o problema a ser resolvido. Em seguida, construa com ele uma solu\u00e7\u00e3o (software).<br \/>\nN\u00e3o se esque\u00e7a que \u00e9 o seu cliente que tem o conhecimento sobre o segmento\/neg\u00f3cio e uma boa solu\u00e7\u00e3o ser\u00e1 resultado de um trabalho conjunto. Se um cliente n\u00e3o se dispuser a trabalhar em conjunto para desenhar uma solu\u00e7\u00e3o, ent\u00e3o caia fora. Este projeto ter\u00e1 grandes chances de ter problemas.<\/li>\n<li><strong>6 meses \u00e9 muito tempo para empresas rec\u00e9m-nascidas e pequenas:<\/strong> \u00c9 importante saber onde se quer chegar, mas nesta fase da empresa, n\u00e3o faz muito sentido realizar planejamentos com horizontes longos. Muita coisa muda e muito r\u00e1pido.<br \/>\nDescobrimos que vale a pena fazer planejamentos com maior freq\u00fc\u00eancia e com horizontes mais curtos. \u00c9 como se a cada 6 meses a empresa estivesse realizando um \u201crelease\u201d. Fa\u00e7a \u201cretrospectivas\u201d, \u201crelease plannings\u201d, \u201csprint plannings\u201d relativos \u00e0 empresa e priorize a execu\u00e7\u00e3o do que trar\u00e1 mais valor durante os pr\u00f3ximos 6 meses. A grande vantagem de uma empresa de pequeno porte \u00e9 sua capacidade de responder \u00e0 mudan\u00e7as (agilidade). Aproveite-a!<\/li>\n<li><strong>Nunca haver\u00e1 momento ideal para implementar algo:<\/strong> j\u00e1 nos pegamos dizendo \u201cassim que der uma sossegada, a gente come\u00e7a a re-estruturar <em>bla-bla-bla<\/em>\u201d. A verdade \u00e9 que este momento de sossego dificilmente chegar\u00e1, ainda mais se a empresa estiver em crescimento. Se h\u00e1 necessidade em implementar ou mudar algo na empresa, fa\u00e7a-o o quanto antes (ou de acordo com a prioridade). Esperar s\u00f3 vai piorar os sintomas que este problema estiver causando. Quanto mais voc\u00ea esperar, pior ser\u00e1.<\/li>\n<li><strong>Saiba claramente qual o seu DNA:<\/strong> isso pode soar um pouco filos\u00f3fico, e de fato \u00e9. Mas \u00e9 algo que se mostrou muito importante para n\u00f3s. Todo o time deve saber e compartilhar dos valores que moldam as decis\u00f5es de neg\u00f3cio e refletem na maneira de operar o dia-a-dia da empresa. Pode ocorrer momentos em que fechar um novo contrato significar\u00e1 deixar o DNA de lado e isso ser\u00e1 um pouco doloroso.<br \/>\nMas da nossa experi\u00eancia, posso afirmar que valeu a pena n\u00e3o se desviar do DNA. Quando olhamos para tr\u00e1s, fica muito claro que tomamos boas decis\u00f5es. Warren Buffet j\u00e1 dizia&#8230; &#8220;<em>In the business world, the rear view mirror is always clearer than the windshield<\/em>&#8220;.<br \/>\n\u00c9 a mais pura verdade!<\/li>\n<\/ul>\n<p>Espero que estes t\u00f3picos possam ajudar startups e outras empresas iniciantes.<\/p>\n<p>Gostaria de pedir que ajudem a enriquecer o post e comentem. Compartilhem suas experi\u00eancias!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>2009 se foi. Foram 10 meses muito agitados para n\u00f3s. Aprendizado intenso, momentos de cansa\u00e7o f\u00edsico, desafios constantes e d\u00favidas sobre o futuro s\u00e3o fatores que est\u00e3o presentes no nosso dia-a-dia. Antes de iniciar as opera\u00e7\u00f5es da Plataforma Tecnologia (fev\/09), nos question\u00e1vamos duas perguntas que davam frio na barriga: Como fazer uma empresa de servi\u00e7os &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2010\/01\/o-que-aprendemos-em-2009-the-plataforma-way\/\">\u00bb<\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[52],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/593"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=593"}],"version-history":[{"count":65,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/593\/revisions"}],"predecessor-version":[{"id":909,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/593\/revisions\/909"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=593"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=593"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=593"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}