{"id":9487,"date":"2019-10-30T15:50:30","date_gmt":"2019-10-30T18:50:30","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9487"},"modified":"2019-12-19T17:25:54","modified_gmt":"2019-12-19T19:25:54","slug":"o-papel-do-lider-de-produto","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/10\/o-papel-do-lider-de-produto\/","title":{"rendered":"O Papel do L\u00edder de Produto"},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p>Qual a sua teoria favorita sobre o papel de um l\u00edder? Para mim um resumo perfeito \u00e9 esta fala do Jack Welch em&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=ojkOs8Gatsg\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">What is the role of a leader<\/a>. Em resumo, sem a pretens\u00e3o de captar a emo\u00e7\u00e3o de ouvi-lo:<\/p>\n\n\n\n<ol><li>Ser o \u201cChief Meaning Officer\u201d! Deixar claro para todas as pessoas \u00e0 sua volta: para onde voc\u00ea est\u00e1 indo, por que voc\u00ea est\u00e1 indo e, mais importante, o que haver\u00e1 para elas quando elas chegarem l\u00e1 com voc\u00ea.<\/li><li>Remover os impedimentos do caminho para que as pessoas possam agir e fazer as coisas acontecerem. Quebre os silos, se livre das burocracias.<\/li><li>Ser generoso. Vibrar com o sucesso das pessoas.<\/li><li>Ser o \u201cChief Fun Officer\u201d. D\u00ea seus pulos para tornar o trabalho divertido!<\/li><\/ol>\n\n\n\n<p>E qual o papel de um l\u00edder em uma empresa de produtos digitais? N\u00e3o deve ser nada diferente disso, certo? Mas afinal, como traduzir estes conceitos para a realidade de uma empresa de produtos?<\/p>\n\n\n\n<p>Trazendo para este contexto, quem melhor traduz o papel de um l\u00edder \u00e9 o Marty Cagan em&nbsp;<a href=\"https:\/\/svpg.com\/empowered-product-teams\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Empowered Product Teams<\/a>. Na minha opini\u00e3o, este conte\u00fado \u00e9 o mais relevante que ele publicou direcionado para l\u00edderes que est\u00e3o \u00e0 frente de empresas de produtos digitais. E por que \u00e9 t\u00e3o relevante? Porque coloca de uma forma mais tang\u00edvel estrat\u00e9gia e cultura, temas muito falados mas pouco colocados em pr\u00e1tica.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Motivos de resist\u00eancia da lideran\u00e7a<\/h3>\n\n\n\n<p>Um t\u00f3pico bem interessante deste artigo \u00e9 a explica\u00e7\u00e3o do por que l\u00edderes resistem tanto para empoderar seus times e continuam mantendo o estilo comando-controle.<\/p>\n\n\n\n<p>Segundo ele, existem duas formas de gerenciar uma empresa de produto:<\/p>\n\n\n\n<ul><li>O jeito errado: \u201cNa maioria das empresas, os times de tecnologia existem para atender o neg\u00f3cio\u201d. De alguma forma, l\u00edderes de outras \u00e1reas de neg\u00f3cios (vendas, marketing, CEO) acabam direcionando o produto, que \u00e9 apenas constru\u00eddo pelo time de tecnologia.<\/li><li>O jeito certo: \u201cEm empresa com forte cultura de produto, times de produto existem para um prop\u00f3sito muito diferente. Eles existem para atender os clientes, de formas que tamb\u00e9m atendam \u00e0s necessidades do neg\u00f3cio\u201d. Ou seja, o foco \u00e9 o cliente e n\u00e3o <em>stakeholders<\/em> internos. Mas obviamente o produto tamb\u00e9m tem que ser sustent\u00e1vel para o neg\u00f3cio.&nbsp;<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/medium.com\/@gibsonbiddle\/intro-to-product-strategy-60bdf72b17e3\" target=\"_blank\">Gibson Biddle<\/a>&nbsp;diz algo semelhante de uma forma mais po\u00e9tica \u201cencantar clientes, de maneiras que sejam lucrativas e dif\u00edceis de copiar\u201d.<\/li><\/ul>\n\n\n\n<p>Marty Cagan conta que conversou com CEOs de v\u00e1rias empresas para entender porque eles continuam trabalhando do jeito errado com desenvolvimento de produtos, mesmo conhecendo o jeito certo. A resposta foi \u201cfalta de confian\u00e7a\u201d no time. A cren\u00e7a \u00e9 que este modelo de trabalho (o jeito certo) s\u00f3 funciona em empresas que podem contratar profissionais extraordin\u00e1rios, como os do Google, Netflix, etc.<\/p>\n\n\n\n<p>O curioso \u00e9 que j\u00e1 existem muitos estudos que comprovam que times de alto desempenho n\u00e3o s\u00e3o formados por estrelas, mas sim por pessoas comuns. Ali\u00e1s, estrelas muitas vezes atrapalham!<\/p>\n\n\n\n<p>\u201cThey would be surprised at how ordinary the vast majority of the members of these company\u2019s product teams actually are, and that maybe the important difference lies elsewhere.\u201d<\/p>\n\n\n\n<p>Outra justificativa comum para n\u00e3o empoderar os times \u00e9 \u201cpessoas de tecnologia n\u00e3o entendem de neg\u00f3cios\u201d! Quem de tecnologia j\u00e1 n\u00e3o precisou respirar bem fundo quando ouviu esta frase? Times de produto precisam do contexto de neg\u00f3cio, para que possam descobrir a melhor forma de resolver problemas dos clientes.<\/p>\n\n\n\n<p>A falta de confian\u00e7a certamente n\u00e3o \u00e9 um problema f\u00e1cil de resolver, j\u00e1 que em muitas situa\u00e7\u00f5es os times s\u00e3o de fato muito inexperientes. Mas \u00e9 importante caminhar nesta dire\u00e7\u00e3o, desenvolvendo as pessoas para que elas possam atuar do jeito certo. Definitivamente, entrar em um ciclo vicioso de falta de estrat\u00e9gia, time inexperiente e comando-controle, n\u00e3o \u00e9 um bom caminho!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Papel do l\u00edder no \u201cjeito certo\u201d de trabalhar<\/h3>\n\n\n\n<p>Trazendo para o contexto de empresas de produto, como ser o \u201cChief Meaning Officer\u201d? Ou seja, como deixar claro para as pessoas para onde voc\u00ea est\u00e1 indo e por que. A Vis\u00e3o e Estrat\u00e9gia de produto s\u00e3o essenciais para trazer este significado e dar um direcionamento ao time, para ele possa trabalhar de forma aut\u00f4noma.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Vis\u00e3o de Produto<\/h4>\n\n\n\n<p>A vis\u00e3o de produto descreve o futuro que queremos criar, em 2 a 5 anos. A import\u00e2ncia desta vis\u00e3o \u00e9 setar um norte inspirador e delimitar um contexto de atua\u00e7\u00e3o. Em <em>startups<\/em>, \u00e9 muito comum o foco do produto principal ir se perdendo ou o escopo de atua\u00e7\u00e3o ficar muito amplo. Isto acontece principalmente quando empresas recebem investimentos e come\u00e7am a diversificar o portf\u00f3lio. Sem uma vis\u00e3o para guiar e delimitar as fronteiras, os times de produto podem ficar sem foco, n\u00e3o atingirem resultados e a lideran\u00e7a voltar a assumir o estilo comando-controle.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Estrat\u00e9gia de Produto<\/h4>\n\n\n\n<p>A estrat\u00e9gia define qual caminho precisa ser seguido para se alcan\u00e7ar a vis\u00e3o. Um erro comum na defini\u00e7\u00e3o da estrat\u00e9gia \u00e9 n\u00e3o fazer uma reflex\u00e3o do momento atual e tra\u00e7ar uma estrat\u00e9gia pouco realista. Em&nbsp;<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.youtube.com\/watch?v=DmJXpI7OJuY\" target=\"_blank\">Escaping the Building Trap<\/a>, Melissa Peri apresenta um <em>framework<\/em> bem interessante para defini\u00e7\u00e3o de estrat\u00e9gia.<\/p>\n\n\n\n<p>Outro artefato, o&nbsp;<a href=\"https:\/\/svpg.com\/the-product-manifesto\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Product Principles<\/a>, tamb\u00e9m ajuda a delimitar o contexto e facilita decis\u00f5es em prioriza\u00e7\u00e3o. Os princ\u00edpios descrevem a natureza dos produtos que pretendemos desenvolver e reflex\u00f5es sobre nossas cren\u00e7as sobre o que \u00e9 importante.<\/p>\n\n\n\n<p>Exemplo de coisas que podem ser interessantes explicitar no <em>Product Principles<\/em>:<\/p>\n\n\n\n<ul><li>Vamos aceitar desenvolver customiza\u00e7\u00f5es (features espec\u00edficas para alguns clientes)?<\/li><li>Se o produto tem mais de um cliente (vendedores e compradores, por ex), quem vamos priorizar?<\/li><li>O que \u00e9 mais importante, velocidade ou qualidade?<\/li><li>Queremos desenvolver tudo sozinhos ou vamos fazer parcerias?<\/li><\/ul>\n\n\n\n<p>Uma vez que a Vis\u00e3o e Estrat\u00e9gia estejam definidas, como garantir que elas sejam seguidas? Em empresas com muitos times, como desdobrar a estrat\u00e9gia para os diversos times e manter o alinhamento? No artigo&nbsp;<a href=\"https:\/\/medium.com\/@gibsonbiddle\/how-to-run-a-quarterly-product-strategy-meeting-a-board-meeting-for-product-3a14c4d53d1b\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">How to Run a Quarterly Product Strategy Meeting<\/a>, Gibson Biddle, apresenta um processo bem interessante para defini\u00e7\u00e3o de estrat\u00e9gia de times e tamb\u00e9m um passo a passo de como estruturar uma reuni\u00e3o de \u201creview\u201d de produto.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Mais sobre o jeito certo de trabalhar<\/h3>\n\n\n\n<p>Outras fontes interessantes para entender este jeito certo de trabalhar:<\/p>\n\n\n\n<ul><li><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.youtube.com\/watch?v=DmJXpI7OJuY\" target=\"_blank\">Escaping the Building Trap<\/a>, Melissa Perri. Apresenta uma boa explica\u00e7\u00e3o da rela\u00e7\u00e3o entre Customer, Business e o papel do Product Manager em Product-led e Sales-led organizations. As dicas para desenhar estrat\u00e9gia tamb\u00e9m s\u00e3o valiosas.<\/li><li><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/svpg.com\/product-vs-feature-teams\/\" target=\"_blank\">Product team vs Feature Team<\/a>, Marty Cagan. Refor\u00e7a de forma bem did\u00e1tica e enf\u00e1tica os conceitos j\u00e1 apresentados em&nbsp;<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/svpg.com\/empowered-product-teams\/\" target=\"_blank\">Empowered Product Teams<\/a>. Feature team \u00e9 o jeito errado de se trabalhar, no qual os times de produto existem somente para entregar features j\u00e1 priorizadas em um roadmap.<\/li><li><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/svpg.com\/coaching-customer-centricity\/\" target=\"_blank\">Coach &#8211; Customer Centricity<\/a>, Marty Cagan. Explica quem s\u00e3o os verdadeiros clientes de um Product Manager: as pessoas que usam o produto! Stakeholders internos (vendas, CEO, etc) n\u00e3o podem ser considerados clientes. Afinal, o time de produto n\u00e3o existe para servir ao neg\u00f3cio!<\/li><li><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.linkedin.com\/pulse\/digital-traditional-joaquim-torres-joca-\/\" target=\"_blank\">Digital or Traditional<\/a>, Joca Torres. Reflete sobre a diferen\u00e7a do escopo de atua\u00e7\u00e3o do Product Manager em empresas Digitais (que tem como core do neg\u00f3cio um software), empresas Tradicionais (que tem como core outros tipos de produto) e empresas que n\u00e3o vendem software, mas tem o software como parte vital do neg\u00f3cio, denominadas <em>born-digital traditional company<\/em>.<\/li><\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Resumindo<\/h3>\n\n\n\n<p>Uma das responsabilidade principais de um l\u00edder de produto \u00e9 definir um norte para o produto e garantir que toda empresa esteja alinhada \u00e0 ele. Para isso:<\/p>\n\n\n\n<ul><li>Defina a vis\u00e3o e estrat\u00e9gia de produtos.<\/li><li>Divulgue para toda a empresa, n\u00e3o apenas para os times de Produto e Engenharia.<\/li><li>Desdobre a estrat\u00e9gia para todos times.<\/li><li>Crie cerim\u00f4nias para garantir o alinhamento entre todos os times.<\/li><\/ul>\n\n\n\n<p>Caso isso j\u00e1 esteja sendo feito, mas mesmo assim os times n\u00e3o estejam trabalhando com autonomia e alcan\u00e7ando resultados, vale refletir:<\/p>\n\n\n\n<ul><li>Existe resist\u00eancia da lideran\u00e7a para empoderar os times?<\/li><li>Existe um entendimento sobre o papel de um time de produto?<\/li><li>Se n\u00e3o existe confian\u00e7a no time, qual \u00e9 o plano para desenvolver e empoderar este time?<\/li><\/ul>\n\n\n\n<p>Como tem sido a lideran\u00e7a de produto na sua empresa? Deixe sua impress\u00e3o nos coment\u00e1rios abaixo.<\/p>\n\n\n\n<!-- default-view.php -->\n<div\n\tclass=\"ngg-galleryoverview default-view \n\t\t\"\n\tid=\"ngg-gallery-3126ff5683b3e52e95b9a3a470e41365-1\">\n\n\t\t<!-- Thumbnails -->\n\t\t\t\t<div id=\"ngg-image-0\" class=\"ngg-gallery-thumbnail-box \n\t\t\t\t\t\t\t\t\t\t\t\" \n\t\t\t>\n\t\t\t\t\t\t<div class=\"ngg-gallery-thumbnail\">\n\t\t\t<a href=\"http:\/\/blog.plataformatec.com.br\/wp-content\/gallery\/o-papel-do-lider-de-produto\/Agile-Banner-Template-1.png\"\n\t\t\t\ttitle=\"\"\n\t\t\t\tdata-src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/gallery\/o-papel-do-lider-de-produto\/Agile-Banner-Template-1.png\"\n\t\t\t\tdata-thumbnail=\"http:\/\/blog.plataformatec.com.br\/wp-content\/gallery\/o-papel-do-lider-de-produto\/thumbs\/thumbs_Agile-Banner-Template-1.png\"\n\t\t\t\tdata-image-id=\"2\"\n\t\t\t\tdata-title=\"Agile-Banner-Template-1\"\n\t\t\t\tdata-description=\"\"\n\t\t\t\tdata-image-slug=\"agile-banner-template-1-1\"\n\t\t\t\tclass=\"ngg-simplelightbox\" rel=\"3126ff5683b3e52e95b9a3a470e41365\">\n\t\t\t\t<img\n\t\t\t\t\ttitle=\"Agile-Banner-Template-1\"\n\t\t\t\t\talt=\"Agile-Banner-Template-1\"\n\t\t\t\t\tsrc=\"http:\/\/blog.plataformatec.com.br\/wp-content\/gallery\/o-papel-do-lider-de-produto\/thumbs\/thumbs_Agile-Banner-Template-1.png\"\n\t\t\t\t\twidth=\"240\"\n\t\t\t\t\theight=\"160\"\n\t\t\t\t\tstyle=\"max-width:100%;\"\n\t\t\t\t\/>\n\t\t\t<\/a>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div> \n\t\t\t\n\t\n\t<br style=\"clear: both\" \/>\n\n\t\n\t\t<!-- Pagination -->\n\t\t<div class='ngg-clear'><\/div>\t<\/div>\n\n","protected":false},"excerpt":{"rendered":"<p>Qual a sua teoria favorita sobre o papel de um l\u00edder? Para mim um resumo perfeito \u00e9 esta fala do Jack Welch em&nbsp;What is the role of a leader. Em resumo, sem a pretens\u00e3o de captar a emo\u00e7\u00e3o de ouvi-lo: Ser o \u201cChief Meaning Officer\u201d! Deixar claro para todas as pessoas \u00e0 sua volta: para &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/10\/o-papel-do-lider-de-produto\/\">\u00bb<\/a><\/p>\n","protected":false},"author":84,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,267],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9487"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/84"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9487"}],"version-history":[{"count":18,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9487\/revisions"}],"predecessor-version":[{"id":9526,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9487\/revisions\/9526"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9487"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9487"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9487"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}