{"id":6257,"date":"2017-04-14T11:34:45","date_gmt":"2017-04-14T14:34:45","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6257"},"modified":"2017-04-14T11:34:45","modified_gmt":"2017-04-14T14:34:45","slug":"plataformatec-organiza-evento-para-ctos-cios-e-diretores-de-produto","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/04\/plataformatec-organiza-evento-para-ctos-cios-e-diretores-de-produto\/","title":{"rendered":"Plataformatec organiza evento para CTOs, CIOs e Diretores de Produto"},"content":{"rendered":"<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-6264\" style=\"border: none;\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/Marcas-exportar-01.png\" alt=\"Talking Digital Conf logo\" width=\"466\" height=\"106\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/Marcas-exportar-01.png 466w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/Marcas-exportar-01-300x68.png 300w\" sizes=\"(max-width: 466px) 100vw, 466px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Estamos organizando a segunda<\/span><span style=\"font-weight: 400;\">\u00a0edi\u00e7\u00e3o do <a href=\"http:\/\/talkingdigitalconf.com\/\">Talking Digital Conf<\/a>, um evento de networking e conte\u00fado para CTOs, CIOs, diretores de produto e outros l\u00edderes de equipes de desenvolvimento de produtos digitais e plataformas digitais.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Esta segunda edi\u00e7\u00e3o acontecer\u00e1 no pr\u00f3ximo dia 17 de maio, em S\u00e3o Paulo. <strong>Se voc\u00ea quer aprender como outros C-levels e gestores de produto e tecnologia est\u00e3o resolvendo seus desafios, este evento \u00e9 para voc\u00ea.<\/strong><\/span><\/p>\n<p><strong>Se voc\u00ea trabalha em uma equipe de produto e tecnologia, indique o evento para o seu gestor, enviando este blog post para ele.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Esta segunda edi\u00e7\u00e3o acontece pouco mais de 3 anos depois da <a href=\"http:\/\/talkingdigitalconf.com\/2014\/\">primeira edi\u00e7\u00e3o<\/a>, que reuniu <a href=\"http:\/\/talkingdigitalconf.com\/2014\/index.html#participants\">50 gestores de empresas<\/a>\u00a0de\u00a0<\/span><span style=\"font-weight: 400;\">produtos e plataformas digitais. Participaram desde startups em crescimento acelerado at\u00e9 empresas tradicionais buscando inova\u00e7\u00e3o e cria\u00e7\u00e3o de ofertas digitais.<\/span><\/p>\n<p style=\"text-align: center;\">Abaixo voc\u00ea pode assistir o\u00a0v\u00eddeo do evento de 2014:<\/p>\n<p style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/2Di9_VhENWU\" width=\"800\" height=\"450\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p><span style=\"font-weight: 400;\">No per\u00edodo entre a \u00faltima edi\u00e7\u00e3o e hoje, empresas que estavam come\u00e7ando, e algumas que ainda nem existiam, se transformaram em neg\u00f3cios consolidados. Algumas delas totalmente baseadas em plataformas digitais, como a <a href=\"https:\/\/www.youse.com.br\/\">Youse<\/a> e a <a href=\"https:\/\/www.nubank.com.br\/\">Nubank<\/a>, est\u00e3o transformando os neg\u00f3cios no Brasil. Devido a esse cen\u00e1rio, a inova\u00e7\u00e3o digital \u00e9 hoje uma preocupa\u00e7\u00e3o em empresas de todos os portes e segmentos.\u00a0A ideia do Talking Digital Conf \u00e9 ajudar os gestores de tecnologia e produto a resolver esses desafios.<\/span><\/p>\n<p>O evento ir\u00e1 manter o prop\u00f3sito de aproximar executivos e empresas com desafios semelhantes para trocarem ideias e experi\u00eancias em um modelo extremamente colaborativo, onde cada um dos temas \u00e9 discutido de maneira aprofundada, com um mix de palestra, mesa redonda e networking.<\/p>\n<p>No evento deste ano, ser\u00e3o discutidos v\u00e1rios desafios dos gestores de tecnologia e produto, tais como:<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Desafios de crescimento devido a estrat\u00e9gias de diversifica\u00e7\u00e3o e aquisi\u00e7\u00e3o<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Avalia\u00e7\u00e3o de desempenho de equipes de produto e desenvolvimento<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Crescimento acelerado<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ado\u00e7\u00e3o de novas tecnologias e migra\u00e7\u00e3o de plataformas<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Digitaliza\u00e7\u00e3o de neg\u00f3cios tradicionais<\/span><\/li>\n<\/ul>\n<p>A partir deste ano, a Plataformatec tem o objetivo de transformar o Talking Digital Conf em um evento anual e estabelecer um canal frequente de di\u00e1logo entre os participantes, desenvolvendo uma s\u00e9rie de atividades que ir\u00e3o contar com meetups e webinars, fomentando a intera\u00e7\u00e3o e um fluxo cont\u00ednuo de comunica\u00e7\u00e3o.<\/p>\n<p><strong>Visite o site do evento para saber mais detalhes e solicitar sua inscri\u00e7\u00e3o:<\/strong><\/p>\n<p style=\"text-align: center;\"><a href=\"http:\/\/talkingdigitalconf.com\/\">http:\/\/talkingdigitalconf.com\/<\/a><\/p>\n<p style=\"text-align: center;\">17 de Maio \/ 9:00am &#8211; 8:00pm &#8211; Hotel Pulmman, S\u00e3o Paulo, Vila Ol\u00edmpia<\/p>\n<p style=\"text-align: center;\">Rua das Olimp\u00edadas, 205<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Confira abaixo o que alguns dos participantes falaram sobre o Talking Digital Conf 2014:<\/strong><\/p>\n<blockquote><p><em><span style=\"font-weight: 400;\">&#8220;Falamos desde gest\u00e3o de pessoas e tecnologia. At\u00e9 os papos de corredor: &#8220;como \u00e9 que voc\u00eas fazem contrata\u00e7\u00e3o?&#8221;, ent\u00e3o acho que no final das contas \u00e9 muito produtivo, \u00e9 muito gostoso estar aqui.&#8221;<\/span><\/em><\/p>\n<p><strong>Renato Freitas &#8211; CTO &#8211; 99Taxis<\/strong><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><em><span style=\"font-weight: 400;\">&#8220;Trouxe um pouco da experi\u00eancia que a gente tem l\u00e1 na Locaweb. A gente tem um portfolio bem diversificado de produtos: como \u00e9 que a gente faz? por que n\u00f3s temos esse portfolio? O tema do evento \u00e9 muito importante, tem muita gente falando sobre startups, que \u00e9 s\u00f3 o come\u00e7o da hist\u00f3ria, mas a hist\u00f3ria \u00e9 sempre maior do que essa. Quando o produto d\u00e1 certo, o que voc\u00ea faz?&#8221;<\/span><\/em><\/p>\n<p><b>Joaquim Torres &#8211; Ex Diretor de Produtos &#8211; Locaweb<\/b><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><i>&#8220;Um grupo de participantes super bem escolhido. Um modelo mais colaborativo, as pessoas falando mais e a gente escutando mais experi\u00eancia de outras pessoas. \u00c9 um honra estar aqui!&#8221;<\/i><\/p>\n<p><b>Manoel Lemos &#8211; Ex CDO &#8211; Abril M\u00eddia<\/b><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><em>&#8220;Essa confer\u00eancia re\u00fane tecnologia, produtos e neg\u00f3cios, que \u00e9 um espa\u00e7o a ser preenchido. Estou bastante satisfeito.&#8221;<\/em><\/p>\n<p><b>Ot\u00e1vio Ferreira &#8211; Ex CTO &#8211; Emprego Ligado<\/b><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><em><span style=\"font-weight: 400;\">&#8220;\u00c9 uma oportunidade de conhecermos muita gente com desafios parecidos e trocar experi\u00eancias.&#8221;<\/span><\/em><\/p>\n<p><b>Guilherme Rolim &#8211; Gerente de Desenvolvimento de Software da ClearSale<\/b><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><em><span style=\"font-weight: 400;\">&#8220;A quantidade de profissionais excelentes que est\u00e3o aqui, eu conhe\u00e7o alguns e outros que eu sempre quis conhecer. N\u00e3o pode perder!&#8221;<\/span><\/em><\/p>\n<p><b>Gustavo Pioto &#8211; Ex Diretor de Produtos &#8211; Bidu<\/b><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><em><span style=\"font-weight: 400;\">&#8220;\u00c9 fant\u00e1stico poder participar de um evento assim! Primeiro pelo conte\u00fado e pelas pessoas que v\u00e3o compartilhar o conhecimento, mas tamb\u00e9m pelo networking.&#8221;<\/span><\/em><\/p>\n<p><b>Fernanda Novak &#8211; Gerente de Produtos &#8211; VAGAS<\/b><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><em><span style=\"font-weight: 400;\">&#8220;Hoje em dia, voc\u00ea quase n\u00e3o consegue abrir uma empresa sem ter uma equipe de tecnologia. E n\u00e3o era assim alguns anos atr\u00e1s.&#8221;<\/span><\/em><\/p>\n<p><b>Joshua Kempf &#8211; CEO &#8211; Gaveteiro<\/b><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<blockquote><p><em><span style=\"font-weight: 400;\">&#8220;Vejo muito valor na discuss\u00e3o, em conhecer as dificuldades que todas as empresas t\u00eam em comum e que vem \u00e0 tona nas discuss\u00f5es. A Plataformatec est\u00e1 de parab\u00e9ns!&#8221;<\/span><\/em><\/p>\n<p><b>Anamaria Martins &#8211; Diretora de Produtos &#8211; Bionexo<\/b><\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Estamos organizando a segunda\u00a0edi\u00e7\u00e3o do Talking Digital Conf, um evento de networking e conte\u00fado para CTOs, CIOs, diretores de produto e outros l\u00edderes de equipes de desenvolvimento de produtos digitais e plataformas digitais. Esta segunda edi\u00e7\u00e3o acontecer\u00e1 no pr\u00f3ximo dia 17 de maio, em S\u00e3o Paulo. Se voc\u00ea quer aprender como outros C-levels e &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/04\/plataformatec-organiza-evento-para-ctos-cios-e-diretores-de-produto\/\">\u00bb<\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[159,259],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6257"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6257"}],"version-history":[{"count":9,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6257\/revisions"}],"predecessor-version":[{"id":6460,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6257\/revisions\/6460"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6257"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6257"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6257"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}