{"id":9044,"date":"2019-05-29T15:30:14","date_gmt":"2019-05-29T18:30:14","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9044"},"modified":"2019-09-24T15:49:16","modified_gmt":"2019-09-24T18:49:16","slug":"precisamos-dar-um-peso-maior-para-o-v-do-mvp","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/05\/precisamos-dar-um-peso-maior-para-o-v-do-mvp\/","title":{"rendered":"Precisamos dar um peso maior para o &#8220;V&#8221; do MVP"},"content":{"rendered":"<p><strong>O que \u00e9 MVP?<\/strong><\/p>\n<p>O <strong>MVP<\/strong>\u00a0(<em>Minimum Viable Product<\/em>) \u00e9 um acr\u00f4nimo comumente utilizado nos ambientes de desenvolvimento de produtos digitais, significando <strong>produto m\u00ednimo vi\u00e1vel<\/strong>. Foi criado por Frank Robinson em 2001 e mundialmente popularizada por Eric Ries dentro da metodologia da Lean Startup.<\/p>\n<p>Eric Ries define <strong><em>MVP<\/em><\/strong> como &#8220;uma vers\u00e3o de um novo produto que permita que a equipe colete o m\u00e1ximo de aprendizado sobre seus clientes, com o menor esfor\u00e7o poss\u00edvel&#8221;, conforme escrito em seu <em><a href=\"http:\/\/www.startuplessonslearned.com\/2009\/08\/minimum-viable-product-guide.html\" target=\"_blank\" rel=\"noopener noreferrer\">blog<\/a><\/em>.<\/p>\n<p>Essa ideia vem do ponto de vista de que vale mais a pena lan\u00e7ar um <strong>produto simplificado<\/strong>, mas que <strong>satisfa\u00e7a a necessidade do cliente<\/strong>, que um <strong>produto completo<\/strong>. O motivo disso se d\u00e1 pelo fato de poder <strong>testar<\/strong>\u00a0se aquela hip\u00f3tese tem o valor esperado para os clientes e caso n\u00e3o o tenha, \u00e9 poss\u00edvel alterar a proposta de valor do produto ou na pior das hip\u00f3teses, jogar tudo fora. No caso de jogar tudo fora, a perda sobre o investimento realizado (principalmente tempo e dinheiro) acaba sendo em uma escala menor.<\/p>\n<p>Por\u00e9m nos \u00faltimos anos, o conceito de <strong><em>MVP<\/em><\/strong> vem sendo alterado ao absorver muitos conceitos do <strong><em>MMP<\/em><\/strong> (<a href=\"http:\/\/www.romanpichler.com\/blog\/the-minimal-marketable-product\/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Minimal Marketable Product<\/em><\/a>). O <strong><em>MMP<\/em><\/strong> dita o m\u00ednimo que um produto precisa possuir, para que ele seja rent\u00e1vel. Isso implica em um maior cuidado com o que estamos entregando aos nossos clientes, mas no geral vejo que n\u00e3o estamos nos atentando a essa troca de paradigma.<\/p>\n<p>Outro grande valor que temos ao absorver os conceitos de <em><strong>MMP<\/strong><\/em> no <em><strong>MVP<\/strong><\/em> \u00e9 que ao lan\u00e7ar o produto no mercado, a empresa pode come\u00e7ar a utilizar sua <strong>receita<\/strong>\u00a0como reinvestimento nas altera\u00e7\u00f5es e melhorias, antes do que seria normalmente poss\u00edvel.<\/p>\n<p>Dessa forma podemos resumir que os objetivos do <em><strong>MVP<\/strong><\/em>\u00a0s\u00e3o:<\/p>\n<ul>\n<li>Identificar qual a maneira mais barata de testar uma hip\u00f3tese e aprender com ela;<\/li>\n<li>A partir do aprendizado e da receita gerada, fazer as melhorias necess\u00e1rias (e at\u00e9 <em>pivotar<\/em>\u00a0a ideia se for preciso);<\/li>\n<li>E a\u00ed sim, lan\u00e7ar um produto com mais chances de sucesso;<\/li>\n<\/ul>\n<p><strong>Foco no &#8220;<em>Minimum<\/em>&#8220;<\/strong><\/p>\n<p>\u00c9 muito comum ver no mercado um foco muito grande no <strong>m\u00ednimo<\/strong> do <em><strong>MVP<\/strong><\/em>. As pessoas acabam gastando um tempo enorme removendo tudo que \u00e9 visto como sup\u00e9rfluo \u00e0 necessidade do cliente, e dessa forma, deixam somente o que ir\u00e1 gerar o valor esperado.<\/p>\n<p>Um exemplo desse pensamento, \u00e9 nessa famosa imagem abaixo:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9045 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-1.jpg\" alt=\"\" width=\"693\" height=\"460\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-1.jpg 693w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-1-300x199.jpg 300w\" sizes=\"(max-width: 693px) 100vw, 693px\" \/><\/p>\n<p>Normalmente essa imagem, que foi popularizada pelo <a href=\"https:\/\/blog.crisp.se\/2016\/01\/25\/henrikkniberg\/making-sense-of-mvp\" target=\"_blank\" rel=\"noopener noreferrer\"><em>blog post<\/em> do Henrik<\/a>, \u00e9 usada para explicar o conceito de <strong><em>MVP<\/em><\/strong> da seguinte forma: &#8220;Supondo que o cliente precise se transportar do ponto A ao ponto B, qual seria um bom <em>release plan<\/em>?&#8221;<\/p>\n<p>Na primeira linha temos um exemplo de como n\u00e3o se deve fazer. No <strong>primeiro<\/strong>\u00a0<em>release<\/em> temos uma roda, que n\u00e3o atende \u00e0 necessidade do cliente de se locomover. Como <strong>segundo<\/strong>\u00a0<em>release<\/em> temos o chassi que tampouco atende ao cliente. No <strong>terceiro<\/strong> <em>release<\/em> temos um carro sem volante, que tamb\u00e9m n\u00e3o atende \u00e0 necessidade do cliente. E por fim no <strong>quarto<\/strong> <em>release<\/em> temos o carro que ir\u00e1 trazer o valor esperado pelo cliente. Isso n\u00e3o pode ser considerado um bom <em>release plan<\/em>\u00a0pois s\u00f3 no final do processo que o cliente poder\u00e1 utilizar o produto.<\/p>\n<p>J\u00e1 na segunda linha temos um <em>release plan<\/em> focado na necessidade do cliente em se locomover. Logo no <strong>primeiro<\/strong> <em>release<\/em> ele recebe um produto que ir\u00e1 ajuda-lo a se locomover, embora n\u00e3o seja a melhor op\u00e7\u00e3o poss\u00edvel. Aqui podemos perceber um grande foco no conceito de <strong>m\u00ednimo<\/strong> do <em><strong>MVP<\/strong><\/em>.<\/p>\n<p><strong>Problemas ao focar no &#8220;<em>Minimum<\/em><\/strong>&#8221;<\/p>\n<p>O tipo de pensamento exemplificado acima tem alguns problemas. O primeiro que quero tocar \u00e9 no fator de <strong>retrabalho<\/strong>, seguindo a proposta de MVP anterior temos:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9046 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-2.png\" alt=\"\" width=\"1412\" height=\"424\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-2.png 1412w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-2-300x90.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-2-768x231.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-2-1024x307.png 1024w\" sizes=\"(max-width: 1412px) 100vw, 1412px\" \/><\/p>\n<p>Como vimos anteriormente, a <strong>primeira<\/strong> vers\u00e3o do produto \u00e9 um <strong>skate<\/strong> que traz ao cliente o valor que ele buscava em se locomover. Na <strong>segunda<\/strong> vers\u00e3o temos uma melhoria do <strong>skate<\/strong> ao adicionar a ele uma forma de melhor controlar sua dire\u00e7\u00e3o, o transformando em um <strong>patinete<\/strong>. O problema de retrabalho come\u00e7a a partir da pr\u00f3xima vers\u00e3o:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9047 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-3.png\" alt=\"\" width=\"1370\" height=\"424\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-3.png 1370w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-3-300x93.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-3-768x238.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/mvp-3-1024x317.png 1024w\" sizes=\"(max-width: 1370px) 100vw, 1370px\" \/><\/p>\n<p>Aqui temos uma mudan\u00e7a completa do produto, quase nenhum <strong>componente<\/strong> do <strong>patinete<\/strong> pode ser utilizado na <strong>terceira<\/strong> vers\u00e3o, o que significa que grande parte do trabalho realizado at\u00e9 o momento foi jogado fora para criar essa <strong>bicicleta<\/strong>. O mesmo ocorre entre a vers\u00e3o <strong>quatro<\/strong> e <strong>cinco<\/strong>.<\/p>\n<p>Al\u00e9m do problema de retrabalho, tamb\u00e9m \u00e9 preciso entender que esse foco no &#8220;<strong>M<\/strong>&#8221; pode funcionar bem para novos mercados e sem competi\u00e7\u00e3o, por\u00e9m para entrar em um mercado j\u00e1 existente o <strong>m\u00ednimo<\/strong> pode n\u00e3o ser <strong>vi\u00e1vel<\/strong>.<\/p>\n<p><strong>Focando no &#8220;<em>Viable<\/em>&#8220;\/&#8221;<em>Marketable<\/em>&#8220;<\/strong><\/p>\n<p>Uma forma que eu prefiro tratar um <strong><em>MVP<\/em><\/strong> \u00e9, primeiramente, entender o que \u00e9 <strong>vi\u00e1vel<\/strong>\u00a0no contexto do mercado em que esse produto ser\u00e1 inserido.<\/p>\n<p>Seguindo o exemplo de locomo\u00e7\u00e3o acima: o consumidor de um <strong>skate<\/strong> \u00e9 diferente do consumidor de um <strong>patinete<\/strong>, que por sua vez \u00e9 diferente do consumidor da <strong>bicicleta<\/strong>, da <strong>motocicleta<\/strong> e do <strong>carro<\/strong>. Dessa forma n\u00e3o faz sentido iniciar um produto voltado para um mercado e terminar com ele voltado a outro completamente diferente. Como no exemplo o <strong>carro<\/strong> \u00e9 o <em>end-game<\/em> do produto, vamos utilizar o mercado de <strong>carros<\/strong> para ver o que \u00e9 <strong>m\u00ednimo<\/strong> e <strong>vi\u00e1vel<\/strong>.<\/p>\n<p>No <strong>mercado<\/strong> <strong>brasileiro<\/strong> um <em><strong>MVP<\/strong><\/em> para um <strong>carro<\/strong> seria um autom\u00f3vel simples, sem vidro el\u00e9trico, sem ar-condicionado, c\u00e2mbio manual e volante mec\u00e2nico, por exemplo. As itera\u00e7\u00f5es e o <em><strong>release plan<\/strong><\/em> poderiam ser a fim de adicionar essas funcionalidades ao carro at\u00e9 chegar em um <strong>carro<\/strong> &#8220;completo&#8221;, com vidro el\u00e9trico, ar-condicionado, c\u00e2mbio autom\u00e1tico e volante el\u00e9trico. Dessa forma voc\u00ea \u00e9 capaz de atender \u00e0 necessidade de v\u00e1rios grupos dentro do mercado de <strong>carros<\/strong>\u00a0e todo o esfor\u00e7o das vers\u00e3o anteriores ser\u00e1 usado para construir a pr\u00f3xima vers\u00e3o, sem ter perdas.<\/p>\n<p>Um ponto importante \u00e9 que o <strong>mercado<\/strong> dita o que \u00e9 o <strong>m\u00ednimo vi\u00e1vel<\/strong>, no caso do mercado <strong>americano<\/strong> de autom\u00f3veis, por exemplo, n\u00e3o \u00e9 vi\u00e1vel um carro sem aquecedor e c\u00e2mbio autom\u00e1tico. Lan\u00e7ar um <em><strong>MVP<\/strong><\/em>\u00a0sem essas funcionalidades n\u00e3o trar\u00e1 o valor esperado pelo cliente, podendo at\u00e9 trazer uma vis\u00e3o negativa \u00e0 marca.<\/p>\n<p><strong>Quando devemos focar no &#8220;<em>Minimum<\/em><\/strong>&#8221;<\/p>\n<p>Todos os ponto defendidos acima, s\u00e3o espec\u00edficos para contextos em que o mercado j\u00e1 esteja estabelecido e aonde o objetivo da companhia \u00e9 encontrar uma brecha no mercado para poder atuar (lembrando que nem sempre uma brecha no mercado significa a exist\u00eancia de um mercado na &#8220;brecha&#8221;).<\/p>\n<p>Para mercados novos o enfoque deve ser no desenvolvimento do produto mais simples poss\u00edvel, que gere uma percep\u00e7\u00e3o de valor nos clientes. Nesses casos o conhecimento (transforma\u00e7\u00e3o de uma hip\u00f3tese em mercado) tem maior valor que o retorno financeiro, pois caso o seu produto crie um mercado ele ser\u00e1 o primeiro a entrar e por um tempo n\u00e3o ter\u00e1 concorr\u00eancia direta. Al\u00e9m disso um erro na hip\u00f3tese, tem menor impacto para a marca.<\/p>\n<p><strong>Conclus\u00e3o<\/strong><\/p>\n<p>Em resumo, conforme David Anderson e Alexei Zheglov defendem no livro <a href=\"https:\/\/www.goodreads.com\/book\/show\/36455731-fit-for-purpose\" target=\"_blank\" rel=\"noopener noreferrer\">&#8220;Fit for Purpose&#8221;<\/a>, os crit\u00e9rios de sucesso de um produto s\u00e3o a combina\u00e7\u00e3o de: tempo de resposta (<em><strong>Minimum<\/strong><\/em>), seguran\u00e7a, qualidade e conformidade (<strong><em>Viable\/Marketable<\/em><\/strong>).<\/p>\n<p>Precisamos ent\u00e3o parar de focar tanto em encontrar o produto com a menor quantidade de funcionalidades poss\u00edvel e sim entender qual a necessidade do <strong>mercado<\/strong> para aquele produto. Um produto <strong>m\u00ednimo<\/strong> que n\u00e3o \u00e9 <strong>vi\u00e1vel<\/strong>\u00a0ser\u00e1 sempre um fracasso por n\u00e3o compreender qual o valor em que ele deve estar atuando e qual o seu posicionamento estrat\u00e9gico dentro do mercado que ele est\u00e1 situado.<\/p>\n<p>E voc\u00eas, t\u00eam utilizado o conceito de <em><strong>MVP<\/strong><\/em>\u00a0em suas empresas ? Tem obtido sucesso ? Escreva nos coment\u00e1rios abaixo suas opini\u00f5es e experiencias e fiquem \u00e0 vontade de me enviarem por e-mail tamb\u00e9m!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>O que \u00e9 MVP? O MVP\u00a0(Minimum Viable Product) \u00e9 um acr\u00f4nimo comumente utilizado nos ambientes de desenvolvimento de produtos digitais, significando produto m\u00ednimo vi\u00e1vel. Foi criado por Frank Robinson em 2001 e mundialmente popularizada por Eric Ries dentro da metodologia da Lean Startup. Eric Ries define MVP como &#8220;uma vers\u00e3o de um novo produto que &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/05\/precisamos-dar-um-peso-maior-para-o-v-do-mvp\/\">\u00bb<\/a><\/p>\n","protected":false},"author":69,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9044"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/69"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9044"}],"version-history":[{"count":6,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9044\/revisions"}],"predecessor-version":[{"id":9335,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9044\/revisions\/9335"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9044"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9044"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9044"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}