{"id":6319,"date":"2017-05-11T16:00:59","date_gmt":"2017-05-11T19:00:59","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6319"},"modified":"2017-05-15T15:09:47","modified_gmt":"2017-05-15T18:09:47","slug":"hard-skills-no-gerenciamento-de-projetos-agile","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/05\/hard-skills-no-gerenciamento-de-projetos-agile\/","title":{"rendered":"Hard-Skills no gerenciamento de projetos agile"},"content":{"rendered":"<p>Se voc\u00ea \u00e9 evangelista \u00c1gil (com A mai\u00fasculo, veja <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/12\/nos-nao-somos-necessariamente-ageis-mas-com-certeza-somos-ageis\/\">N\u00f3s n\u00e3o somos necessariamente \u00c1geis\u2026 Mas com certeza somos \u00e1geis!<\/a>), mantenha uma mente aberta para ler o que est\u00e1 por vir.<\/p>\n<blockquote><p>\n  A sociedade \u00e9 definida n\u00e3o apenas pelo que cria, mas tamb\u00e9m pelo que se recusa a destruir. &#8211; John C. Sawhill (tradu\u00e7\u00e3o livre)\n<\/p><\/blockquote>\n<p>Antes de come\u00e7armos, se voc\u00ea n\u00e3o est\u00e1 familiarizado com a terminologia, aqui est\u00e1 uma r\u00e1pida explica\u00e7\u00e3o:<\/p>\n<ul>\n<li><strong>Soft-Skills<\/strong>: s\u00e3o as compet\u00eancias comportamentais e sociais do profissional, como: relacionamento, coordena\u00e7\u00e3o e flexibilidade.<\/li>\n<li><strong>Hard-Skills<\/strong>: s\u00e3o as habilidades t\u00e9cnicas da pessoa, por exemplo, matem\u00e1tica, estat\u00edstica e programa\u00e7\u00e3o.<\/li>\n<\/ul>\n<p>Retirado de <a href=\"https:\/\/www.economias.pt\/soft-skills-hard-skills\/\">Soft skills vs hard skills: diferen\u00e7as e import\u00e2ncia<\/a>.<\/p>\n<h2>O nascimento<\/h2>\n<p>Antes da exist\u00eancia da mentalidade \u00e1gil, gerentes de projetos utilizavam os m\u00e9todos da engenharia cl\u00e1ssica para gerenciar projetos de software. O PMBOK (<em>Project Management Body of Knowledge<\/em>) era, e ainda \u00e9, a fonte de pr\u00e1ticas e ferramentas muito boas para o gerenciamento de projetos. E muitas delas funcionam muito bem nas ind\u00fastrias em geral, especialmente em \u00e1reas n\u00e3o t\u00e3o org\u00e2nicas quanto a \u00e1rea de software.<\/p>\n<p>No entanto, talvez a ind\u00fastria de software tenha usado o PMBOK de maneira errada. O entendimento foi de que as pr\u00e1ticas mencionadas por ele eram muito baseadas em hard-skills, e que n\u00e3o funcionariam para um ambiente t\u00e3o acelerado e incerto como o dos softwares. E sim, o PMBOK cont\u00e9m muitas pr\u00e1ticas t\u00e9cnicas (e algumas n\u00e3o funcionam com o ambiente de software), mas elas estavam todas conectadas atrav\u00e9s de a\u00e7\u00f5es e ferramentas de consolida\u00e7\u00e3o e coordena\u00e7\u00e3o de equipes, as quais foram ignoradas na \u00e9poca (algumas delas podem ser vistas no <a href=\"https:\/\/4squareviews.com\/2013\/06\/13\/5th-edition-pmbok-guide-chapter-8-human-resources-management-knowledge-area\/\">cap\u00edtulo de Recursos Humanos<\/a>).<\/p>\n<p>Mas, como apresentei no post acima mencionado, uma revolu\u00e7\u00e3o aconteceu na \u00e1rea de software, a qual crucificou e enterrou essas pr\u00e1ticas, sem sequer olhar se elas eram todas t\u00e3o ruins assim. Como resultado, os gerentes de projetos viram-se sem ferramentas e decidiram reagir e criar seu pr\u00f3prio ferramental.<\/p>\n<h2>A morte<\/h2>\n<p>Com isso, vieram as metodologias \u00c1geis e suas ferramentas. Al\u00e9m disso, j\u00e1 que a ind\u00fastria n\u00e3o estava muito feliz com as pr\u00e1ticas de soft-skills (que o bom era ser chefe, falando \u00e0s pessoas o que, quando e como fazer), um caminho natural para a revolu\u00e7\u00e3o estava claro: precisava-se melhorar tais habilidades.<\/p>\n<p>E foi melhorado! Pelo menos as novas pr\u00e1ticas facilitam isso&#8230; agora, se as pessoas as aplicam, \u00e9 outra hist\u00f3ria. Com esse pensamento, a imagem de chefe foi abandonada e passou a formar l\u00edderes. O foco virou para a qualidade do c\u00f3digo e n\u00e3o tanto na documenta\u00e7\u00e3o. Desenvolvedores e partes interessadas do produto se aproximaram, pois na comunica\u00e7\u00e3o entre estes n\u00e3o poderia ter proxys (em um mundo perfeito, pelo menos).<\/p>\n<p>Mas as coisas ainda n\u00e3o estavam correndo como desejado. A maioria das empresas adotaram o Scrum, melhoraram seus processos, mas estagnaram em um ponto no qual algo estava errado e n\u00e3o sabiam o que era. O time estava trabalhando melhor desta nova maneira mas estava mais dif\u00edcil de entender onde os problemas no processo estavam. E scrum masters, basicamente, irritavam as \u00e1reas de neg\u00f3cios das empresas, as quais queriam previs\u00f5es e proje\u00e7\u00f5es para fazer seus planejamentos.<\/p>\n<p>Resumindo, o processo foi melhorado olhando-se para dentro &#8212; o time de desenvolvimento estava mais feliz e mais efetivo. No entanto, esqueceu-se de melhorar a comunica\u00e7\u00e3o t\u00e9cnica para fora, com outras \u00e1reas como: neg\u00f3cios, marketing, clientes, etc. Eles precisam de mais dados sobre o desenvolvimento do projeto para que possam planejar e, com isso em mente, voltou-se a tona o uso de algumas hard-skills abandonadas anos atr\u00e1s.<\/p>\n<h2>O renascimento<\/h2>\n<p>Na Plataformatec, n\u00f3s abra\u00e7amos as hard-skills, como a maioria dos nossos <a href=\"http:\/\/blog.plataformatec.com.br\/tag\/metrics\/\">blog posts de agilidade<\/a> mostram. N\u00f3s acreditamos que ter boas e avan\u00e7adas hard-skills n\u00e3o \u00e9 um pecado, podemos e devemos ter a maior quantidade de m\u00e9tricas poss\u00edveis. No entanto, com a implanta\u00e7\u00e3o de m\u00e9tricas, vem grandes responsabilidades (essa frase me soa familiar&#8230; \ud83e\udd14).<\/p>\n<p>M\u00e9tricas servem como uma maneira de facilitar a comunica\u00e7\u00e3o entre \u00e1reas (ou com clientes externos) e melhorar o processo dentro do time. Para ambas, precisamos ter cuidados e n\u00e3o apresentar m\u00e9tricas &#8220;soltas&#8221; (mostrando-as sem o contexto e explica\u00e7\u00e3o ideal). Se isso acontece, se tornam uma maneira de aumentar a demanda e micro-gerenciar o time, o que, geralmente, n\u00e3o \u00e9 saud\u00e1vel. (Outro post sobre os erros mais comuns quando utilizamos m\u00e9tricas est\u00e1 a caminho&#8230;)<\/p>\n<p>Se voc\u00ea ainda n\u00e3o adotou o sistema de m\u00e9tricas ou adotou mas tem d\u00favidas, recomendo nosso curso <strong><em><a href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=curso-metricas-agile&#038;utm_content=post-hard-skills\" target=\"_blank\">M\u00e9tricas para Projetos Agile em 7 e-mails<\/a><\/em><\/strong> no qual voc\u00ea vai aprender quais m\u00e9tricas s\u00e3o importantes em projetos de software, como coletar e analisar os dados.<\/p>\n<h2>Ent\u00e3o qual habilidade \u00e9 mais importante?<\/h2>\n<p>Ambas s\u00e3o extremamente importantes. Soft-skills sem hard-skills fazem o time trabalhar feliz, mas provavelmente de forma ineficiente. Hard-skills sem soft-skills fazem o time estar ciente de seus problemas mas sem motiva\u00e7\u00e3o alguma para melhorar. \u00c9 preciso balancear as duas. Eu j\u00e1 ouvi perguntas como: <em>Mas qual deveria ser a propor\u00e7\u00e3o? 50\/50? 80\/20?<\/em> E eu as respondo com outra pergunta: <em>Como voc\u00ea pretende mensurar quanto de hard-skill ou soft-skill voc\u00ea tem?<\/em><\/p>\n<p>A conclus\u00e3o ent\u00e3o \u00e9: tenha ambas, melhore e se importe com ambas. Se voc\u00ea acredita que j\u00e1 possui o suficiente de alguma delas, repense, pois voc\u00ea pode estar errado. Esse deveria ser o mantra de todos os gerentes de projeto\/Agile coaches&#8230; As empresas devem ter um time motivado e dados suficientes para facilitar a comunica\u00e7\u00e3o e o progresso do projeto.<\/p>\n<p>E voc\u00ea? Prefere uma habilidade \u00e0 outra? Deixe seus coment\u00e1rios abaixo!<\/p>\n<p><!-- \n\n<div id=\"curso-de-metricas-agile-para-conversao-dentro-do-blog-post-a390f1ffc0adf1164a9c\"><\/div>\n\n --><\/p>\n<hr>\n<div style=\"margin:20px 0 60px;\">\n<a href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=curso-metricas-agile&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\"><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile.png\" alt=\"M\u00e9tricas para Projetos Agile em 7 e-mails\" width=\"831\" height=\"147\" class=\"aligncenter size-full wp-image-5972\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile.png 831w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile-300x53.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/12\/CTA-curso-metricas-agile-768x136.png 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Se voc\u00ea \u00e9 evangelista \u00c1gil (com A mai\u00fasculo, veja N\u00f3s n\u00e3o somos necessariamente \u00c1geis\u2026 Mas com certeza somos \u00e1geis!), mantenha uma mente aberta para ler o que est\u00e1 por vir. A sociedade \u00e9 definida n\u00e3o apenas pelo que cria, mas tamb\u00e9m pelo que se recusa a destruir. &#8211; John C. Sawhill (tradu\u00e7\u00e3o livre) Antes de &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/05\/hard-skills-no-gerenciamento-de-projetos-agile\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[254,257,263],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6319"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6319"}],"version-history":[{"count":16,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6319\/revisions"}],"predecessor-version":[{"id":6322,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6319\/revisions\/6322"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6319"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6319"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6319"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}