{"id":9028,"date":"2019-05-20T11:20:08","date_gmt":"2019-05-20T14:20:08","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9028"},"modified":"2019-05-20T14:10:40","modified_gmt":"2019-05-20T17:10:40","slug":"como-comecar-a-medir-seu-produto-digital-pode-piratear","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/05\/como-comecar-a-medir-seu-produto-digital-pode-piratear\/","title":{"rendered":"Como come\u00e7ar a medir seu produto digital? Pode piratear!"},"content":{"rendered":"<p>Um equ\u00edvoco bem comum que tenho visto no mercado \u00e9 pensar que pessoas focadas no processo, em geral, n\u00e3o precisam se preocupar com o produto em si. Se voc\u00ea j\u00e1 viveu dentro da rotina de projetos e times, sabe que \u00e9 um desafio aproximar a vis\u00e3o ampla de neg\u00f3cio do nosso trabalho em conjunto com os times. Mas entender como as m\u00e9tricas de neg\u00f3cio, relativas ao produto, impactam nas iniciativas das equipes pode ajudar voc\u00ea nesse desafio e ser uma chave para evoluir a maturidade \u00e1gil dentro das organiza\u00e7\u00f5es.<\/p>\n<p>Agilistas, de maneira geral, s\u00e3o agentes de mudan\u00e7as. Mas como fazer isso sem um panorama completo da organiza\u00e7\u00e3o? Como auxiliar os times a evolu\u00edrem sem saber em qual dire\u00e7\u00e3o? Mesmo com equipes mais maduras em termos de processo, \u00e9 importante garantir que estejam trabalhando em cima da coisa certa. Peter Drucker j\u00e1 dizia: \u201cN\u00e3o h\u00e1 nada t\u00e3o in\u00fatil do que fazer com grande efici\u00eancia aquilo que n\u00e3o deveria ser feito\u201d.<\/p>\n<p>\u00c9 claro que a ideia n\u00e3o \u00e9 abandonar o foco em melhorar o processo e a forma de trabalho, mas isso precisa ser algo pressuposto e b\u00e1sico do sistema. Segundo <a href=\"https:\/\/medium.com\/software-zen\/a-hist%C3%B3ria-da-f%C3%B3rmula-da-efic%C3%A1cia-ace8dafb86d0\" target=\"_blank\" rel=\"noopener noreferrer\">Alisson Vale<\/a>, quando voc\u00ea encara a efici\u00eancia como algo j\u00e1 esperado e foca o m\u00e1ximo na efic\u00e1cia, vai ser poss\u00edvel validar as suas hip\u00f3teses o mais r\u00e1pido poss\u00edvel e, por fim, entregar valor para seu cliente.<\/p>\n<p>Levando tudo isso em considera\u00e7\u00e3o, ao meu ver, faz todo sentido &#8220;pessoas de processo&#8221; entenderem sobre m\u00e9tricas que v\u00e3o al\u00e9m de como est\u00e1 a sa\u00fade do seu sistema. \u00c9 fundamental saber como seu produto est\u00e1 resolvendo um problema (se ele realmente estiver, rs) e como isso est\u00e1 gerando retorno econ\u00f4mico tamb\u00e9m. Esse post vai ser um pouquinho mais longo, mas tenho certeza que vai ajudar a entender alguns indicadores que nos mostram essas informa\u00e7\u00f5es.<\/p>\n<p>Mas e a\u00ed? Como come\u00e7ar? Vamos conversar sobre as M\u00e9tricas do Pirata?<\/p>\n<h2>M\u00e9tricas do Pirata (AARRR)<\/h2>\n<p>As m\u00e9tricas AARRR foram criadas por <a href=\"https:\/\/500hats.typepad.com\/500blogs\/2007\/09\/startup-metrics.html\" target=\"_blank\" rel=\"noopener noreferrer\">Dave McLure<\/a>, um investidor muito famoso no mundo das<em> Startups<\/em>, e pensadas para otimizar o Software como servi\u00e7o (<em>SaaS<\/em>). Elas ficaram popularmente conhecidas como m\u00e9tricas do pirata (por conta da jun\u00e7\u00e3o das iniciais lembrarem o grito de um pirata).<\/p>\n<p>O objetivo de Dave era conscientizar os CEOs de<em> Startups<\/em> a levarem em considera\u00e7\u00e3o 5 passos que mapeavam o comportamento do usu\u00e1rio dentro do sistema: <em>Acquisition<\/em> (aquisi\u00e7\u00e3o), <em>Activation<\/em> (ativa\u00e7\u00e3o), <em>Retention<\/em> (reten\u00e7\u00e3o), <em>Referral<\/em> (recomenda\u00e7\u00e3o) e <em>Revenue<\/em> (receita).<\/p>\n<p>Vamos falar de cada uma destas fases no decorrer desse post, mas a ideia \u00e9 que a partir da an\u00e1lise de convers\u00e3o dessas etapas, seja mais f\u00e1cil direcionar seus times a encontrarem solu\u00e7\u00f5es mais assertivas nos diferentes est\u00e1gios de seus produtos ou servi\u00e7os digitais.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9038 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/68747470733a2f2f692e696d6775722e636f6d2f45524b6e6973762e6a7067.jpg\" alt=\"\" width=\"807\" height=\"454\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/68747470733a2f2f692e696d6775722e636f6d2f45524b6e6973762e6a7067.jpg 807w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/68747470733a2f2f692e696d6775722e636f6d2f45524b6e6973762e6a7067-300x169.jpg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/05\/68747470733a2f2f692e696d6775722e636f6d2f45524b6e6973762e6a7067-768x432.jpg 768w\" sizes=\"(max-width: 807px) 100vw, 807px\" \/><\/p>\n<h3>Aquisi\u00e7\u00e3o<\/h3>\n<p>Essa \u00e9 a etapa onde entendemos de onde os usu\u00e1rios est\u00e3o vindo e como essas pessoas est\u00e3o se tornando clientes eventualmente (ou n\u00e3o, rs). \u00c9 uma boa forma para analisar os melhores canais de divulga\u00e7\u00e3o, por exemplo.<\/p>\n<p>Na <a href=\"https:\/\/medium.com\/felipe-barbosa\/aarrr-medindo-seu-funil-de-marketing-e-vendas-com-as-pirate-metrics-f2adedb8c882#5fd2\" target=\"_blank\" rel=\"noopener noreferrer\">etapa de aquisi\u00e7\u00e3o<\/a> faz sentido buscar o aumento de volume de pessoas nessa fase inicial do funil. Para isso, as<em> startups<\/em> podem dispor de diferentes estrat\u00e9gias de acordo com o cen\u00e1rio e objetivo.<\/p>\n<p>Algumas perguntas podem ser fundamentais para descobrir otimiza\u00e7\u00f5es com foco no aumento da taxa de convers\u00e3o:<br \/>\n* De onde meu usu\u00e1rio est\u00e1 vindo?<br \/>\n* Qual \u00e9 o canal com menor custo de aquisi\u00e7\u00e3o por cliente convertido?<br \/>\n* Qual \u00e9 o comportamento dele na p\u00e1gina inicial ?<br \/>\n* Quanto tempo ele permanece no meu sistema?<\/p>\n<p>\u00c9 claro que precisamos direcionar essas melhorias para n\u00e3o s\u00f3 aumentar a quantidade, mas principalmente a qualidade desses <em>leads<\/em>. Seus objetivos precisam ser focados em usu\u00e1rios que se encaixam no seu perfil de cliente ideal, porque no final das contas, \u00e9 ele quem vai estar mais pr\u00f3ximo de se tornar um cliente pagante e vai pagar os custos de aquisi\u00e7\u00e3o disso tudo.<\/p>\n<h3>Ativa\u00e7\u00e3o<\/h3>\n<p>A ativa\u00e7\u00e3o \u00e9 o momento em que o usu\u00e1rio vai ser realmente inserido no sistema e consumir o produto de alguma maneira. Isso pode ser um cadastro, o <em>download<\/em> de algum conte\u00fado, visualiza\u00e7\u00e3o de algum tutorial, enfim, essa \u00e9 a hora para mostrar o valor do seu produto.<\/p>\n<p>Concentre seus esfor\u00e7os para que essa seja uma boa experi\u00eancia e ele possa voltar. Afinal de contas, qual o valor para o seu sistema ter um usu\u00e1rio com o cadastro realizado, mas que depois n\u00e3o volta? Ou, no caso de um aplicativo, o qu\u00e3o valioso \u00e9 ter usu\u00e1rio que baixa o app e logo depois desinstala, ou faz o login uma vez e n\u00e3o volta mais? <strong>Ativa\u00e7\u00e3o tem a ver com recorr\u00eancia. E recorr\u00eancia tem a ver com boa experi\u00eancia.<\/strong><\/p>\n<p>Entender como est\u00e1 o processo de ativa\u00e7\u00e3o do usu\u00e1rio pode ajudar a levantar pontos melhoria como por exemplo:<br \/>\n* Melhorar o onboarding dentro da plataforma;<br \/>\n* Melhorar acessibilidade das pesquisas;<\/p>\n<h3>Reten\u00e7\u00e3o<\/h3>\n<p>A reten\u00e7\u00e3o significa que os usu\u00e1rios regularmente voltam para usar o seu produto e continuam enxergando valor no que est\u00e1 sendo oferecido.<\/p>\n<p>Normalmente, as pessoas encontram seu sistema, est\u00e3o ativas de certa forma, mas precisam de um est\u00edmulo para voltar. Sabe aquelas notifica\u00e7\u00f5es de lembrete e cupom de desconto? Ent\u00e3o, provavelmente elas foram melhorias que surgiram para otimizar a reten\u00e7\u00e3o de usu\u00e1rios (e a receita tamb\u00e9m).<\/p>\n<p>A parte mais importante de analisar a reten\u00e7\u00e3o do seu produto \u00e9 que ela pode ser a chave para entender um indicador ainda mais importante de efic\u00e1cia, o <em>CHURN<\/em> (evas\u00e3o). Basicamente, o<em> CHURN<\/em> vai te dizer a taxa de cancelamento de seus clientes e \u00e9 essencial para mapear os motivos pelos quais isso acontece.<\/p>\n<p>Se, em n\u00fameros de usu\u00e1rios, a sua taxa de <em>CHURN<\/em> for maior que a sua taxa de aquisi\u00e7\u00e3o, cuidado, <em>algo n\u00e3o est\u00e1 certo<\/em>. Tente identificar o porqu\u00ea disso.<\/p>\n<h3>Recomenda\u00e7\u00e3o<\/h3>\n<p>Uma vez trabalhada a ativa\u00e7\u00e3o e reten\u00e7\u00e3o, como \u00e9 poss\u00edvel fazer com que os usu\u00e1rios indiquem o produto para outras pessoas? Quando voc\u00ea encontra maneiras de fazer isso, seu custo de aquisi\u00e7\u00e3o reduz significamente porque o pr\u00f3prio cliente est\u00e1 fazendo a prospec\u00e7\u00e3o de <em>leads<\/em> do seu produto (e esse n\u00e3o \u00e9 o sonho de qualquer um?).<\/p>\n<p>Exemplos que j\u00e1 ouvimos falar por a\u00ed:<\/p>\n<ul>\n<li>Indique um amigo e ganhe uma corrida gr\u00e1tis;<\/li>\n<li>Cadastre 3 e-mails e ganhe espa\u00e7o extra de armazenamento;<\/li>\n<\/ul>\n<h3>Receita<\/h3>\n<p>De acordo com a literatura, ao otimizar as m\u00e9tricas anteriores, a receita deve fluir melhor. Por\u00e9m, \u00e9 importante entender o que est\u00e1 direcionando o seu usu\u00e1rio a realmente completar o fluxo de compra.<\/p>\n<p>Aumentar essa m\u00e9trica significa que a quantidade de ganhos que um usu\u00e1rio gera durante seu ciclo como cliente do produto deve ser maior que a quantidade de custos para adquirir esse usu\u00e1rio. O ganho, nesse caso, pode ser chamado de CLV (<em>Customer lifetime value<\/em>) e o custo \u00e9 conhecido por CAC (<em>Customer acquisition cost<\/em>). Ambos s\u00e3o tamb\u00e9m indicadores de produto, mas com um vi\u00e9s mais financeiro. Para um entendimento mais completo dessas outras medidas, recomendo fortemente a leitura do artigo do Raphael Albino: <a href=\"http:\/\/blog.plataformatec.com.br\/2018\/01\/o-que-seriam-boas-metricas-para-produtos-digitais\/\" target=\"_blank\" rel=\"noopener noreferrer\">O que seriam boas m\u00e9tricas para produtos digitais?<\/a>.<\/p>\n<h2>Dicas<\/h2>\n<ul>\n<li><strong>Direcione seus esfor\u00e7os para medir a coisa certa.<\/strong> Tome cuidado com m\u00e9tricas de vaidade, porque elas normalmente mostram apenas um status do produto, sem dar insumos para melhorias, podendo at\u00e9 mesmo direcionar \u00e0s decis\u00f5es erradas.<\/li>\n<li>Ex: N\u00famero de <em>likes<\/em> e visualiza\u00e7\u00f5es;<\/li>\n<li><strong>Entenda o cen\u00e1rio do produto e foque no que faz mais sentido para o momento.<\/strong> Por mais que voc\u00ea me\u00e7a todos os passos AARRR, nem sempre \u00e9 conveniente pensar em melhorias para todos eles. Tudo tem sua hora, invista no que vai gerar mais resultado pro seu contexto.<\/li>\n<\/ul>\n<h2>Conclus\u00e3o<\/h2>\n<p>Voc\u00ea, como <em>Scrum Master<\/em>, <em>Agile Coach<\/em>, Gerente de projetos, n\u00e3o precisa ser o mestre das m\u00e9tricas de produto, mas \u00e9 muito importante saber que elas existem e quais s\u00e3o suas finalidades e impactos. Isso pode ajudar muito a entender o contexto e auxiliar o time a fazer entregas de real valor. E por falar em equipes, tendo em vista o conceito de auto-organiza\u00e7\u00e3o, caso estas m\u00e9tricas sejam conhecidas e entendidas por elas, o processo de prioriza\u00e7\u00e3o junto aos <em>stakeholders<\/em> poder\u00e1 trazer ainda mais valor para o neg\u00f3cio.<\/p>\n<p>E voc\u00ea? Como est\u00e1 sendo a experi\u00eancia de trabalhar com produtos? Conta pra gente nos coment\u00e1rios! At\u00e9 mais! \ud83d\ude42<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Um equ\u00edvoco bem comum que tenho visto no mercado \u00e9 pensar que pessoas focadas no processo, em geral, n\u00e3o precisam se preocupar com o produto em si. Se voc\u00ea j\u00e1 viveu dentro da rotina de projetos e times, sabe que \u00e9 um desafio aproximar a vis\u00e3o ampla de neg\u00f3cio do nosso trabalho em conjunto com &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/05\/como-comecar-a-medir-seu-produto-digital-pode-piratear\/\">\u00bb<\/a><\/p>\n","protected":false},"author":80,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9028"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/80"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9028"}],"version-history":[{"count":10,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9028\/revisions"}],"predecessor-version":[{"id":9042,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9028\/revisions\/9042"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9028"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9028"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9028"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}