{"id":7548,"date":"2018-05-21T16:16:43","date_gmt":"2018-05-21T19:16:43","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7548"},"modified":"2018-05-23T14:35:22","modified_gmt":"2018-05-23T17:35:22","slug":"agil-para-pmps-e-pmbok-para-agilistas-caminho-critico-no-agil","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/05\/agil-para-pmps-e-pmbok-para-agilistas-caminho-critico-no-agil\/","title":{"rendered":"\u00c1gil Para PMPs e PMBoK Para Agilistas: Caminho Cr\u00edtico no \u00c1gil?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Recentemente estive ministrando um treinamento sobre m\u00e9todos \u00e1geis e um aluno me perguntou: <\/span><b>como faz pra saber qual \u00e9 o caminho cr\u00edtico num projeto \u00e1gil<\/b><span style=\"font-weight: 400;\">?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fiquei pensando na import\u00e2ncia dessa pergunta para as pessoas que est\u00e3o aprendendo sobre Agile e t\u00eam uma forma\u00e7\u00e3o voltada \u00e0 gest\u00e3o &#8220;tradicional&#8221;, mas tamb\u00e9m para os agilistas que talvez n\u00e3o conhe\u00e7am as abordagens tradicionais em profundidade suficiente para enxergar seus benef\u00edcios.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Para quem est\u00e1 chegando agora ao mundo \u00c1gil, uma das maiores diferen\u00e7as entre as abordagens adaptativa e preditiva est\u00e1 na gest\u00e3o do tempo. O processo descrito no PMBoK exige que conhe\u00e7amos o escopo do projeto e, a partir dele derivemos os c\u00e1lculos de tempo, custos etc. Em outras palavras, a grande pergunta a ser respondida num processo de planejamento \u00e9 &#8220;<\/span><b>Quando o escopo ser\u00e1 entregue<\/b><span style=\"font-weight: 400;\">?&#8221;. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Para quem \u00e9 agilista e tem dificuldades em lidar com deadlines e press\u00f5es por prazo, \u00e9 importante saber que o conceito de caminho cr\u00edtico ainda \u00e9 plenamente difundido no contexto de C-levels. Conhecer esse conceito pode te ajudar a alinhar expectativas e proteger seu time das press\u00f5es por prazo. Na abordagem adaptativa, a pergunta &#8220;<\/span><b>Que parte do escopo ser\u00e1 entregue na data X?<\/b><span style=\"font-weight: 400;\">&#8221; faz muito mais sentido.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Relembrando o conceito, o caminho cr\u00edtico \u00e9 aquele de maior dura\u00e7\u00e3o no cronograma do projeto e, portanto, n\u00e3o tem folgas. O caminho cr\u00edtico \u00e9 que determina &#8220;a data de t\u00e9rmino do projeto&#8221;. Quando o tempo \u00e9 uma restri\u00e7\u00e3o importante (sempre), o foco da gest\u00e3o do tempo do gerente de projetos PMP \u00e9 o caminho cr\u00edtico, afinal, qualquer deslize no caminho cr\u00edtico implica em atraso no projeto.<\/span><\/p>\n<h2><b>Exemplo de caminho cr\u00edtico:<\/b><\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-7552 aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/img1.png\" alt=\"exemplo de caminho cr\u00edtico\" width=\"763\" height=\"175\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/img1.png 624w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/img1-300x69.png 300w\" sizes=\"(max-width: 763px) 100vw, 763px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Voltando \u00e0 pergunta inicial, ser\u00e1 que o conceito de caminho cr\u00edtico ainda faz sentido num projeto \u00e1gil? Na minha opini\u00e3o, a resposta \u00e9 que <\/span><b>se<\/b> <b>algumas premissas b\u00e1sicas forem atendidas, n\u00e3o<\/b><span style=\"font-weight: 400;\">. Levando em considera\u00e7\u00e3o que a principal raz\u00e3o para conhecer um caminho cr\u00edtico \u00e9 <\/span><b>saber quando determinada entrega ser\u00e1 feita<\/b><span style=\"font-weight: 400;\">, \u00a0devemos buscar maneiras de gerenciar essa expectativa, n\u00e3o importando se a abordagem de entrega escolhida for preditiva (tradicional) ou adaptativa (\u00e1gil).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Aprofundando um pouco mais essa an\u00e1lise, ainda mais importante \u00e9 o que est\u00e1 por tr\u00e1s da entrega: <\/span><b>valor<\/b> <b>para o neg\u00f3cio. <\/b><span style=\"font-weight: 400;\">Ambas as abordagens tradicional e \u00e1gil buscam a entrega de valor. Entretanto, os processos do PMBoK direcionam as entregas ao valor percebido pelas partes interessadas do projeto, atrav\u00e9s do <\/span><b>atendimento dos requisitos das partes interessadas<\/b><span style=\"font-weight: 400;\">. Fica a cargo da equipe de projetos a defini\u00e7\u00e3o dos requisitos, sua especifica\u00e7\u00e3o e sua negocia\u00e7\u00e3o com as partes interessadas. Nesse contexto, a entrega do valor do <\/span><b>real valor para o neg\u00f3cio<\/b><span style=\"font-weight: 400;\"> \u00e9 feita de maneira indireta.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">J\u00e1 na abordagem \u00c1gil ou adaptativa, a gest\u00e3o de requisitos fica a cargo da figura do <\/span><b>Product Owner ou PO<\/b><span style=\"font-weight: 400;\">. O PO simplifica essa camada de interface com as outras partes interessadas, \u00a0tendo o poder de priorizar as entregas. Essa prioriza\u00e7\u00e3o n\u00e3o \u00e9 mais realizada para atender \u00e0s expectativas dos stakeholders. O compromisso mais importante do PO deve ser com o <\/span><b>valor para neg\u00f3cio. <\/b><span style=\"font-weight: 400;\">O foco na companhia tamb\u00e9m simplifica a gest\u00e3o de stakeholders pois mitiga a influ\u00eancia de agendas pessoais, isto \u00e9: n\u00e3o interessa se tal diretor &#8220;prometeu&#8221; tal entrega buscando uma promo\u00e7\u00e3o, interessa se tal entrega realmente \u00e9 valiosa para a organiza\u00e7\u00e3o. Para isso, \u00e9 fundamental que o PO saia do campo das percep\u00e7\u00f5es e press\u00f5es e passe a utilizar abordagens mais matem\u00e1ticas como hip\u00f3teses de valor de ROI, custo de produ\u00e7\u00e3o do escopo, <\/span><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/06\/quanto-a-empresa-perde-financeiramente-quando-o-projeto-atrasa\/\"><span style=\"font-weight: 400;\">custo do atraso<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/www.scaledagileframework.com\/wsjf\/\"><span style=\"font-weight: 400;\">WSJF<\/span><\/a><span style=\"font-weight: 400;\"> , <\/span><a href=\"https:\/\/blog.taller.net.br\/o-que-e-bvp-no-desenvolvimento-agil\/\"><span style=\"font-weight: 400;\">BVP<\/span><\/a><span style=\"font-weight: 400;\">, entre outras t\u00e9cnicas para priorizar o Backlog. <\/span><\/p>\n<h2><b>Backlog priorizado por valor:<\/b><\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7560\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table2-1024x640.png\" alt=\"\" width=\"686\" height=\"429\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table2-1024x640.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table2-300x187.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table2-768x480.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table2.png 1146w\" sizes=\"(max-width: 686px) 100vw, 686px\" \/>Uma discuss\u00e3o adicional \u00e0 prioriza\u00e7\u00e3o do backlog (ou escopo) por valor e que vale a pena ser trazida \u00e0 tona \u00e9 sobre a depend\u00eancia entre as hist\u00f3rias, ou seja, em que ordem elas devem ser entregues para tornar as entregas vi\u00e1veis. O PMBoK sugere que as depend\u00eancias sejam identificadas e tratadas em n\u00edvel de tarefas. Na sequ\u00eancia, essas depend\u00eancias s\u00e3o utilizadas para conhecer a <b>corrente cr\u00edtica do projeto<\/b>, e a\u00ed ent\u00e3o calcular o caminho cr\u00edtico. Dessa forma, o m\u00e9todo garante que sempre que chegar o momento da execu\u00e7\u00e3o de uma atividade, as depend\u00eancias j\u00e1 ter\u00e3o sido tratadas.<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">J\u00e1 nas abordagens \u00e1geis, gerenciar em n\u00edvel de tarefas n\u00e3o faz mais sentido, pois as tarefas geralmente est\u00e3o relacionadas \u00e0s etapas fixas do processo ou definidas com uma vis\u00e3o limitada a uma hist\u00f3ria espec\u00edfica. Ainda que os manuais de agile digam que as hist\u00f3rias precisam ser independentes umas das outras, a experi\u00eancia das trincheiras mostra que nem sempre isso \u00e9 poss\u00edvel. Dessa forma, o PO deve submeter sua prioriza\u00e7\u00e3o \u00e0 an\u00e1lise do time para identifica\u00e7\u00e3o de depend\u00eancias. A ordem dos itens numa corrente cr\u00edtica, dessa forma, deve estar representada na prioriza\u00e7\u00e3o do backlog.<\/span><\/p>\n<h2><b>Identifica\u00e7\u00e3o das depend\u00eancias:<\/b><\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7561\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/identific-1024x620.png\" alt=\"\" width=\"722\" height=\"437\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/identific-1024x620.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/identific-300x182.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/identific-768x465.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/identific.png 1150w\" sizes=\"(max-width: 722px) 100vw, 722px\" \/><\/p>\n<p>&nbsp;<\/p>\n<h2><b>Re-prioriza\u00e7\u00e3o do backlog considerando depend\u00eancias:<\/b><\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7559\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table1-1024x621.png\" alt=\"\" width=\"826\" height=\"501\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table1-1024x621.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table1-300x182.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table1-768x466.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/table1.png 1236w\" sizes=\"(max-width: 826px) 100vw, 826px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Ent\u00e3o, para substituir satisfatoriamente o conhecimento do caminho cr\u00edtico quando migramos para abordagens \u00e1geis, temos que atender \u00e0s seguintes premissas:<\/span><\/p>\n<p>&nbsp;<\/p>\n<ol>\n<li><b>Ter uma cad\u00eancia de entrega de valor.<\/b><span style=\"font-weight: 400;\"> No Scrum, por exemplo, essa cad\u00eancia \u00e9 definida pelos Sprints; em abordagens de fluxo de trabalho puxado como o Kanban, temos o Delivery Planning para definir quando as entregas ser\u00e3o feitas.\n<p><\/span><\/li>\n<li><b>Ter um backlog priorizado por valor, mas que considere as depend\u00eancias entre as hist\u00f3rias. <\/b><span style=\"font-weight: 400;\">O time sempre trabalhar\u00e1 nas entregas de maior valor para o neg\u00f3cio. E essas entregas sempres ser\u00e3o feitas o mais cedo <\/span><span style=\"font-weight: 400;\">poss\u00edvel<\/span><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">.<br \/>\n<\/span><\/span><\/li>\n<li><b>Ser capaz de conhecer o tamanho dos itens do seu backlog e de estimar a produtividade do time.<\/b><span style=\"font-weight: 400;\"> Seja usando uma abordagem de story points, <\/span><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/01\/requisitos-em-equipes-ageis-falando-sobre-complexidade-e-incerteza\/\"><span style=\"font-weight: 400;\">analisando a complexidade e incerteza das demandas<\/span><\/a><span style=\"font-weight: 400;\"> ou usando throughput e assumindo a premissa de que as hist\u00f3rias t\u00eam tamanhos similares.<\/span><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Atendendo a essas 3 premissas, somos capazes de responder a todas as expectativas por tr\u00e1s do conhecimento do caminho cr\u00edtico. As partes interessadas poder\u00e3o ter uma <\/span><b>no\u00e7\u00e3o de quando um item ser\u00e1 entregue<\/b><span style=\"font-weight: 400;\">. Por mais flexibilidade e volatilidade na composi\u00e7\u00e3o e prioriza\u00e7\u00e3o do escopo que os m\u00e9todos \u00e1geis tragam para a organiza\u00e7\u00e3o, o Gestor do Projeto (ou papel similar) n\u00e3o deve menosprezar a import\u00e2ncia dessa informa\u00e7\u00e3o, pois sempre poder\u00e3o existir na organiza\u00e7\u00e3o <\/span><b>outras iniciativas dependentes dessas entregas<\/b><span style=\"font-weight: 400;\">, como por exemplo campanhas de marketing.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sendo assim, \u00a0<\/span><b>a expectativa de gerar valor para o neg\u00f3cio <\/b><span style=\"font-weight: 400;\">\u00e9 plenamente atendida. Logo, faz muito mais sentido substituir o conhecimento do caminho cr\u00edtico pelo conhecimento de <\/span><b>qual o valor que tal entrega traz para o neg\u00f3cio<\/b><span style=\"font-weight: 400;\"> e <\/span><b>qual a posi\u00e7\u00e3o dessa entrega no backlog.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Para concluir, gostaria de deixar uma reflex\u00e3o: \u00e9 preciso ter a consci\u00eancia de que a transi\u00e7\u00e3o entre as duas abordagens deve ser feita da forma mais suave poss\u00edvel. Por vezes, o abismo entre as abordagens preditiva e adaptativa \u00e9 grande e existe dificuldade em saltar de um lado para o outro. \u00a0Nesse sentido, \u00e9 aconselh\u00e1vel a utiliza\u00e7\u00e3o de abordagens e ferramentas h\u00edbridas para conduzir as partes interessadas nessa transi\u00e7\u00e3o. Particularmente, venho utilizando com sucesso a ferramenta de &#8220;Reality Check&#8221;, sobre a qual voc\u00ea pode aprender mais no post <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/11\/alinhando-expectativas-de-prazo-com-o-reality-check\/\">&#8220;Alinhando expectativas de prazo com o <\/a><\/span><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/11\/alinhando-expectativas-de-prazo-com-o-reality-check\/\"><span style=\"font-weight: 400;\">Reality Check<\/span><\/a><span style=\"font-weight: 400;\">&#8220;. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">E voc\u00ea, o que vem utilizando para gerenciar expectativas de prazo e depend\u00eancias entre as atividades dos seus projetos?<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><em>Quer receber conte\u00fados exclusivos de agilidade curados pelo time da Plataformatec? Se voc\u00ea ainda n\u00e3o assina a Cont\u00c1gil, clique no bot\u00e3o abaixo \ud83d\ude42<\/em><\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=contagil-subscription&amp;utm_content=banner-sidebar\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-7432\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar.png\" alt=\"\" width=\"867\" height=\"153\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar.png 831w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar-300x53.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar-768x136.png 768w\" sizes=\"(max-width: 867px) 100vw, 867px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Recentemente estive ministrando um treinamento sobre m\u00e9todos \u00e1geis e um aluno me perguntou: como faz pra saber qual \u00e9 o caminho cr\u00edtico num projeto \u00e1gil? Fiquei pensando na import\u00e2ncia dessa pergunta para as pessoas que est\u00e3o aprendendo sobre Agile e t\u00eam uma forma\u00e7\u00e3o voltada \u00e0 gest\u00e3o &#8220;tradicional&#8221;, mas tamb\u00e9m para os agilistas que talvez n\u00e3o &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/05\/agil-para-pmps-e-pmbok-para-agilistas-caminho-critico-no-agil\/\">\u00bb<\/a><\/p>\n","protected":false},"author":66,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7548"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/66"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7548"}],"version-history":[{"count":13,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7548\/revisions"}],"predecessor-version":[{"id":7566,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7548\/revisions\/7566"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7548"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7548"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7548"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}