{"id":9022,"date":"2019-05-03T14:25:31","date_gmt":"2019-05-03T17:25:31","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9022"},"modified":"2019-05-06T14:26:57","modified_gmt":"2019-05-06T17:26:57","slug":"inception-os-cuidados-antes-de-rodar-este-processo","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2019\/05\/inception-os-cuidados-antes-de-rodar-este-processo\/","title":{"rendered":"Inception: Os cuidados antes de rodar este processo"},"content":{"rendered":"<p>Muito se fala sobre o processo de <em>inception<\/em> de um produto no mercado, muitas empresas tem implementado esse processo e ap\u00f3s ter a experi\u00eancia de ter participado da facilita\u00e7\u00e3o desse processo, resolvi escrever sobre alguns pontos de aten\u00e7\u00e3o que voc\u00ea deveria ter quando estiver se preparando para executar o processo.<\/p>\n<h2>O que \u00e9 uma inception?<\/h2>\n<p>Antes de come\u00e7ar, vamos conceitualizar o que \u00e9 uma <em>inception<\/em>. A <em>inception<\/em> \u00e9 um processo que dura alguns dias (e at\u00e9 semanas e meses) onde pessoas de produto, tecnologia e neg\u00f3cio participam de v\u00e1rias din\u00e2micas com o intuito de alinhar e a definir os objetivos, estrat\u00e9gias e o escopo de um produto. O resultado da <em>inception<\/em> \u00e9, em linhas gerais, um backlog do produto, o fatiamento deste <em>backlog<\/em> em <em>releases<\/em> alinhado com os objetivos e uma estrat\u00e9gia de como vamos desenvolver o produto.<br \/>\nA <em>inception<\/em> pode ser executada para um produto em uma linha mais <a href=\"https:\/\/barryoreilly.com\/lean-pmo-explore-vs-exploit\/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>explore ou exploit<\/em><\/a>, por\u00e9m vale comentar que na linha de <em>explore<\/em> (uma linha mais disrupitiva) talvez seja preciso utilizar algumas ferramentas para valida\u00e7\u00e3o de hip\u00f3teses, como Design <em>Sprint<\/em>, por exemplo. Em uma linha mais <em>exploit <\/em>(uma linha mais de inova\u00e7\u00e3o), pode ser que essas ferramentas de valida\u00e7\u00e3o possa ser utilizada mais pontualmente.<\/p>\n<p>Dado essa introdu\u00e7\u00e3o sobre ao processo, vamos aos pontos levantados:<\/p>\n<h2>Gaste um tempo setando expectativas<\/h2>\n<p>\u00c9 incr\u00edvel como esse ponto \u00e9 b\u00e1sico e desafiador ao mesmo tempo. Antes de come\u00e7ar a <em>inception<\/em>, alinhe como ser\u00e1 o processo, o que \u00e9 esperado das pessoas na participa\u00e7\u00e3o das din\u00e2micas e qual \u00e9 o resultado esperado em cada din\u00e2mica aplicada e tamb\u00e9m ao final do processo. Feito esse alinhamento antes de come\u00e7ar o processo, reforce esse ponto no primeiro encontro da inception e no come\u00e7o de cada din\u00e2mica. Isso vai te salvar muito tempo durante as din\u00e2micas e na facilita\u00e7\u00e3o das discuss\u00f5es.<\/p>\n<h2>Garanta que todos tenham uma vis\u00e3o do processo da inception e seus outputs<\/h2>\n<p>Ainda relacionado com as expectativas das pessoas, garanta que as pessoas tenham uma vis\u00e3o do passo a passo das din\u00e2micas, o resultado esperado de cada etapa e como esses estes est\u00e3o relacionados com o outputs finais da inception.<br \/>\nAl\u00e9m desse ponto, garanta que as pessoas tenham uma vis\u00e3o da agenda e sempre mostre o quanto avan\u00e7amos e o que falta para alcan\u00e7armos nosso objetivo. Como a inception \u00e9 um processo que pode ser demorado, essa etapa ajuda no alinhamento das expectativas de quem est\u00e1 participando.<\/p>\n<h2>Gaste um tempo com o processo AS IS e ajude o pessoa a abstrair isso no TO BE<\/h2>\n<p>Aqui vale comentar que primeiro entendemos o fluxo <em>AS IS<\/em> (como \u00e9 o fluxo ou o processo atual) para depois irmos desenharmos o fluxo <em>TO BE <\/em>(como o fluxo ou o processo deveria ser).<br \/>\nAssim, gaste um tempo consider\u00e1vel entendendo e montando o fluxo <em>AS IS<\/em>. Quanto mais tempo voc\u00ea dedicar a entender isso e a garantir que o grupo todo entendeu como \u00e9 o processo atual, melhor ser\u00e3o as discuss\u00f5es sobre a solu\u00e7\u00e3o.<\/p>\n<p><strong><em>Disclaimer<\/em>:<\/strong> pode haver casos onde n\u00e3o h\u00e1 um fluxo <em>AS IS<\/em> ou esse \u00e9 muito complexo de ser mapeado (produto na linha de exploit). Neste caso, uma das op\u00e7\u00f5es \u00e9 ir direto para o fluxo <em>TO BE<\/em>, mas tome cuidado, pois isso pode ser um sinal de que voc\u00ea est\u00e1 levando algumas incertezas para esse fluxo <em>TO BE<\/em>. Sempre tome cuidado com suposi\u00e7\u00f5es sobre o fluxo <em>TO BE<\/em>.<\/p>\n<p>Depois desse entendimento, quando formos para o fluxo <em>TO BE<\/em>, garanta que as pessoas consigam abstrair isso no <em>TO BE<\/em> de uma forma que elas n\u00e3o tentem propor uma melhoria do processo atual, mas sim propor uma solu\u00e7\u00e3o para as dores e necessidades do usu\u00e1rio. Um exemplo que pode ser dado \u00e9 quando estamos desenvolvendo um software para automatiza\u00e7\u00e3o de um processo onde temos um fluxo <em>AS IS<\/em> totalmente manual, fa\u00e7a com que as pessoas pensem em formas de automatizar este fluxo, podendo at\u00e9 eliminar algumas etapas com a automatiza\u00e7\u00e3o, ao inv\u00e9s de tentar melhorar as etapas de forma manual, pois isso pode n\u00e3o fazer sentido nesse contexto.<\/p>\n<h2>Alinhe alguns conceitos sobre agilidade e desenvolvimento de software<\/h2>\n<p>Tenha em mente que nem todos que est\u00e3o participando da inception t\u00eam claro alguns conceitos comuns no desenvolvimento de produtos de software, como intera\u00e7\u00f5es, entregas incrementais, entregas cont\u00ednuas, tamanho dos lotes, etc, e isso causa algumas discuss\u00f5es durante as din\u00e2micas.<br \/>\nEntre os pontos que causam discuss\u00e3o, o que mais se discute \u00e9 em rela\u00e7\u00e3o ao <em>MVP<\/em> ou <em>MVP&#8217;s<\/em> da solu\u00e7\u00e3o. Gaste um tempo alinhando com os participantes esse conceito e como esse conceito e outros ir\u00e3o ajudar a entregar valor mais r\u00e1pido para fluir melhor com as discuss\u00f5es que surgir\u00e3o.<\/p>\n<h2>Tenha tempo para se preparar e planejar manobras<\/h2>\n<p>Algumas literaturas sugerem que voc\u00ea reserve v\u00e1rios dias seguidos de din\u00e2mica sem intervalos entre os dias. Ter ou n\u00e3o esses intervalos \u00e9 um ponto que tem alguns <em>trade-offs<\/em> a serem considerados.<br \/>\nSe voc\u00ea n\u00e3o tiver intervalo entre os dias, voc\u00ea conseguir\u00e1 terminar o processo mais cedo, o esfor\u00e7o para recapitular alguns pontos das etapas anteriores \u00e9 menor e pode ser mais f\u00e1cil de convencer os <em>stakeholders<\/em> a investir tempo nas din\u00e2micas. Em contra partida, as pessoas podem ficar mais cansadas, voc\u00ea como facilitador n\u00e3o ter\u00e1 muito tempo para se preparar para os pr\u00f3ximos passos, alguns alinhamentos ap\u00f3s uma etapa e outra podem n\u00e3o acontecer, afetando a qualidade do resultado final da <em>inception<\/em>.<br \/>\nOutro ponto importante \u00e9 que as din\u00e2micas utilizadas nas inception, geralmente, s\u00e3o padr\u00f5es para todos os tipos de produto, por\u00e9m pode surgir a necessidade de adaptar algumas din\u00e2micas ou at\u00e9 criar din\u00e2micas para ajudar os <em>stakeholders<\/em> a tomarem decis\u00f5es. Sem um intervalo entre as din\u00e2micas, essas mudan\u00e7as de processos podem n\u00e3o acontecer e interferir no resultado final.<\/p>\n<h2>N\u00e3o se prenda as ferramentas mas ao objetivo do processo<\/h2>\n<p>O objetivo do processo como um todo \u00e9 levantar o escopo do produto, seus objetivos e suas estrat\u00e9gias e, para isso, h\u00e1 muitas ferramentas dispon\u00edveis e at\u00e9 um processo todo montado para atingir estes objetivos, mas n\u00e3o se prenda a isto. Caso voc\u00ea encontre alguma etapa ou din\u00e2mica que n\u00e3o fa\u00e7a sentido para o contexto que voc\u00eas estam enfrentando, remova esta. Caso encontre a necessidade de mais algumas din\u00e2micas extras, pesquise na internet e at\u00e9 crie algumas novas. O importante mesmo \u00e9 o resultado deste proceso e as din\u00e2micas s\u00e3o s\u00f3 um meio para isso.<\/p>\n<h2>Tenha pessoas para ajudar a facilitar<\/h2>\n<p>Facititar as discuss\u00f5es e garantir que estamos no caminho certo \u00e9 algo muito custoso. Algumas discuss\u00f5es podem ficar longas e complexas. Al\u00e9m destes pontos, voc\u00ea como facilitador vai ficar exausto em alguns momentos devido a grande carga cognitiva envolvida nas din\u00e2micas. Ter algu\u00e9m para ajudar a facilitar as discuss\u00f5es, ajudar a anotar e a organizar as informa\u00e7\u00f5es e at\u00e9 mesmo assumir o papel de facilitador em alguns pontos \u00e9 algo importante e necess\u00e1rio.<\/p>\n<h2>Crie e se apoie nas regras de ouro<\/h2>\n<p>Eu considero este como o ponto mais importante para um facilitador, as regras de ouro. S\u00e3o as regras b\u00e1sicas para todas as discuss\u00f5es que v\u00e3o ocorrer durante a <em>inception<\/em>. Crie elas antes da <em>inception<\/em> e apresente no primeiro dia e, durante as discuss\u00f5es, fa\u00e7a refer\u00eancia a elas para ajudar a conduzir a facilita\u00e7\u00e3o.<br \/>\nEssas regras podem ser coisas do tipo:<\/p>\n<ul>\n<li>N\u00e3o \u00e9 permitido acessar celulares e notebooks dentro da sala, mas fiquem a vontade para sair da sala e utilizar eles l\u00e1 fora, sem julgamentos.<\/li>\n<li>Estacionamento de ideias ~ <em>parking lot<\/em> &#8211; para tratar ideias que n\u00e3o fazem sentido naquele momento das discuss\u00f5es.<\/li>\n<li>Todas as opini\u00f5es devem ser escutadas e s\u00e3o bem vindas.<\/li>\n<li>Respeite os hor\u00e1rios.<\/li>\n<li>Fiquem atentas para as orienta\u00e7\u00f5es da pessoa facilitadora.<\/li>\n<\/ul>\n<p>Se apoie nelas para o sucesso na facilita\u00e7\u00e3o das discuss\u00f5es.<\/p>\n<h2>Cuidados com as dispers\u00f5es das conversas<\/h2>\n<p>V\u00e3o acontecer discuss\u00f5es e \u00e9 importante que as pessoas exponham seus pontos de vista. Deixe as discuss\u00f5es rolarem, pois elas v\u00e3o ser importantes, mas tome cuidado quando as pessoas come\u00e7arem a divagar ou sa\u00edrem do assunto em pauta. Tenha habilidade para saber quando cortar as conversas e para convergir o grupo. Caso o assunto abordado n\u00e3o seja importante para o momento, use e abuse do <em>parking lot <\/em>(estacionamento) de ideias!<br \/>\nAl\u00e9m disso, cuidado com conversas paralelas. Isso sempre atrapalha o grupo! E sempre monitore o tempo de cada din\u00e2mica para ajudar a otimizar o tempo e manter o grupo no foco das discuss\u00f5es.<\/p>\n<h2>Cuidado com \u00e0s pessoas que participam das reuni\u00f5es<\/h2>\n<p>Aqui eu tenho dois pontos. O primeiro \u00e9 em rela\u00e7\u00e3o a cobrir todas as especificidades do produto em rela\u00e7\u00e3o a escopo e o segundo \u00e9 em rela\u00e7\u00e3o a ter pessoas com poder de decis\u00e3o presentes nas etapas.<\/p>\n<p>Assim, em rela\u00e7\u00e3o ao primeiro ponto:<br \/>\n&#8211; Garanta que todas as \u00e1reas relevantes para o produto estejam presentes, como especialistas em finan\u00e7as, marketing, especialistas no consumidor, tecnologia, log\u00edstica, design, etc.<br \/>\n&#8211; Tome cuidado para n\u00e3o ter excesso de pessoas de uma \u00e1rea espec\u00edfica (se somente uma pessoa daquela \u00e1rea for suficiente, n\u00e3o chame mais pessoas). Vale lembrar tamb\u00e9m que determinadas pessoas possam participar em momentos espec\u00edficos e n\u00e3o necessariamente de todos os encontros e din\u00e2micas.<br \/>\n&#8211; Se uma \u00e1rea n\u00e3o for relevante, n\u00e3o chame!<br \/>\n&#8211; \u00c9 importante que todo o time de desenvolvimento do produto esteja presente para evitar desalinhamentos.<br \/>\n&#8211; Tente balancear a quantidade de pessoas na sala. Quem n\u00e3o precise participar, melhor deixar de fora.<\/p>\n<p>Em rela\u00e7\u00e3o ao segundo ponto, garanta que haja pessoas que tenham poder de decis\u00e3o participando das etapas ativamente. Caso isso n\u00e3o seja poss\u00edvel, garanta que essa pessoa passe essa responsabilidade de decidir para algu\u00e9m do grupo ou que essa pessoa fa\u00e7a alguns <em>check points<\/em> com o grupo para garantir o alinhamento. Isso \u00e9 sempre um risco para o processo, ent\u00e3o tome cuidado com esse ponto.<\/p>\n<h2>Cuide para que todos participem<\/h2>\n<p>Tem algumas pessoas que s\u00e3o mais importantes em algumas etapas, ent\u00e3o garanta que essas pessoas tenham voz em alguns momentos. Um exemplo disso \u00e9 quando o cliente final do sistema est\u00e1 descrevendo uma de suas dores. Deixe essa pessoa a vontade para levantar seus pontos e garanta que todos entenderam essa pessoa.<br \/>\nOutro ponto \u00e9 quando tem gestores no grupo. Algumas pessoas podem ficar intimidadas a falar na presen\u00e7a dos gestores, ent\u00e3o cuide para que essas pessoas se sintam a vontade para falar.<br \/>\nAl\u00e9m deste ponto, garanta que as discuss\u00f5es n\u00e3o fiquem centralizadas em apenas um grupo de pessoas e fa\u00e7a com que todos consigam dar sua opini\u00e3o.<\/p>\n<h2>Trabalhe melhor as ondas\/releases<\/h2>\n<p>O primeiro ponto aqui \u00e9 ter claro os objetivos que o grupo ir\u00e1 utilizar para realizar a quebra do <em>backlog<\/em> em ondas, <em>MVP e\/ou releases<\/em>. Tendo isso, as discuss\u00f5es ficam mais f\u00e1ceis.<\/p>\n<p>Por \u00faltimo, tenha em mente que voc\u00ea pode n\u00e3o precisa entregar tudo que est\u00e1 em uma onda ou release para liberar um conjunto de funcionalidades para o usu\u00e1rio, ou seja, \u00e9 poss\u00edvel quebrar as ondas em partes menores que j\u00e1 v\u00e3o poder ser utilizadas pelo usu\u00e1rio antes de completar tudo o que est\u00e1 em uma release. Isso aumenta sua velocidade em receber <em>feedbacks<\/em> sobre a solu\u00e7\u00e3o e ajuda a garantir que voc\u00ea est\u00e1 no caminho certo. Apenas tome cuidado para n\u00e3o frustrar os usu\u00e1rios com uma funcionalidade que n\u00e3o atendem totalmente as expectativas deles e tente alinhar isso com eles sempre que poss\u00edvel.<\/p>\n<p>E voc\u00ea? J\u00e1 rodou algum processo de <em>inception<\/em>? J\u00e1 levantou algum ponto importante<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Muito se fala sobre o processo de inception de um produto no mercado, muitas empresas tem implementado esse processo e ap\u00f3s ter a experi\u00eancia de ter participado da facilita\u00e7\u00e3o desse processo, resolvi escrever sobre alguns pontos de aten\u00e7\u00e3o que voc\u00ea deveria ter quando estiver se preparando para executar o processo. O que \u00e9 uma inception? &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2019\/05\/inception-os-cuidados-antes-de-rodar-este-processo\/\">\u00bb<\/a><\/p>\n","protected":false},"author":73,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9022"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/73"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9022"}],"version-history":[{"count":4,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9022\/revisions"}],"predecessor-version":[{"id":9027,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9022\/revisions\/9027"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9022"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9022"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9022"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}