{"id":6968,"date":"2017-11-10T15:47:25","date_gmt":"2017-11-10T17:47:25","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6968"},"modified":"2017-12-22T18:28:05","modified_gmt":"2017-12-22T20:28:05","slug":"alinhando-expectativas-de-prazo-com-o-reality-check","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2017\/11\/alinhando-expectativas-de-prazo-com-o-reality-check\/","title":{"rendered":"Alinhando expectativas de prazo com o Reality Check"},"content":{"rendered":"<p>Quando voc\u00eas ir\u00e3o finalizar a entrega do projeto? A equipe ir\u00e1 atender o prazo estipulado? Voc\u00eas conseguir\u00e3o entregar at\u00e9 a data? Se voc\u00ea trabalha com projetos, certamente ir\u00e1 perder a conta se tentar somar quantas vezes precisou responder a esses tipos de questionamento.<\/p>\n<p>Quando estamos lidando com prazos, famosos deadlines (n\u00e3o poderiam ser <em>successlines<\/em>?!), essas perguntas provavelmente ir\u00e3o surgir em v\u00e1rios momentos do projeto antes da entrega, e com certeza muitas outras vezes se o prazo inicial n\u00e3o for atendido. Independentemente do per\u00edodo em que esteja o projeto, voc\u00ea j\u00e1 pensou que muitos problemas relacionados com essas perguntas s\u00e3o causados por <strong>falta de alinhamento<\/strong> na expectativa da data de entrega?<\/p>\n<p>Aqui na <a href=\"http:\/\/www.plataformatec.com.br\">Ptec<\/a> estamos trabalhando com uma din\u00e2mica chamada Reality Check, ou verifica\u00e7\u00e3o de realidade. \u00c9 uma din\u00e2mica muito eficaz para quando h\u00e1 um prazo de entrega bem apertado. Meu amigo Lucas Colucci contou um pouco sobre como esta din\u00e2mica funciona em seu blogpost <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/02\/desenvolvendo-melhoria-continua-em-seu-processo-agil-a-cerimonia-de-reality-check\/\">Desenvolvendo melhoria cont\u00ednua em seu processo \u00e1gil: A cerim\u00f4nia de Reality Check<\/a>. N\u00f3s testamos esta din\u00e2mica e a <strong>evolu\u00edmos<\/strong> e, com isso, encontramos algumas novas pr\u00e1ticas que podem agregar valor para esta ferramenta. Nos exemplos que ser\u00e3o apresentados a seguir, os resultados foram muito positivos! Vamos conhecer?<\/p>\n<h2>Salvando o prazo do seu projeto!<\/h2>\n<p>Arrisco defender o seguinte: <strong>na maioria das vezes, \u00e9 mais relevante para o projeto deixar as expectativas de data de entrega bem alinhadas do que efetivamente cumprir um prazo inicialmente empurrado para a entrega do projeto<\/strong>. Defendo isso porque, no in\u00edcio do projeto, ou de alguma parte dele, dificilmente conseguimos prever uma data precisa de entrega, pois as diversas vari\u00e1veis que interferem nessa promessa de data influenciam demais no que efetivamente ir\u00e1 acontecer, como, por exemplo, aus\u00eancias diversas, feriados e as deliciosas emendas de sextas-feira, desmotiva\u00e7\u00e3o, problemas novos n\u00e3o existentes no in\u00edcio do planejamento, mudan\u00e7as de escopo n\u00e3o controladas, f\u00e9rias de colaboradores n\u00e3o programadas com anteced\u00eancia, entre tantas outras. Entretanto, todos esses pontos n\u00e3o significam que n\u00e3o podemos mostrar o que realmente est\u00e1 acontecendo. Prazo n\u00e3o deve ser uma restri\u00e7\u00e3o, mas sim uma meta!<\/p>\n<p>\u00c9 poss\u00edvel trabalhar a quest\u00e3o abordada de uma forma bem simples: deixe claro, de forma expl\u00edtica e <strong>antecipada<\/strong>, quando a entrega ir\u00e1 efetivamente ocorrer. Dessa forma, seu cliente sempre ter\u00e1 o controle da situa\u00e7\u00e3o, caso a equipe descubra antecipadamente que o prazo inicial n\u00e3o ser\u00e1 atingido.<\/p>\n<p>A ideia \u00e9 muito simples: <strong>mostrar a realidade do que est\u00e1 acontecendo no time, concedendo visibilidade quanto ao prazo!<\/strong> Apresentar a real situa\u00e7\u00e3o ajuda a deixar as expectativas de data de entrega muito bem alinhadas, e de forma antecipada. De quebra, em um formato colaborativo, o Reality Check tem a capacidade de empoderar a equipe sobre a apresenta\u00e7\u00e3o da data de entrega e, dessa forma, cria um v\u00ednculo de parceria e responsabilidade com seu cliente. A mensagem \u00e9 que somos um \u00fanico time, e estamos fazendo o melhor!<\/p>\n<h2>Explica como funciona?<\/h2>\n<p>Primeiramente, tenha o seguinte cen\u00e1rio: um escopo e um prazo. Bem simples, n\u00e3o? Segundo passo: obtenha o detalhe do escopo de alguma maneira. Isso pode ser feito via Story Mapping, decomposi\u00e7\u00e3o do escopo para obter os pacotes de trabalho de uma EAP (Estrutura Anal\u00edtica do Projeto), grupos de tarefas de um cronograma, etc. Enfim, tenha um conjunto de itens que, juntos, somam todo o escopo de sua entrega. \u00c9 importante tamb\u00e9m que esses itens sejam, mais ou menos, de &#8220;tamanhos&#8221; semelhantes ou de mesma natureza t\u00e9cnica, evitando misturar demandas muito grandes com as muito pequenas, por exemplo. No nosso caso, usamos hist\u00f3rias de usu\u00e1rio de um Backlog de produto, todas oriundas de um Story Mapping e, na medida do poss\u00edvel, j\u00e1 priorizadas no contexto da pr\u00f3xima entrega do projeto.<\/p>\n<p>Em seguida, escreva todos os seus itens de escopo em post-its (existe algo melhor do que esses papeizinhos que grudam?). Depois, em um quadro branco, por exemplo, ao lado direito de todos os seus itens de escopo, desenhe faixas verticais de per\u00edodos iguais que representam a evolu\u00e7\u00e3o temporal do projeto, ou, em outras palavras, fa\u00e7a v\u00e1rias faixas que mostrem cada semana at\u00e9 a data de entrega do projeto. A \u00faltima faixa poder\u00e1 corresponder \u00e0 data de entrega. N\u00e3o recomendo dividir esses per\u00edodos em dias ou meses, pois s\u00e3o dist\u00e2ncias curtas e longas demais, respectivamente. Depois, trace uma linha horizontal quase no topo do quadro e, em cada espa\u00e7o de faixas verticais, declare qual \u00e9 o respectivo per\u00edodo que aquele intervalo representa no projeto.<\/p>\n<p>Para facilitar, voc\u00ea poder\u00e1 fazer essa din\u00e2mica no primeiro dia de trabalho de uma semana. N\u00e3o recomendo que o Reality Check seja feito para um per\u00edodo muito longo. Entendo que, no m\u00e1ximo, um trimestre (entre 12 e 14 semanas) seja aceit\u00e1vel para que a din\u00e2mica funcione corretamente. Um per\u00edodo maior do que este far\u00e1 com que a equipe n\u00e3o consiga ter uma vis\u00e3o adequada e acabe estimando o trabalho futuro de uma forma muito relativa. <strong>Quanto mais distante, menos assertivo<\/strong>. Dessa forma:<\/p>\n<p><img decoding=\"async\" style=\"min-width: 100% !important; border: none;\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/11\/BlogPost-RealityCheck-Image1.png\" alt=\"Estrutura inicial do Reality Check\" \/><\/p>\n<p>Feito isso, re\u00fana o time, apresente o desenho e pe\u00e7a para a equipe mover os itens que est\u00e3o no Backlog para dentro das faixas semanais, declarando em qual semana cada item ir\u00e1 ser <strong>finalizado<\/strong>, e n\u00e3o quando come\u00e7am (faremos isso de outra maneira). Se o mesmo item for durar mais do que uma semana, n\u00e3o \u00e9 necess\u00e1rio duplica-lo, mas somente coloca-lo na semana de t\u00e9rmino. O objetivo \u00e9 distribuir todos os itens na linha do tempo, estimando o quanto de trabalho ser\u00e1 feito em cada semana e, principalmente, descobrindo se \u00e9 poss\u00edvel encaixar todo o esfor\u00e7o do projeto dentro do prazo solicitado pelo cliente. <strong>\u00c9 extremamente importante que a equipe tenha a autonomia de distribuir seus respectivos trabalhos no quadro<\/strong>, e que o gestor do produto \/ PO esteja presente durante essa parte da din\u00e2mica.<\/p>\n<p>A equipe n\u00e3o precisa buscar ser extremamente assertiva quanto a essa distribui\u00e7\u00e3o, mas sim tentar encontrar um volume de trabalho semanal que seja condizente com a realidade. \u00c9 interessante que, neste momento, a equipe perceber\u00e1 se ser\u00e1 possivel atingir o prazo do projeto e quais s\u00e3o as depend\u00eancias entre cada item do escopo. V\u00e1rios outros debates podem surgir e, de repente, voc\u00ea poder\u00e1 ter a primeira <strong>oportunidade de negociar o prazo do projeto ou, se este for inegoci\u00e1vel, tentar reduzir o escopo para que ele se encaixe dentro do per\u00edodo mostrado no Reality Check<\/strong>.<\/p>\n<p>Ao final, para finalizar essa primeira parte da din\u00e2mica, distribua um post-it para cada membro do time e, de forma individual, cada um (exceto o facilitador e o gestor do produto \/ PO) escrever\u00e1 um valor de 1 a 4, sendo a menor nota representando que a data de entrega n\u00e3o \u00e9 fact\u00edvel de ser atingida e, \u00e0 medida que a nota aumenta, o prazo \u00e9 plaus\u00edvel de ser atingido. Depois, o facilitador da din\u00e2mica calcula a m\u00e9dia dessas notas e apresenta para a equipe. Se a nota for 1 ou 2, \u00e9 interessante rever o planejamento colocado no Reality Check. Se for 3 ou 4, \u00e9 possivel entender que todos est\u00e3o confort\u00e1veis quanto ao prazo da entrega do projeto. Tamb\u00e9m \u00e9 v\u00e1lido conceder a oportunidade para quem colocou notas extremas (1 e 4) comentarem suas posi\u00e7\u00f5es, visto que essas pessoas podem estar enxergando pontos que os demais membros do time deixaram passar despercebidos. Algum plano de a\u00e7\u00e3o poder\u00e1 surgir neste momento, com o objetivo de melhorar alguma nota baixa, por exemplo.<\/p>\n<p>Na segunda semana, no primeiro dia de trabalho, todos se re\u00fanem novamente para atualizar o Reality Check. \u00c9 interessante que o cliente esteja presente nesses momentos de atualiza\u00e7\u00e3o do quadro. Agora, a equipe ir\u00e1 deixar os itens que foram conclu\u00eddos na semana anterior e, caso todos n\u00e3o tenham sido conclu\u00eddos, o time dever\u00e1 pensar como ir\u00e1 realocar os itens remanescentes na semana corrente e\/ou nas pr\u00f3ximas e, portanto, movendo algo que estava nessa semana para a pr\u00f3xima, e assim sucessivamente. Repetindo isto em todas as semanas, a equipe conseguir\u00e1 alocar os trabalhos do projeto nos per\u00edodos e, dependendo da situa\u00e7\u00e3o, visualizar\u00e1 que a entrega n\u00e3o conseguir\u00e1 ser desenvolvida at\u00e9 a data estipulada, ou que ser\u00e1 necess\u00e1rio a aloca\u00e7\u00e3o de mais pessoas para o projeto, ou reduzir o escopo, entre outros. Ou seja, <strong>o cliente ter\u00e1 visibilidade sobre o andamento do projeto e conseguir\u00e1 apoiar a equipe a encontrar op\u00e7\u00f5es vi\u00e1veis para solucionar a quest\u00e3o<\/strong>. A foto abaixo, tirada de um exemplo desta din\u00e2mica, reflete a situa\u00e7\u00e3o do projeto em uma sexta semana:<\/p>\n<p><img decoding=\"async\" style=\"min-width: 100% !important; border: none;\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/11\/BlogPost-RealityCheck-Image3.jpg\" alt=\"Exemplo do Reality Check em um projeto\" \/><\/p>\n<p>Para complementar a din\u00e2mica, a equipe poder\u00e1 adotar alguns mecanismos visuais para ajudar a interpretar cada item do Reality Check. Como sugest\u00e3o, colocamos:<\/p>\n<ul>\n<li>Um adesivo azul, no canto superior esquerdo do post-it, para mostrar quando aquele item (no nosso caso, hist\u00f3rias de usu\u00e1rio) estava em desenvolvimento;<\/li>\n<li>Um adesivo vermelho, no canto inferior esquerdo do post-it, para representar algum bloqueio naquela hist\u00f3ria de usu\u00e1rio (algo que esteja atrapalhando o andamento do desenvolvimento, ou algum impedimento que precisa ser removido);<\/li>\n<li>Um adesivo retangular, no canto superior direito do post-it, para declarar em qual semana aquela hist\u00f3ria de usu\u00e1rio tinha come\u00e7ado a ser desenvolvida (somente para quando a semana de in\u00edcio n\u00e3o era a mesma de t\u00e9rmino da hist\u00f3ria);<\/li>\n<li>Um post-it amarelo menor, no canto inferior direito do post-it principal, que representava alguma pend\u00eancia daquela hist\u00f3ria (com um pequeno texto explicativo).<\/li>\n<\/ul>\n<p>Al\u00e9m disso, quando havia depend\u00eancias entre os itens, como, por exemplo, a hist\u00f3ria de usu\u00e1rio B somente poder\u00e1 come\u00e7ar ap\u00f3s o t\u00e9rmino da hist\u00f3ria A, a equipe desenhava uma seta de liga\u00e7\u00e3o, a fim de representar esta depend\u00eancia. Post-its de cores diferentes tamb\u00e9m podem ser utilizados para que haja uma identifica\u00e7\u00e3o de tema, como, no nosso exemplo, uma cor para representar hist\u00f3rias de desenvolvimento de c\u00f3digo e uma outra cor para demandas relacionadas com layout. O &#8220;tamanho&#8221; de cada item tamb\u00e9m poder\u00e1 ser declarado, evitando que a equipe planeje desenvolver demandas muito grandes na mesma semana, por exemplo. Para ajudar no entendimento de tudo isso, crie uma legenda ao lado do quadro, semelhante a esta foto:<\/p>\n<p><img decoding=\"async\" style=\"min-width: 100% !important; border: none;\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/11\/BlogPost-RealityCheck-Image2.png\" alt=\"Exemplo de legenda do Reality Check\" \/><\/p>\n<p>Portanto, a din\u00e2mica de Reality Check tem o potencial de agregar valor de gest\u00e3o para toda a equipe, minimizando problemas de alinhamento quanto \u00e0s expectativas de entrega dentro de determinado prazo, bem como mostrando como est\u00e1 a realidade do desenvolvimento do projeto.<\/p>\n<h2>Dicas extras<\/h2>\n<p>Algumas pr\u00e1ticas podem facilitar a utiliza\u00e7\u00e3o dessa din\u00e2mica:<\/p>\n<ul>\n<li>O facilitador do projeto pode manter o quadro atualizado durante a semana. Depois, no in\u00edcio da pr\u00f3xima, o time poder\u00e1 focar em distribuir os post-its. Para isso, sempre tenha por perto todos os utens\u00edlios necess\u00e1rios (adesivos, caneta de quadro, etc.);<\/li>\n<li>O facilitador precisa apoiar o time em momentos de debates quanto a prazos, pois \u00e9 normal que o cliente queira a entrega dentro do prazo inicial. Logo, conversas sobre horas extras, por exemplo, podem surgir, caso a equipe n\u00e3o consiga encaixar todo o escopo dentro do prazo. Cabe \u00e0 equipe decidir se vale a pena esse esfor\u00e7o adicional, pois, talvez, \u00e9 melhor tentar negociar um novo prazo, ou mesmo &#8220;quebrar&#8221; partes do escopo e encaixar o que for poss\u00edvel dentro da data desejada;<\/li>\n<li>Evite identificar a pessoa que est\u00e1 desenvolvendo cada item do escopo. O Reality Check n\u00e3o pode se transformar em uma ferramenta de cobran\u00e7a, ou mesmo que exponha algo irrelevante para o projeto\/time. O quadro, o progresso e as decis\u00f5es s\u00e3o do time, e n\u00e3o de atores individuais;<\/li>\n<li>Tenha outras ferramentas para a gest\u00e3o do projeto. O Reality Check \u00e9 um item adicional e funciona muito bem quando sincronizado com um quadro Kanban, por exemplo. Ele tamb\u00e9m poder\u00e1 agregar valor quando seu projeto ainda n\u00e3o possuir dados hist\u00f3ricos para a utiliza\u00e7\u00e3o de m\u00e9tricas, sendo uma potencial ferramenta para conceder, no in\u00edcio do projeto, previsibilidade sem dados;<\/li>\n<li>O Reality Check n\u00e3o precisa ser utilizado em todas as entregas do projeto. Talvez ele seja naturalmente demandado quando o contexto do projeto (um prazo apertado, por exemplo) justificar sua utiliza\u00e7\u00e3o, ou mesmo quando os membros da equipe encontrarem alguma motiva\u00e7\u00e3o;<\/li>\n<li>Se voc\u00ea estiver trabalhando com Scrum, o Reality Check poder\u00e1 ajudar o time durante a Daily. O pr\u00f3prio time poder\u00e1 identificar essa oportunidade.<\/li>\n<\/ul>\n<p>E voc\u00ea, gostou dessa din\u00e2mica? Fique \u00e0 vontade para comentar, feedbacks e opini\u00f5es s\u00e3o sempre bem-vindos!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Quando voc\u00eas ir\u00e3o finalizar a entrega do projeto? A equipe ir\u00e1 atender o prazo estipulado? Voc\u00eas conseguir\u00e3o entregar at\u00e9 a data? Se voc\u00ea trabalha com projetos, certamente ir\u00e1 perder a conta se tentar somar quantas vezes precisou responder a esses tipos de questionamento. Quando estamos lidando com prazos, famosos deadlines (n\u00e3o poderiam ser successlines?!), essas &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2017\/11\/alinhando-expectativas-de-prazo-com-o-reality-check\/\">\u00bb<\/a><\/p>\n","protected":false},"author":61,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,262,257],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6968"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6968"}],"version-history":[{"count":22,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6968\/revisions"}],"predecessor-version":[{"id":7051,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6968\/revisions\/7051"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6968"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6968"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6968"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}