{"id":6623,"date":"2017-08-28T13:06:41","date_gmt":"2017-08-28T16:06:41","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6623"},"modified":"2017-10-13T22:56:11","modified_gmt":"2017-10-14T01:56:11","slug":"metricas-ageis-throughput-e-graficos-burnup","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-throughput-e-graficos-burnup\/","title":{"rendered":"M\u00e9tricas \u00c1geis: Throughput e gr\u00e1fico de Burnup"},"content":{"rendered":"<p>Desde que comecei a trabalhar com projetos de desenvolvimento de software, tenho lidado com dois aspectos importantes, mas nem sempre convergentes: <strong>escopo<\/strong> e <strong>prazo<\/strong>. O processo de alinhamento das expectativas quanto ao <strong>progresso das entregas<\/strong> e a <strong>capacidade de produ\u00e7\u00e3o das equipes<\/strong> \u00e9 \u00e1rduo, mas quando acontece <strong>aumentam as chances de sucesso do projeto<\/strong>.<\/p>\n<p>Neste post, vou apresentar como usamos os gr\u00e1ficos de <strong><em>Throughput<\/em><\/strong> e <strong><em>Burnup<\/em><\/strong> na Plataformatec, durante o ciclo de vida de um projeto.<\/p>\n<h2>Aprendendo a partir do Throughput<\/h2>\n<p>A <a href=\"https:\/\/leankit.com\/learn\/kanban\/lean-flow-metrics\/\">LeanKit<\/a> define <em>Throughput<\/em> como o n\u00famero m\u00e9dio de unidades processadas por unidade de tempo. No fluxo de desenvolvimento de uma equipe, os exemplos podem ser &#8220;cart\u00f5es por dia&#8221;, &#8220;cart\u00f5es por semana&#8221; ou &#8220;cart\u00f5es por m\u00eas&#8221;.<\/p>\n<p>Uma observa\u00e7\u00e3o importante a respeito o <em>Throughput<\/em> \u00e9 que a m\u00e9trica difere do &#8220;<em>Velocity<\/em>&#8221; (quantidade de <em>story points<\/em> entregue por itera\u00e7\u00e3o ou <em>sprint<\/em>) utilizado no Scrum.<\/p>\n<p>Na Plataformatec, consideramos <em>Throughput<\/em> como o n\u00famero de itens (por exemplo, hist\u00f3ria do usu\u00e1rio) entregues por semana.<\/p>\n<p>Geralmente, analisamos o <em>Throughput<\/em> para responder quest\u00f5es como:<\/p>\n<ul>\n<li>Quantos itens de trabalho a equipe entrega por semana?<\/li>\n<li>O time est\u00e1 criando uma tend\u00eancia crescente de entrega?<\/li>\n<li>Algum fator tem bloqueado a capacidade de entrega da equipe?<\/li>\n<\/ul>\n<p>Vamos ver um exemplo pr\u00e1tico. Imagine uma situa\u00e7\u00e3o que voc\u00ea, como Gerente de Desenvolvimento, precisa ajudar o time a explorar o <em>Throughput<\/em> passado a fim de gerar melhorias futuras.<\/p>\n<p><img decoding=\"async\" style=\"border: none; max-width: 100%;\" src=\"http:\/\/plataformatec-lore-upload.s3.amazonaws.com\/original\/1X\/6e793268c190628c034493ce4a76c15e6a911345.png\" alt=\"Throughput Series\" \/><\/p>\n<p>Primeiramente, podemos observar no gr\u00e1fico acima que somente em 15% das semanas (4 de 27) a quantidade de itens entregues foi zero (0).<\/p>\n<p>Al\u00e9m disso, \u00e9 poss\u00edvel extrair mais informa\u00e7\u00f5es do gr\u00e1fico de tend\u00eancia. Caso o <em>Throughput<\/em> esteja em crescente, a equipe est\u00e1 aumentando o n\u00famero de itens entregues em uma semana. Se a tend\u00eancia \u00e9 de queda, pode colocar em risco o prazo de entrega de um projeto. Um limite inferior pode ser estipulado como forma de fornecer um indicador de quando a\u00e7\u00f5es corretivas podem ser necess\u00e1rias. Nesta equipe, o <em>Throughput<\/em> aumenta nas primeiras semanas, seguida de uma ligeira queda e, finalmente, estabiliza-se.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" style=\"border: none; max-width: 100%;\" src=\"http:\/\/plataformatec-lore-upload.s3.amazonaws.com\/original\/1X\/199de84644dc8d5f1b174befcd69d6cb1fc61c6e.png\" alt=\"Throughput Histogram\" width=\"1606\" height=\"670\" \/><\/p>\n<p>Olhando para a distribui\u00e7\u00e3o de <em>Throughput<\/em> da equipe temos uma situa\u00e7\u00e3o em que a m\u00e9dia (linha verde), a moda (linha laranja) e a mediana (linha laranja) possuem quase o mesmo valor (aproximadamente dois). Portanto, \u00e9 razo\u00e1vel dizer que o time, em geral, entrega dois itens por semana.<\/p>\n<p>Outra forma de validar o argumento sobre a capacidade de entrega da equipe \u00e9 buscar o percentil 80 (linha cinza). Ele nos diz que apenas em 20% das semanas, a equipe conseguiu entregar mais de tr\u00eas itens por semana.<\/p>\n<p>Uma boa pr\u00e1tica que definimos para os projetos na Plataformatec \u00e9 uma verifica\u00e7\u00e3o semanal do <em>Throughput<\/em>, como um processo de compreens\u00e3o das causas que afetam o ritmo de entrega. Geralmente, o <em>Throughput<\/em> de uma equipe cai pelos seguintes motivos:<\/p>\n<ul>\n<li><strong>Requisitos ruins<\/strong> &#8212; exemplo, baixa qualidade nos crit\u00e9rios de aceite de hist\u00f3rias de usu\u00e1rio;<\/li>\n<li><strong>D\u00edvidas t\u00e9cnicas<\/strong> &#8212; exemplo, necessidade de refatora\u00e7\u00f5es inesperadas;<\/li>\n<li><strong>Gargalos do processo<\/strong> &#8212; exemplos, especialista de testes sobrecarregado, pipeline de implanta\u00e7\u00e3o falho;<\/li>\n<li><strong>Backlog com baixo n\u00edvel de itens prontos para desenvolvimento<\/strong>;<\/li>\n<li><strong>Mudan\u00e7a de escopo<\/strong> &#8212; por exemplo, aumento no escopo de uma hist\u00f3ria de usu\u00e1rio.<\/li>\n<\/ul>\n<h2>Olhando para o gr\u00e1fico de Burnup<\/h2>\n<p>O gr\u00e1fico de <em>Burnup<\/em> \u00e9 uma ferramenta valiosa para gerenciamento do escopo. Ele apresenta a quantidade de trabalho entregue por uma equipe e, fornece mais informa\u00e7\u00f5es do que o <em>Burndown<\/em>, pois <strong>combina escopo e total de entrega na mesma visualiza\u00e7\u00e3o<\/strong>.<\/p>\n<p>\u00c9 comum ver gr\u00e1ficos de <em>Burnup<\/em> com linha de tend\u00eancia para estimar o prazo de entrega do escopo que est\u00e1 sendo analisado.<\/p>\n<p>Tenho visto Product Owners e Agile Coaches projetando cen\u00e1rios baseados em tr\u00eas perspectivas:<\/p>\n<ul>\n<li><strong>Pior caso:<\/strong> projetar a performance futura da equipe com base no menor <em>Throughput<\/em> hist\u00f3rico.<\/li>\n<li><strong>Melhor caso:<\/strong> considerar que a equipe atuar\u00e1 no futuro com base no maior <em>Throughput<\/em> hist\u00f3rico.<\/li>\n<li><strong>Caso mais prov\u00e1vel:<\/strong> considerar que a equipe ter\u00e1 no futuro um comportamento semelhante ao <em>Throughput<\/em> &#8220;m\u00e9dio&#8221; (recomendo a leitura do post que escrevi sobre o motivo pelo qual voc\u00ea deve <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/01\/power-of-the-metrics-dont-use-average-to-forecast-deadlines\/\">ter cuidado ao usar a m\u00e9dia como medida<\/a>).<\/li>\n<\/ul>\n<p>Em nosso contexto, o gr\u00e1fico de Burnup est\u00e1 nos ajudando a responder perguntas como:<\/p>\n<ul>\n<li>O escopo do projeto est\u00e1 crescendo de forma saud\u00e1vel?<\/li>\n<li>Quando a equipe terminar\u00e1 o escopo atual do projeto?<\/li>\n<\/ul>\n<p>O exemplo abaixo aconteceu com um cliente da Plataformatec e as circunst\u00e2ncias eram as seguintes:<\/p>\n<ul>\n<li><strong>Dura\u00e7\u00e3o do projeto:<\/strong> 23 semanas (quase seis meses).<\/li>\n<li><strong>Expectativa do cliente:<\/strong> ter uma solu\u00e7\u00e3o para resolver um problema de processo interno (projeto do zero, sem c\u00f3digo legado).<\/li>\n<li><strong>Roadmap do produto:<\/strong> ap\u00f3s a sess\u00e3o inicial de <em>story mapping<\/em>, a equipe e o cliente reduziram o escopo da entrega.<\/li>\n<li><strong>Desafio do projeto:<\/strong> assegurar que o software estivesse dispon\u00edvel para uso na data acordada.<\/li>\n<\/ul>\n<p>Neste projeto, usamos o gr\u00e1fico de <em>Burnup<\/em> como ferramenta para comunicar o progresso do projeto. O gr\u00e1fico foi desenvolvido para exibir:<\/p>\n<ul>\n<li>O n\u00famero de itens de trabalho planejado para a entrega (escopo);<\/li>\n<li>O n\u00famero de itens entregues;<\/li>\n<li>Cen\u00e1rios para poss\u00edveis datas de entrega do projeto.<\/li>\n<\/ul>\n<p>Os pr\u00f3ximos tr\u00eas gr\u00e1ficos representam o projeto no in\u00edcio (primeiras seis semanas), no meio (doze semanas) e no fim (semana 23).<\/p>\n<p><img decoding=\"async\" style=\"border: none; max-width: 100%;\" src=\"http:\/\/plataformatec-lore-upload.s3.amazonaws.com\/original\/1X\/f0285ceca71f7e7e338f864ca18bd8869b514027.png\" alt=\"Backlog x Entregas\" \/><\/p>\n<p><img decoding=\"async\" style=\"border: none; max-width: 100%;\" src=\"http:\/\/plataformatec-lore-upload.s3.amazonaws.com\/original\/1X\/2bf010e470364b940be7223cbbaa6353b17c1727.png\" alt=\"Backlog x Entregas\" \/><\/p>\n<p><img decoding=\"async\" style=\"border: none; max-width: 100%;\" src=\"http:\/\/plataformatec-lore-upload.s3.amazonaws.com\/original\/1X\/d5447f4c1dec7f80d5ebad417e22018298934e5f.png\" alt=\"Backlog x Entregas\" \/><\/p>\n<p>Analisando o in\u00edcio do projeto, tivemos um cen\u00e1rio de aumento do escopo e algumas entregas.<\/p>\n<p>Em rela\u00e7\u00e3o ao escopo, o aumento aconteceu devido ao refinamento de um conjunto de hist\u00f3rias de usu\u00e1rio criadas ap\u00f3s o <em>story mapping<\/em>.<\/p>\n<p>Um indicador \u00fatil para analisar o crescimento do backlog \u00e9 calcular a taxa de aumento semanal de novas hist\u00f3rias de usu\u00e1rios (no exemplo, sete hist\u00f3rias de usu\u00e1rio foram criadas por semana no in\u00edcio do projeto). Aqui na Plataformac, usamos esse indicador como ferramenta para manter o aumento do escopo previs\u00edvel.<\/p>\n<p>No meio do projeto, houve crescimento cont\u00ednuo do escopo (seis novas hist\u00f3rias de usu\u00e1rio criadas por semana). Neste momento, tivemos que sentar com o cliente para alinharmos formas de simplificar o escopo, porque, caso o mesmo continuasse a crescer, dificilmente entregar\u00edamos uma vers\u00e3o do software no final do contrato. O gr\u00e1fico de <em>Burnup<\/em> foi \u00fatil para definir estrat\u00e9gias para melhorar o <em>Throughput<\/em> com base nos resultados das entregas realizadas.<\/p>\n<p>A t\u00e9cnica de proje\u00e7\u00e3o utilizada foi importante para chegar ao final do projeto entregando todas as funcionalidades necess\u00e1rias para o software.<\/p>\n<p>Na conclus\u00e3o do projeto, realizamos uma sess\u00e3o de li\u00e7\u00f5es aprendidas e a equipe destacou que o gr\u00e1fico de <em>Burnup<\/em> foi \u00fatil, pois:<\/p>\n<ul>\n<li>trouxemos visibilidade ao processo do desenvolvimento garantindo que o cliente estava alinhado com o progresso e o prazo de entrega;<\/li>\n<li>mostramos visualmente como o aumento do escopo influencia o prazo de entrega, sendo assim, uma boa ferramenta de negocia\u00e7\u00e3o.<\/li>\n<\/ul>\n<h2>Conclus\u00e3o<\/h2>\n<p>Monitorar o <em>Throughput<\/em> significa melhorias do processo com base em dados, que exp\u00f5e o que est\u00e1 sendo feito com transpar\u00eancia \u00e0 todos envolvidos no projeto.<\/p>\n<p>O gr\u00e1fico de <em>Burnup<\/em> \u00e9 uma ferramenta poderosa de comunica\u00e7\u00e3o que pode ser usada para negociar com stakeholders, visto que, revela como mudan\u00e7as de escopo afetam o prazo de entrega desejado, ao mesmo tempo que informa o progresso real.<\/p>\n<p>Se voc\u00ea busca material avan\u00e7ado em m\u00e9tricas, recomendo o livro <em><a href=\"https:\/\/www.casadocodigo.com.br\/products\/livro-metricas-ageis\">M\u00e9tricas \u00c1geis &#8211; Obtenha melhores resultados em sua equipe<\/a><\/em>. &#8212; Tudo bem, \u00e9 um jab\u00e1! Eu sou o autor do livro, mas acredite, minha recomenda\u00e7\u00e3o \u00e9 genu\u00edna. \ud83d\ude09<\/p>\n<div style=\"background-color: #fffdf9; border: 1px solid #e9af35; border-radius: 6px; margin: 32px 0; padding: 22px 24px; font-family: sans-serif;\">\n<h3 style=\"font-size: 1.4em; line-height: 1.3em; margin-top: 0 !important;\">Cont\u00c1gil Newsletter<\/h3>\n<p style=\"margin-top: 0.5em !important;\">Newsletter mensal <strong>gratuita<\/strong>, criada para ajudar voc\u00ea a se manter atualizado sobre o que est\u00e1 acontecendo na \u00e1rea de gerenciamento de projetos, metodologias e cultura \u00e1gil.<\/p>\n<p><a style=\"background: #e9af35; border: none; border-radius: 3px; color: #fff; display: inline-block; font-size: 12px; line-height: 1.5; margin-top: 5px; padding: 8px 16px; text-align: center; text-decoration: none; letter-spacing: 0.1em;\" href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=contagil-subscription&amp;utm_content=cta-blog-post-bottom\" target=\"_blank\" rel=\"noopener\">ASSINAR NEWSLETTER GR\u00c1TIS<\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Desde que comecei a trabalhar com projetos de desenvolvimento de software, tenho lidado com dois aspectos importantes, mas nem sempre convergentes: escopo e prazo. O processo de alinhamento das expectativas quanto ao progresso das entregas e a capacidade de produ\u00e7\u00e3o das equipes \u00e9 \u00e1rduo, mas quando acontece aumentam as chances de sucesso do projeto. Neste &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-throughput-e-graficos-burnup\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,254,257,263,243],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6623"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6623"}],"version-history":[{"count":15,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6623\/revisions"}],"predecessor-version":[{"id":7204,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6623\/revisions\/7204"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6623"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6623"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6623"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}