{"id":8850,"date":"2019-03-18T13:23:37","date_gmt":"2019-03-18T16:23:37","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=8850"},"modified":"2019-03-18T14:35:10","modified_gmt":"2019-03-18T17:35:10","slug":"como-voce-reage-sob-pressao-fica-em-negacao-ou-encara-a-realidade","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/03\/como-voce-reage-sob-pressao-fica-em-negacao-ou-encara-a-realidade\/","title":{"rendered":"Como voc\u00ea reage sob press\u00e3o: fica em nega\u00e7\u00e3o ou encara a realidade?"},"content":{"rendered":"\n<p>Um desafio comum para a maioria das empresas \u00e9 cumprir com prazos e datas de lan\u00e7amentos de seus produtos. Nas empresas com produtos digitais isso n\u00e3o \u00e9 diferente. Pelo contr\u00e1rio, \u00e9 uma situa\u00e7\u00e3o muito corriqueira.<br><\/p>\n\n\n\n<p>Nestes 10 anos como consultor, eu tive a oportunidade de testemunhar muitas equipes e respectivas lideran\u00e7as lidando com situa\u00e7\u00f5es de prazos desafiadores. Eu notei que, quando a equipe demonstrava os primeiros sinais de que o escopo e prazo estavam incompat\u00edveis, estas lideran\u00e7as adotavam um destes tipos de comportamento. Seguem abaixo:<br><\/p>\n\n\n\n<p><strong>O tipo de comportamento 01 &#8211; &#8220;estado de nega\u00e7\u00e3o&#8221;:<\/strong> a lideran\u00e7a foca 100% no escopo (features, user stories, etc.) e entra num estado emocional de nega\u00e7\u00e3o da realidade e come\u00e7a falar para a equipe coisas como &#8220;<em>Voc\u00ea s\u00f3 enxerga problemas! Voc\u00ea precisa ter uma atitude mais positiva&#8221;, &#8220;N\u00e3o podemos dar este not\u00edcia para os diretores, temos que dar um jeito.&#8221;, &#8220;Voc\u00ea n\u00e3o est\u00e1 demonstrando comprometimento.&#8221;, &#8220;N\u00e3o me traga problemas, traga solu\u00e7\u00f5es.&#8221;, &#8220;Vamos trabalhar at\u00e9 mais tarde e no final de semana at\u00e9 a entrega.&#8221;<\/em> o problema \u00e9 que esta pessoa n\u00e3o percebe que est\u00e1 se afundando numa armadilha. De maneira inconsciente, esta pessoa est\u00e1 se recusando a lidar com a realidade e adaptar o seu plano. Tamb\u00e9m notei que \u00e9 muito comum este tipo de &#8220;lideran\u00e7a&#8221; reclamar que a equipe tem um desempenho ruim mas n\u00e3o faz nada al\u00e9m de reclamar e repetir frases que n\u00e3o melhoram a situa\u00e7\u00e3o. Fica claro que a pessoa est\u00e1 fugindo da responsabilidade dos resultados. Note que este tipo de comportamento \u00e9 muito improdutivo, pois n\u00e3o corrige a rota do projeto e destr\u00f3i o moral da equipe.<br><strong>Obs.:<\/strong> se voc\u00ea nunca viu uma lideran\u00e7a comportar-se assim, assista ao <a href=\"https:\/\/www.youtube.com\/watch?v=fYtJ2W5y8vQ\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"document\u00e1rio FYRE Festival  (opens in a new tab)\">document\u00e1rio <\/a><em><a href=\"https:\/\/www.youtube.com\/watch?v=fYtJ2W5y8vQ\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"document\u00e1rio FYRE Festival  (opens in a new tab)\">FYRE Festival <\/a><\/em>e surpreenda-se!<\/p>\n\n\n\n<p><strong>O tipo de comportamento 02 &#8211; &#8220;l\u00edder que encara a realidade e pensa em alternativas&#8221;:<\/strong> este tipo de lideran\u00e7a sensibiliza-se imediatamente quando a equipe sinaliza que existe um risco do prazo n\u00e3o ser cumprido. Frases comuns deste tipo de lideran\u00e7a s\u00e3o: &#8220;<em>Ainda bem que voc\u00eas identificaram este risco agora, pois ainda temos tempo para encontrar uma alternativa.<\/em>&#8221; , &#8220;<em>Quais s\u00e3o as nossas op\u00e7\u00f5es? Qual seria a data poss\u00edvel para entrega do escopo total? O que \u00e9 poss\u00edvel entregar at\u00e9 o prazo? Com essas informa\u00e7\u00f5es ser\u00e1 poss\u00edvel negociar com a diretoria um novo plano.<\/em>&#8220;, &#8220;<em>Considerando que o objetivo de neg\u00f3cios \u00e9 melhorar a m\u00e9trica X, qual \u00e9 o escopo m\u00ednimo necess\u00e1rio?<\/em>&#8220;. Ou seja, este tipo de l\u00edder tem um comportamento que aceita a realidade e come\u00e7a a atuar em alternativas vi\u00e1veis, ao inv\u00e9s de ficar estressando a equipe e negando-se \u00e0 adaptar o plano original. \u00c9 poss\u00edvel notar que, este \u00e9 o tipo de lideran\u00e7a que costuma gerar mais resultados para as empresas e tamb\u00e9m \u00e9 reconhecida como uma lideran\u00e7a leg\u00edtima pela respectiva equipe.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>E voc\u00ea, qual \u00e9 o tipo de comportamento que voc\u00ea demonstra quando est\u00e1 sob press\u00e3o de prazos? <br><\/p>\n\n\n\n<p>Tome cuidado para n\u00e3o cair no estado de nega\u00e7\u00e3o, \u00e9 muito f\u00e1cil deixar isso acontecer. Tenha consci\u00eancia do seu comportamento e fuja do mundo da fantasia. Encare a realidade, desenhe os cen\u00e1rios e negocie alternativas. Somente assim voc\u00ea conseguir\u00e1 liderar uma equipe de maneira efetiva e gerar resultados.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Um desafio comum para a maioria das empresas \u00e9 cumprir com prazos e datas de lan\u00e7amentos de seus produtos. Nas empresas com produtos digitais isso n\u00e3o \u00e9 diferente. Pelo contr\u00e1rio, \u00e9 uma situa\u00e7\u00e3o muito corriqueira. Nestes 10 anos como consultor, eu tive a oportunidade de testemunhar muitas equipes e respectivas lideran\u00e7as lidando com situa\u00e7\u00f5es de &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/03\/como-voce-reage-sob-pressao-fica-em-negacao-ou-encara-a-realidade\/\">\u00bb<\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8850"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=8850"}],"version-history":[{"count":12,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8850\/revisions"}],"predecessor-version":[{"id":8867,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8850\/revisions\/8867"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=8850"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=8850"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=8850"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}