{"id":7176,"date":"2018-02-07T13:11:49","date_gmt":"2018-02-07T15:11:49","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7176"},"modified":"2018-02-07T20:32:39","modified_gmt":"2018-02-07T22:32:39","slug":"pare-de-chamar-product-owners-e-product-managers-de-mini-ceos","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/02\/pare-de-chamar-product-owners-e-product-managers-de-mini-ceos\/","title":{"rendered":"Pare de chamar Product Owners e Product Managers de mini CEOs"},"content":{"rendered":"<p>O que esperar de uma pessoa que atua com produto? No blog post de hoje, gostaria de discutir um pouco sobre o assunto sem apresentar uma receita pronta de\u00a0<em>job description<\/em>\u00a0do papel, mas sim debater a respeito de uma fun\u00e7\u00e3o que parece estar sofrendo por lidar com expectativas que por vezes s\u00e3o exageradas.<\/p>\n<p>Tive a sutileza de usar o termo &#8220;pessoa de produto&#8221; para fugir de nomenclaturas como Product Owner, Product Manager, Product Success Manager etc. Minha motiva\u00e7\u00e3o para escrever o texto veio de uma frase que escutei recentemente e que dizia o seguinte: &#8220;aqui na empresa, as pessoas de produto s\u00e3o como mini CEOs&#8221;. Ser\u00e1 que o fato de a pessoa lidar com m\u00faltiplas disciplinas (neg\u00f3cio, tecnologia, pessoas, experi\u00eancia do usu\u00e1rio etc.) ela est\u00e1 habilitada a estar no patamar de ser a CEO de um produto?<\/p>\n<p>Dando uma resposta simplista, minha opini\u00e3o \u00e9 n\u00e3o. O cargo que est\u00e1 mais pr\u00f3ximo do CEO \u00e9 o de\u00a0<a href=\"https:\/\/www.aha.io\/roadmapping\/guide\/product-management\" rel=\"nofollow\">CPO (Chief of Product Officer)<\/a>, o qual se reporta diretamente a ele e \u00e9 respons\u00e1vel por todas as atividades do produto dentro da organiza\u00e7\u00e3o. Tais pessoas atuam na defini\u00e7\u00e3o da estrat\u00e9gia global do produto projetada para alcan\u00e7ar os objetivos estabelecidos pelo CEO e os membros do conselho.<\/p>\n<h2><a id=\"user-content-o-que-faz-uma-pessoa-de-produto\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-product-ceo.md#o-que-faz-uma-pessoa-de-produto\"><\/a>O que faz uma pessoa de produto?<\/h2>\n<p>O que uma empresa deve esperar de uma pessoa de produto \u00e9 algu\u00e9m conectado com os est\u00edmulos do mercado, atento ao feedback dos usu\u00e1rios e clientes, preocupado com o prop\u00f3sito do produto, respons\u00e1vel pela prioriza\u00e7\u00e3o e especifica\u00e7\u00e3o do trabalho que \u00e9 empregado pelas equipes de tecnologia, bem como pelo desenvolvimento, comunica\u00e7\u00e3o e execu\u00e7\u00e3o da vis\u00e3o e estrat\u00e9gia do produto.<\/p>\n<p>Al\u00e9m disso, a pessoa deve saber justificar a rela\u00e7\u00e3o entre a solu\u00e7\u00e3o tecnol\u00f3gica proposta e as m\u00e9tricas de neg\u00f3cio (ex: aumento de receita, diminui\u00e7\u00e3o do churn, aumento do ticket m\u00e9dio, diversifica\u00e7\u00e3o do portf\u00f3lio de produtos etc.) e garantir o melhor atendimento ao cliente.<\/p>\n<p>Ocasionalmente, a pessoa de produto ter\u00e1 de contar com o apoio das \u00e1reas de marketing e de neg\u00f3cios com o objetivo de realizar as atividades necess\u00e1rias para o sucesso do produto.<\/p>\n<p>Em resumo: \u00e9 uma pessoa articulada dentro da organiza\u00e7\u00e3o que compreende o que acontece fora dela (ex: desejo e necessidades dos clientes, posicionamento dos concorrentes, ambi\u00e7\u00f5es dos investidores etc.), focada em gerar bons entreg\u00e1veis e organizar a fila de trabalho das equipes para que elas desenvolvam produtos que apoiar\u00e3o a estrat\u00e9gia da empresa.<\/p>\n<p>Cabe ressaltar que h\u00e1 v\u00e1rios n\u00edveis de pessoas de produto, com responsabilidades muitas vezes diferentes e, frequentemente, compartilhadas. Por exemplo, nada impede a exist\u00eancia de um Product Owner e um Product Manager no mesmo contexto, pois, cada pessoa atuar\u00e1 em n\u00edveis diferentes da cadeia de valor do produto e com granularidades diferentes das iniciativas.<\/p>\n<h2><a id=\"user-content-o-que-faz-um-ceo\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-product-ceo.md#o-que-faz-um-ceo\"><\/a>O que faz um CEO?<\/h2>\n<p>Retomando a provoca\u00e7\u00e3o colocada no in\u00edcio do texto, volto a questionar: qual a semelhan\u00e7a entre a descri\u00e7\u00e3o que fiz de uma pessoa de produto e o trabalho de um CEO? Bem, antes vale a pena compartilhar o que \u00e9 a fun\u00e7\u00e3o de um CEO dentro de uma organiza\u00e7\u00e3o.<\/p>\n<p>Segundo uma defini\u00e7\u00e3o do\u00a0<a href=\"https:\/\/www.investopedia.com\/terms\/c\/ceo.asp\" rel=\"nofollow\">Investopedia<\/a>, o CEO \u00e9 o executivo de mais alto escal\u00e3o em uma empresa e suas principais responsabilidades incluem: tomar decis\u00f5es corporativas importantes; gerenciar as opera\u00e7\u00f5es e recursos gerais de uma empresa; e atuar como o principal ponto de comunica\u00e7\u00e3o entre o conselho de administra\u00e7\u00e3o e as opera\u00e7\u00f5es corporativas.<\/p>\n<p>Na minha opini\u00e3o, o CEO de uma empresa \u00e9 a pessoa que:<\/p>\n<ul>\n<li><strong>Desenha e direciona a estrat\u00e9gia da empresa:<\/strong>\u00a0a equipe pode ter autonomia em ajudar no planejamento da estrat\u00e9gia, os investidores podem aprovar o plano de neg\u00f3cio e o conselho pode pedir algum tipo de revis\u00e3o em um plano de neg\u00f3cio, por\u00e9m, a pessoa que ter\u00e1 completa autonomia e responsabilidade pela execu\u00e7\u00e3o da estrat\u00e9gia da empresa ser\u00e1 o CEO.<\/li>\n<li><strong>Modela e direciona a cultura, valores e comportamento da empresa:<\/strong>\u00a0as atitudes e decis\u00f5es do CEO ter\u00e3o total impacto na constru\u00e7\u00e3o e no refor\u00e7o dos valores, cren\u00e7as e normas da empresa.<\/li>\n<li><strong>Desenvolve e lidera o time de l\u00edderes da empresa:<\/strong>\u00a0\u00e9 papel do CEO desenvolver e liderar um grupo de l\u00edderes para que sejam transparentes entre si, se sintam seguros para se expressar, busquem o conflito produtivo, tenham clareza dos resultados esperados, estejam engajados em um mesmo objetivo (mesmo que n\u00e3o haja 100% de consenso) e foquem nos resultados coletivos em vez dos resultados individuais.<\/li>\n<li><strong>Aloca capital para as prioridades da empresa:<\/strong>\u00a0geralmente assessorado por alguma pessoa de finan\u00e7as, o CEO \u00e9 a pessoa da grana. \u00c9 ele quem toma decis\u00f5es quanto aos or\u00e7amentos dentro da empresa. Ele financia iniciativas (produtos e projetos) que apoiam a estrat\u00e9gia e reduzem as iniciativas que n\u00e3o geram resultado ou que est\u00e3o desalinhadas aos objetivos de neg\u00f3cio.<\/li>\n<\/ul>\n<h2><a id=\"user-content-por-que-uma-pessoa-de-produto-n\u00e3o-\u00e9-um-mini-ceo\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-product-ceo.md#por-que-uma-pessoa-de-produto-n%C3%A3o-%C3%A9-um-mini-ceo\"><\/a>Por que uma pessoa de produto n\u00e3o \u00e9 um mini CEO?<\/h2>\n<p>Esperar que uma pessoa de produto exer\u00e7a as atribui\u00e7\u00f5es discutidas anteriormente pode gerar 4 disfun\u00e7\u00f5es, sendo elas:<\/p>\n<ul>\n<li><strong>Frustra\u00e7\u00e3o:<\/strong>\u00a0as pessoas acreditam que ter\u00e3o autonomia total para alavancar o produto, controlar o budget, mudar a cultura da equipe, alocar as melhores pessoas para trabalhar no produto, repensar a estrat\u00e9gia do neg\u00f3cio, mas esquecem de se articular com os objetivos estrat\u00e9gicos da empresa. Os primeiros ind\u00edcios de frustra\u00e7\u00e3o aparecem quando as pessoas de produto come\u00e7am a receber as primeiras negativas para as sugest\u00f5es oferecidas na forma como foi estruturado o or\u00e7amento da empresa, em como organizar as equipes e em como solucionar os desafios culturais. No meu ponto de vista, tal disfun\u00e7\u00e3o pode ser resolvida no momento da contrata\u00e7\u00e3o, ao deixar claro o que \u00e9 e n\u00e3o \u00e9 esperado da pessoa que for respons\u00e1vel pelo produto dentro da empresa.<\/li>\n<li><strong>Foco perdido:<\/strong>\u00a0dificilmente uma pessoa de produto ter\u00e1 uma vis\u00e3o hol\u00edstica da estrat\u00e9gia da organiza\u00e7\u00e3o como o CEO. Ao tentar envolver-se com quest\u00f5es estrat\u00e9gicas que n\u00e3o est\u00e3o conectadas com o produto (ex: participar de reuni\u00f5es que n\u00e3o tenham rela\u00e7\u00e3o com temas que ajudar\u00e3o na alavancagem do produto), afastam o respons\u00e1vel do produto da equipe, o que aumenta a chance da cria\u00e7\u00e3o de solu\u00e7\u00f5es que n\u00e3o suportar\u00e3o os objetivos do neg\u00f3cio (desperd\u00edcio). Uma das formas de resolver tal disfun\u00e7\u00e3o se d\u00e1 a partir da constru\u00e7\u00e3o de uma vis\u00e3o clara de como os objetivos estrat\u00e9gicos est\u00e3o relacionados ao produto e uma ferramenta \u00fatil para isso \u00e9 o\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\/\" rel=\"nofollow\">OKR<\/a>. Lembre-se: se voc\u00ea \u00e9 uma pessoa de produto, voc\u00ea existe para ajudar o neg\u00f3cio, portanto, foque nisso.<\/li>\n<li><strong>Queda no desempenho da equipe:<\/strong>\u00a0quando uma pessoa de produto se encontra extremamente atarefada por gerenciar a equipe, operar o produto, garantir o atendimento ao cliente, acompanhar m\u00e9tricas de neg\u00f3cio ou pelo fato dela exercer m\u00faltiplos pap\u00e9is (ex: head de inova\u00e7\u00e3o, head de tecnologia, head de produto, executivo de marketing etc.), o efeito de tal sobrecarga \u00e9 a queda do desempenho das equipes. Geralmente tal disfun\u00e7\u00e3o \u00e9 causada por: retrabalhos; indefini\u00e7\u00f5es; centraliza\u00e7\u00e3o no processo de tomada de decis\u00e3o no que diz respeito ao produto; e baixa qualidade no processo de prioriza\u00e7\u00e3o.<\/li>\n<li><strong>Atividades b\u00e1sicas ficam abandonadas:<\/strong>\u00a0quando uma pessoa de produto n\u00e3o sabe claramente o que \u00e9 esperado dela uma s\u00e9rie de atividades &#8220;b\u00e1sicas&#8221; s\u00e3o negligenciadas, como: gerenciar e priorizar o escopo de trabalho da equipe; dar suporte para a equipe em d\u00favidas sobre neg\u00f3cio; ter uma boa comunica\u00e7\u00e3o com os stakeholders da empresa; analisar as m\u00e9tricas de produto; compreender o neg\u00f3cio e o cliente em profundidade; compreender o modelo de neg\u00f3cio, o processo, a necessidade do cliente e a experi\u00eancia do usu\u00e1rio. Quando a pessoa de produto delega alguma das atividades listadas acima para a equipe, ela est\u00e1 se omitindo do seu trabalho.<\/li>\n<\/ul>\n<p>No contexto de uma startup, \u00e9 bem prov\u00e1vel que o CEO do neg\u00f3cio exer\u00e7a o papel de uma pessoa de produto, mas como tentei apresentar ao longo do texto o contr\u00e1rio n\u00e3o parece ser correto. Deixo a dica de um \u00f3timo podcast sobre o assunto no blog\u00a0<a href=\"https:\/\/seekingwisdom.io\/38-product-managers-ceos-and-a-book-preview-95a250cb4c7\" rel=\"nofollow\">Seeking Wisdom<\/a>. Qual \u00e9 a sua opini\u00e3o? Deixe seus coment\u00e1rios abaixo!<\/p>\n<div style=\"background-color: #fffdf9;border: 1px solid #e9af35;margin: 32px 0;padding: 22px 24px;font-family: sans-serif\">\n<h3 style=\"font-size: 1.4em;line-height: 1.3em;margin-top: 0 !important\">M\u00e9tricas para Projetos Agile<\/h3>\n<p style=\"margin-top: 0.7em !important\"><strong>Curso gratuito em 7 e-mails<\/strong>, elaborado pelo autor do livro \u201cM\u00e9tricas \u00c1geis\u201d, Raphael Albino.<br \/>\n<small>Indicado para <strong>Agile Coach, Gerente de Produtos, Gerente de Projetos, Product Owner, Scrum Master e CTO\/CIOs<\/strong>.<\/small><\/p>\n<p><a style=\"background: #e9af35;border: none;color: #fff;font-size: 12px;line-height: 1.5;margin-top: 5px;padding: 8px 16px;text-align: center;text-decoration: none;letter-spacing: 0.1em\" href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=curso-metricas-agile&amp;utm_content=cta-blog-post-bottom\" target=\"_blank\" rel=\"noopener\">INSCREVA-SE GR\u00c1TIS<\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>O que esperar de uma pessoa que atua com produto? No blog post de hoje, gostaria de discutir um pouco sobre o assunto sem apresentar uma receita pronta de\u00a0job description\u00a0do papel, mas sim debater a respeito de uma fun\u00e7\u00e3o que parece estar sofrendo por lidar com expectativas que por vezes s\u00e3o exageradas. Tive a sutileza &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/02\/pare-de-chamar-product-owners-e-product-managers-de-mini-ceos\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[1],"tags":[123,260],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7176"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7176"}],"version-history":[{"count":4,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7176\/revisions"}],"predecessor-version":[{"id":7181,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7176\/revisions\/7181"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7176"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7176"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7176"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}