{"id":6874,"date":"2017-10-26T11:49:38","date_gmt":"2017-10-26T13:49:38","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6874"},"modified":"2017-10-26T17:02:36","modified_gmt":"2017-10-26T19:02:36","slug":"12-erros-comuns-no-uso-de-metricas-de-processo","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/10\/12-erros-comuns-no-uso-de-metricas-de-processo\/","title":{"rendered":"12 Erros comuns no uso de M\u00e9tricas de Processo"},"content":{"rendered":"<p>Defendemos o uso de m\u00e9tricas h\u00e1 algum tempo, e j\u00e1 produzimos muito <a href=\"blog.plataformatec.com.br\/tag\/metrics\">conte\u00fado sobre o assunto<\/a>. No entanto, vemos times que usam m\u00e9tricas ativamente e n\u00e3o alcan\u00e7am o resultado esperado.<\/p>\n<p>Neste post, compilei os erros mais comuns que os times cometem quando usam m\u00e9tricas, assim voc\u00ea saber\u00e1 o que evitar quando adot\u00e1-las.<\/p>\n<h2>1 &#8211; N\u00e3o ter rea\u00e7\u00e3o<\/h2>\n<p>Se voc\u00ea coleta m\u00e9tricas, voc\u00ea <strong>precisa<\/strong> us\u00e1-las de alguma maneira. Portanto, um dos erros mais comuns \u00e9 n\u00e3o reagir ao que as m\u00e9tricas apontam. M\u00e9tricas podem lhe dar <em>insights<\/em>  e, para reagir, voc\u00ea precisa entender como elas funcionam e o que significam.<\/p>\n<p>Para mais informa\u00e7\u00f5es sobre como us\u00e1-las, d\u00ea uma olhada nesses posts:<\/p>\n<ul>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/10\/metricas-ageis-cumulative-flow-diagrams-e-lead-time-breakdown\/\">Cumulative Flow Diagrams e Lead Time Breakdown<\/a><\/li>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-throughput-e-graficos-burnup\/\">Throughput e gr\u00e1fico de Burnup<\/a><\/li>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-o-que-lead-time-fala-sobre-seu-projeto\/\">O que Lead Time fala sobre seu projeto<\/a><\/li>\n<\/ul>\n<h2>2 &#8211; Usar m\u00e9tricas com poucos dados<\/h2>\n<p>Outro grande erro \u00e9 utilizar m\u00e9tricas quando n\u00e3o existem dados suficientes para suportar suas conclus\u00f5es. No come\u00e7o de um projeto, ou quando come\u00e7amos a coletar m\u00e9tricas, geralmente ficamos ansiosos para melhorarmos nosso processo. No entanto, com uma quantidade baixa de dados, as m\u00e9tricas n\u00e3o s\u00e3o t\u00e3o confi\u00e1veis.<\/p>\n<p>Uma boa dica seria observar o comportamento dos dados e verificar se algum padr\u00e3o j\u00e1 se formou. No caso de ter um padr\u00e3o, voc\u00ea provavelmente j\u00e1 pode come\u00e7ar a us\u00e1-las e atuar em cima dos dados.<\/p>\n<p>\u00c9 importante notar tamb\u00e9m, que esse n\u00e3o \u00e9 o \u00fanico m\u00e9todo, mas em geral, eu esperaria no m\u00ednimo 3 semanas para come\u00e7ar a questionar o processo. &#8212; Mais sobre como agir baseado em m\u00e9tricas pode ser encontrado em nossos <a href=\"blog.plataformatec.com.br\/tag\/metrics\">blog posts<\/a>.<\/p>\n<p>Uma poss\u00edvel sa\u00edda, caso voc\u00ea tenha um projeto curto e precise de m\u00e9tricas o quanto antes, seria utilizar m\u00e9tricas di\u00e1rias. Temos um post falando sobre isso tamb\u00e9m: <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/12\/the-pros-and-cons-of-using-daily-metrics\/\">Pros and cons of using daily metrics<\/a><\/p>\n<h2>3 &#8211; Usar m\u00e9tricas sem considerar o contexto<\/h2>\n<p>Esse \u00e9 um erro muito comum, n\u00e3o s\u00f3 no desenvolvimento de software, mas em toda conclus\u00e3o constru\u00edda estatisticamente. N\u00fameros sozinhos s\u00e3o usados apenas em \u00e1lgebra ou c\u00e1lculo. Voc\u00ea precisa do contexto nos quais os n\u00fameros est\u00e3o inseridos para entend\u00ea-los. Com isso em mente, para dizer se a vaz\u00e3o do seu projeto est\u00e1 saud\u00e1vel ou n\u00e3o, para entender se a vari\u00e2ncia do seu <em>lead time<\/em> \u00e9 muito grande ou n\u00e3o, observe. o. contexto.<\/p>\n<h2>4 &#8211; Comparar m\u00e9tricas entre times<\/h2>\n<p>Esse problema est\u00e1 de certa forma relacionado com o 3. N\u00e3o faz sentido falar algo como &#8220;time A est\u00e1 melhor que o time B pois eles t\u00eam uma vaz\u00e3o maior&#8221;. E se o time A possui 10 pessoas enquanto o time B possui 3? E se o time A trabalha com o desenvolvimento simples de um website e o time B com algum <em>deep learning<\/em> complexo? Tenha cuidado.<\/p>\n<h2>5 &#8211; Ter m\u00e9tricas individuais<\/h2>\n<p>Esse \u00e9 um problema de microgerenciamento e est\u00e1 relacionado com os erros 3 e 4. Pessoas, tentando melhorar o m\u00e1ximo poss\u00edvel o processo, acabam medindo m\u00e9tricas de indiv\u00edduos. \u00c9 praticamente imposs\u00edvel comparar pessoas diferentes. Apenas n\u00e3o o fa\u00e7a. Se o fizer, estar\u00e1 afetando o ambiente do seu time e vai at\u00e9 diminuir a produtividade geral. Al\u00e9m disso, as m\u00e9tricas do processo devem ser usadas para entender a <strong>sa\u00fade do processo<\/strong>.<\/p>\n<h2>6 &#8211; Simplificar demais a leitura das m\u00e9tricas<\/h2>\n<p>Ainda relacionado ao contexto, mas agora com o contexto dos n\u00fameros. Por exemplo, se voc\u00ea comunica \u00e0s outras pessoas que um time entrega em m\u00e9dia 4 hist\u00f3rias por semana, <em>\u00e9 s\u00f3 isso<\/em>, voc\u00ea n\u00e3o est\u00e1 dizendo nada do time. Talvez os dados sejam {0, 0, 0, 0, 0, 24}, talvez sejam {4, 4, 4, 4, 4, 4}. Ent\u00e3o, tenha certeza que voc\u00ea n\u00e3o est\u00e1 simplificando demais a leitura das suas m\u00e9tricas e que todo o seu ferramental constr\u00f3i a imagem que voc\u00ea est\u00e1 tentando desenhar.<\/p>\n<h2>7 &#8211; Usar apenas as m\u00e9tricas convenientes<\/h2>\n<p>Relacionado ao erro anterior, pessoas reportam as m\u00e9tricas para seus gerentes\/diretores mostrando apenas os &#8220;n\u00fameros bons&#8221;. Ent\u00e3o, se a vaz\u00e3o aumenta, voc\u00ea mostra apenas a vaz\u00e3o. Se o backlog diminui, voc\u00ea mostra apenas isso. Seja transparente. Caso contr\u00e1rio, eles estar\u00e3o vivendo uma mentira e, quando a verdade vier \u00e0 tona, voc\u00ea n\u00e3o conseguir\u00e1 se explicar.<\/p>\n<h2>8 &#8211; Usar apenas os dados convenientes<\/h2>\n<p>Outro problema \u00e9 usar apenas m\u00e9tricas com os dados que voc\u00ea quer. Recortar os dados para ter resultados mais relevantes, como considerar apenas os \u00faltimos 2 meses em um projeto de 10 meses, pode fazer sentido j\u00e1 que o contexto de um projeto muda com o tempo e voc\u00ea quer ter certeza que est\u00e1 considerando o contexto certo nos seus resultados. No entanto, tenha cuidado quando fizer isso, pois voc\u00ea pode estar escondendo muitas informa\u00e7\u00f5es \u00fateis de voc\u00ea mesmo.<\/p>\n<h2>9 &#8211; Falsificar m\u00e9tricas<\/h2>\n<p>Este \u00e9 de longe o mais comum que vejo. Pessoas tem medo de mostrar os gargalos ou problemas e mascaram resultados (\u00e0s vezes sem perceber). Agrupam hist\u00f3rias para diminuir backlog, quebram hist\u00f3rias desnecessariamente para aumentar a vaz\u00e3o ou at\u00e9 mesmo mudam pontos de hist\u00f3ria (quando os usam) para manter a velocidade do time &#8220;constante&#8221;. Com isso, voc\u00ea est\u00e1 apenas enganando voc\u00ea mesmo e n\u00e3o est\u00e1 melhorando o processo.<\/p>\n<h2>10 &#8211; Ter metas baseadas em m\u00e9tricas<\/h2>\n<p>Esse \u00e9 um assunto <em>muito<\/em> pol\u00eamico. As m\u00e9tricas n\u00e3o foram feitas para serem metas. Foram feitas para ajudar o time a entender como o processo est\u00e1 e tentar melhorar o fluxo. Metas relacionadas \u00e0 m\u00e9tricas podem colocar muita press\u00e3o no time e ter o efeito contr\u00e1rio ao desejado, fazendo com que o time cumpra uma m\u00e9trica mas desregule todo o processo. Ent\u00e3o, antes de definir uma meta com base em m\u00e9tricas, pense se a meta precisa ser t\u00e3o &#8220;baixo-n\u00edvel&#8221; e, caso precise, confirme com o time se \u00e9 poss\u00edvel, de fato, atingir essa meta ou se existe algum impedimento inerente ao precesso.<\/p>\n<h2>11 &#8211; Tentar diminuir o lead time \u00e0 todo custo<\/h2>\n<p>Lead time (LT) \u00e9 uma m\u00e9trica que serve para entendermos quanto tempo um item leva para passar por todo o processo. Ent\u00e3o, existem duas perguntas que podem ser feitas aos dados:<\/p>\n<ul>\n<li>O LT est\u00e1 muito alto?<\/li>\n<li>A vari\u00e2ncia do LT est\u00e1 muito alta?<\/li>\n<\/ul>\n<p>A segunda pergunta \u00e9 muitas vezes mais importante para o time do que a primeira. Ter um LT com distribui\u00e7\u00e3o {0, 5, 2, 8} \u00e9 geralmente pior do que ter uma como {4, 4, 4, 4}. Na primeira os dados n\u00e3o s\u00e3o confi\u00e1veis o suficiente para se ter uma predi\u00e7\u00e3o assertiva, enquanto no segundo voc\u00ea tem maior probabilidade de acertar. No entanto, n\u00e3o esque\u00e7a de olhar para o seu contexto!<\/p>\n<h2>12 &#8211; Tentar aumentar a vaz\u00e3o ao inv\u00e9s de focar na efic\u00e1cia<\/h2>\n<p>Ser eficaz \u00e9 fazer a coisa certa. Vaz\u00e3o n\u00e3o \u00e9 importante se voc\u00ea n\u00e3o est\u00e1 fazendo a coisa certa. Ent\u00e3o, foque no seu produto, no que \u00e9 melhor para ele, antes de se importar com o qu\u00e3o r\u00e1pido voc\u00ea entrega.<\/p>\n<p>O que achou desses erros? J\u00e1 cometeu algum deles? Deixe seus coment\u00e1rios abaixo!<\/p>\n<div style=\"background-color: #fffdf9; border: 1px solid #e9af35; border-radius: 6px; margin: 32px 0; padding: 22px 24px; font-family: sans-serif;\">\n<h3 style=\"font-size: 1.4em; line-height: 1.3em; margin-top: 0 !important;\">Cont\u00c1gil Newsletter<\/h3>\n<p style=\"margin-top: 0.5em !important;\">Newsletter mensal <strong>gratuita<\/strong>, criada para ajudar voc\u00ea a se manter atualizado sobre o que est\u00e1 acontecendo na \u00e1rea de gerenciamento de projetos, metodologias e cultura \u00e1gil.<\/p>\n<p><a style=\"background: #e9af35; border: none; border-radius: 3px; color: #fff; display: inline-block; font-size: 12px; line-height: 1.5; margin-top: 5px; padding: 8px 16px; text-align: center; text-decoration: none; letter-spacing: 0.1em;\" href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=contagil-subscription&amp;utm_content=cta-blog-post-bottom\" target=\"_blank\" rel=\"noopener\">ASSINAR NEWSLETTER GR\u00c1TIS<\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Defendemos o uso de m\u00e9tricas h\u00e1 algum tempo, e j\u00e1 produzimos muito conte\u00fado sobre o assunto. No entanto, vemos times que usam m\u00e9tricas ativamente e n\u00e3o alcan\u00e7am o resultado esperado. Neste post, compilei os erros mais comuns que os times cometem quando usam m\u00e9tricas, assim voc\u00ea saber\u00e1 o que evitar quando adot\u00e1-las. 1 &#8211; N\u00e3o &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/10\/12-erros-comuns-no-uso-de-metricas-de-processo\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,254,263],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6874"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6874"}],"version-history":[{"count":11,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6874\/revisions"}],"predecessor-version":[{"id":6974,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6874\/revisions\/6974"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6874"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6874"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6874"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}