{"id":6029,"date":"2017-01-19T11:32:53","date_gmt":"2017-01-19T13:32:53","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6029"},"modified":"2017-10-03T12:44:00","modified_gmt":"2017-10-03T15:44:00","slug":"a-lei-dos-rendimentos-decrescentes-e-seu-impacto-em-projetos","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/01\/a-lei-dos-rendimentos-decrescentes-e-seu-impacto-em-projetos\/","title":{"rendered":"A Lei dos Rendimentos Decrescentes e seu impacto em projetos"},"content":{"rendered":"<p>Alguns gestores ainda pensam que todos os problemas relacionados a seus projetos podem ser solucionados se contratarem mais pessoas. Chega ao ponto de esperarem que, ao dobrar o n\u00famero de integrantes de um time, sua performance dobre tamb\u00e9m. No entanto, isso n\u00e3o \u00e9 verdade.<\/p>\n<p>Antes de explicarmos em detalhes o por que disso n\u00e3o funcionar, precisamos introduzir uma lei da microeconomia: a <strong>Lei dos Rendimentos Decrescentes<\/strong>. N\u00e3o se sinta desmotivado pela palavra &#8220;microeconomia&#8221;&#8230; Ser\u00e1 r\u00e1pido e indolor! \ud83d\ude09<\/p>\n<h2>Lei dos Rendimentos Decrescentes<\/h2>\n<p>O aumento na produtividade de um processo n\u00e3o \u00e9 diretamente proporcional ao aumento no n\u00famero de pessoas do time em quest\u00e3o. Isso acontece pois existe um limite no n\u00famero de maneiras de paralelizar um trabalho (algumas vezes \u00e9 impossivel dividir ainda mais uma tarefa). Al\u00e9m disso, cada membro adicional do time pode prejudicar a organiza\u00e7\u00e3o do mesmo.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/01\/produtividade-por-numero-de-pessoas.png\" alt=\"Gr\u00e1fico - Produtividade por N\u00famero de pessoas\" width=\"699\" height=\"465\" class=\"aligncenter size-full wp-image-6030\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/01\/produtividade-por-numero-de-pessoas.png 699w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/01\/produtividade-por-numero-de-pessoas-300x200.png 300w\" sizes=\"(max-width: 699px) 100vw, 699px\" \/><\/p>\n<p>Quando um novo integrante se junta a um time, os seguintes resultados podem ser notados:<\/p>\n<ul>\n<li>O time pode realmente precisar de mais pessoas e, portanto, sua vaz\u00e3o de tarefas vai aumentar consideravelmente, fazendo com que seu investimento tenha retorno rapidamente &#8212; rendimentos crescentes.<\/p>\n<\/li>\n<li>\n<p>O time ainda consegue absorver uma nova pessoa, no entanto a produtividade gerada com essa entrada \u00e9 baixa, resultando em um retorno lento de seu investimento &#8212; rendimentos decrescentes.<\/p>\n<\/li>\n<li>\n<p>O time est\u00e1 saturado e o novo membro do time faz com que as pessoas tenham que disputar espa\u00e7o por tarefas e investir um tempo maior para coordenar o processo, o que causa diminui\u00e7\u00e3o na produtividade do time &#8212; rendimentos negativos.<\/p>\n<\/li>\n<\/ul>\n<p><strong>O que voc\u00ea est\u00e1 dizendo ent\u00e3o \u00e9 que eu n\u00e3o posso fazer nada para melhorar a vaz\u00e3o do meu time?<\/strong> \ud83e\udd14<\/p>\n<p>N\u00e3o! Existem m\u00e9todos que te ajudam a contornar essa lei, e n\u00f3s mostraremos como alcan\u00e7ar isso. \ud83d\ude09<\/p>\n<h2>A\u00e7\u00f5es de contorno<\/h2>\n<p>A curva de rendimento decrescente segue uma premissa: voc\u00ea fixa as vari\u00e1veis do seu sistema e apenas varia a quantidade de pessoas. Portanto, caso mudemos as outras vari\u00e1veis que outrora estavam fixas, podemos nos manter por mais tempo na \u00e1rea de rendimentos crescentes.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/01\/produtividade-por-numero-de-pessoas-sistema.png\" alt=\"Gr\u00e1fico - Mudan\u00e7a no sistema de produtividade por n\u00famero de pessoas\" width=\"621\" height=\"471\" class=\"aligncenter size-full wp-image-6031\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/01\/produtividade-por-numero-de-pessoas-sistema.png 621w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/01\/produtividade-por-numero-de-pessoas-sistema-300x228.png 300w\" sizes=\"(max-width: 621px) 100vw, 621px\" \/><\/p>\n<p>Tais mudan\u00e7as n\u00e3o v\u00e3o apenas tornar seu time mais preparado para receber novos integrantes, mas pode tamb\u00e9m melhorar sua vaz\u00e3o por si s\u00f3, sem a necessidade de novas contrata\u00e7\u00f5es.<\/p>\n<p>Primeiramente, voc\u00ea deve observar se seu processo de desenvolvimento \u00e9 saud\u00e1vel. N\u00f3s possu\u00edmos um \u00f3timo blog post que sumariza como melhorar seu fluxo de trabalho: <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/08\/5-strategies-to-improve-software-development-workflow\/\">5 Strategies to improve software development workflow<\/a>.<\/p>\n<p>Al\u00e9m disso, para que seu time seja o mais eficiente poss\u00edvel com a nova contrata\u00e7\u00e3o, seu projeto precisa das seguintes caracter\u00edsticas:<\/p>\n<ul>\n<li>Alta qualidade de c\u00f3digo \u2013 caso a qualidade do c\u00f3digo esteja ruim, a adi\u00e7\u00e3o de um novo membro em nada mudar\u00e1 pois a curva de aprendizado para desenvolver novas funcionalidades ser\u00e1 grande e o seu lead time s\u00f3 aumentar\u00e1 com o tempo devido \u00e0 complexidade gerada pela baixa qualidade.<\/p>\n<\/li>\n<li>\n<p>Arquitetura de software \u2013 a arquitetura do software precisa possibilitar que a adi\u00e7\u00e3o de um novo integrante melhore o throughput global.<\/p>\n<\/li>\n<li>\n<p>Organiza\u00e7\u00e3o do time \u2013 o time precisa estar corretamente organizado para que a adi\u00e7\u00e3o de um novo membro n\u00e3o desestabilize o funcionamento do time.<\/p>\n<\/li>\n<li>\n<p>Documenta\u00e7\u00e3o &#8211; O time precisa de uma boa documenta\u00e7\u00e3o do software existente, para que novos membros consigam entender seu contexto mais rapidamente e, portanto, comecem a trabalhar mais eficientemente.<\/p>\n<\/li>\n<\/ul>\n<p>Para ilustrar toda essa ideia de retornos decrescentes e as poss\u00edveis mudan\u00e7as em um sistema, n\u00f3s apresentamos aqui um simples exemplo.<\/p>\n<h2>Exemplo<\/h2>\n<p>Para que seja poss\u00edvel ver mais facilmente o que significa a satura\u00e7\u00e3o de pessoas em um time, imagine que Carlos trabalha em um carrinho de cachorros-quentes em uma rua movimentada.<\/p>\n<p>Ele cuida tanto da montagem do cachorro-quente quanto da venda do mesmo. Por ter uma fila muito grande de pessoas esperando pelo seu hot-dog, ele v\u00ea que algumas vezes as pessoas saem da fila. Com isso em mente, ele decidiu contratar mais uma pessoa para cuidar da parte de montagem enquanto ele cuida das vendas.<\/p>\n<p>Ap\u00f3s a entrada do novo integrante, a venda de cachorros-quentes <strong>aumentou em 100%<\/strong> pois ningu\u00e9m mais saia da fila (exemplo de rendimento crescente).<\/p>\n<p>Carlos, no entanto, acredita que mais um integrante ainda traria benef\u00edcios ao neg\u00f3cio, pois a nova pessoa poderia recolher o resto de comida que fica em torno do carrinho e organizar os ingredientes, para que o montador ficasse focado apenas na montagem. Assim ele poderia eliminar a fila. Carlos ent\u00e3o contratou mais uma pessoa e sua venda de hot-dogs <strong>aumenta em 25%<\/strong>, ao inv\u00e9s dos 100% conseguidos com o primeiro novo integrante (exemplo de rendimento decrescente).<\/p>\n<p>Carlos ainda v\u00ea que o montador de hot-dogs gasta muito tempo customizando o final da montagem, pois algumas pessoas gostam de mostarda e ketchup e outras n\u00e3o. Pensou ent\u00e3o em trazer ainda mais uma pessoa para o time, para cuidar apenas da customiza\u00e7\u00e3o dos produtos. No entanto, quando a pessoa chegou ele viu sua produtividade <strong>diminuir em 30%<\/strong>, e notou que o que acontecia era que o novo integrante tinha que dividir espa\u00e7o com o montador e, portanto, atrapalhava mais do que ajudava no fluxo (exemplo de rendimento negativo).<\/p>\n<p>No entanto, Carlos era um homem de vis\u00e3o, queria crescer seu neg\u00f3cio. Para acomodar as 4 pessoas e aumentar ainda mais o fluxo, ele decidiu abrir uma loja de cachorro-quente. Nessa loja agora, ele tem espa\u00e7o para todos e ainda conseguiu colocar mais duas pessoas como atendentes. Carlos <strong>fatura agora 600% mais<\/strong> do que anteriormente (exemplo de mudan\u00e7as no sistema para manter um rendimento crescente).<\/p>\n<h2>Conclus\u00e3o<\/h2>\n<p>\u00c9 necess\u00e1rio que, antes de tomarmos decis\u00f5es sobre contrata\u00e7\u00e3o ou deslocamento interno de pessoas, tenhamos consci\u00eancia das condi\u00e7\u00f5es do time em quest\u00e3o para que a chegada de um novo membro tenha a maior efici\u00eancia poss\u00edvel.<\/p>\n<p>O que achou desse post? Voc\u00ea j\u00e1 conhecia a Lei de Retornos Decrescentes? Deixe seus coment\u00e1rios abaixo!<\/p>\n<div style=\"background-color: #fffdf9; border: 1px solid #e9af35; border-radius: 6px; margin: 32px 0; padding: 22px 24px; font-family: sans-serif;\">\n<h3 style=\"font-size: 1.4em; line-height: 1.3em; margin-top: 0 !important;\">Cont\u00c1gil Newsletter<\/h3>\n<p style=\"margin-top: 0.5em !important;\">Newsletter mensal <strong>gratuita<\/strong>, criada para ajudar voc\u00ea a se manter atualizado sobre o que est\u00e1 acontecendo na \u00e1rea de gerenciamento de projetos, metodologias e cultura \u00e1gil.<\/p>\n<p><a style=\"background: #e9af35; border: none; border-radius: 3px; color: #fff; display: inline-block; font-size: 12px; line-height: 1.5; margin-top: 5px; padding: 8px 16px; text-align: center; text-decoration: none; letter-spacing: 0.1em;\" href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=contagil-subscription&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\">ASSINAR NEWSLETTER GR\u00c1TIS<\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Alguns gestores ainda pensam que todos os problemas relacionados a seus projetos podem ser solucionados se contratarem mais pessoas. Chega ao ponto de esperarem que, ao dobrar o n\u00famero de integrantes de um time, sua performance dobre tamb\u00e9m. No entanto, isso n\u00e3o \u00e9 verdade. Antes de explicarmos em detalhes o por que disso n\u00e3o funcionar, &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/01\/a-lei-dos-rendimentos-decrescentes-e-seu-impacto-em-projetos\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[101,210],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6029"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6029"}],"version-history":[{"count":9,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6029\/revisions"}],"predecessor-version":[{"id":6033,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6029\/revisions\/6033"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6029"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6029"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6029"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}