{"id":9570,"date":"2019-12-18T14:46:00","date_gmt":"2019-12-18T16:46:00","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9570"},"modified":"2019-12-18T15:43:46","modified_gmt":"2019-12-18T17:43:46","slug":"okr-licoes-aprendidas-para-voce-comecar-a-aplica-lo-de-forma-efetiva","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/12\/okr-licoes-aprendidas-para-voce-comecar-a-aplica-lo-de-forma-efetiva\/","title":{"rendered":"OKR: li\u00e7\u00f5es aprendidas para voc\u00ea come\u00e7ar a aplic\u00e1-lo de forma efetiva"},"content":{"rendered":"\n<p>Depois do sucesso do livro&nbsp;<a href=\"https:\/\/www.amazon.com\/Measure-What-Matters-Google-Foundation\/dp\/0525536221\">Measure What Matters: How Google, Bono, and the Gates Foundation Rock the World with OKRs<\/a>&nbsp;de John Doerr, praticamente toda organiza\u00e7\u00e3o vem buscando utilizar OKR como forma de desdobrar seus objetivos e medir os avan\u00e7os dos resultados.<\/p>\n\n\n\n<p>Assim como qualquer modelo,&nbsp;<em>framework<\/em>&nbsp;ou ferramenta, existe uma tend\u00eancia natural das pessoas acreditarem que o artefato resolver\u00e1 os problemas organizacionais simplesmente por estar sendo aplicado. A partir das minhas andan\u00e7as como consultor, me deparei com diversas situa\u00e7\u00f5es onde as pessoas disseram que tentaram aplicar os OKRs e n\u00e3o obtiveram sucesso.<\/p>\n\n\n\n<p>No texto a seguir, compartilharei um compilado de aprendizados e dicas para quem j\u00e1 lida com o&nbsp;<em>framework<\/em>&nbsp;ou para quem est\u00e1 considerando lev\u00e1-lo para o seu dia a dia.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">1) Qual a rela\u00e7\u00e3o entre OKR e pensamento estrat\u00e9gico?<\/h2>\n\n\n\n<p>Um grande desafio nas organiza\u00e7\u00f5es diz respeito a como decompor sua estrat\u00e9gia. Tudo come\u00e7a com a constru\u00e7\u00e3o de um pensamento estrat\u00e9gico que, em linhas gerais, passa por tr\u00eas grandes etapas: (1) coleta de informa\u00e7\u00f5es; (2) formula\u00e7\u00e3o de ideias; (3) planejamento das a\u00e7\u00f5es (essas diretrizes e mais dicas podem ser vistas em&nbsp;<a href=\"https:\/\/www.amazon.com\/Strategic-Thinking-Step-step-Leadership-ebook\/dp\/B00AXDJJ38\">Strategic Thinking: A Step-by-step Approach to Strategy and Leadership<\/a>).<\/p>\n\n\n\n<p>\u00c9 fundamental que a organiza\u00e7\u00e3o entenda o que est\u00e1 mudando no mercado em que ela atua, como a concorr\u00eancia tem se posicionado diante de tais mudan\u00e7as e como a organiza\u00e7\u00e3o est\u00e1 operando hoje.<\/p>\n\n\n\n<p>Passada a etapa de entendimento do contexto, o pr\u00f3ximo passo de um pensamento estrat\u00e9gico \u00e9 o levantamento de desejos, hip\u00f3teses e necessidades. \u00c9 importante que a organiza\u00e7\u00e3o crie uma vis\u00e3o futura inspiradora e que garanta a sustentabilidade do neg\u00f3cio diante dos desafios que ela enfrentar\u00e1.<\/p>\n\n\n\n<p>O \u00faltimo passo \u00e9 o planejamento daquilo que ser\u00e1 feito. A organiza\u00e7\u00e3o precisa compreender quais s\u00e3o as op\u00e7\u00f5es de a\u00e7\u00f5es e, com muita clareza, dever\u00e1 escolher o que ser\u00e1 feito e o que n\u00e3o ser\u00e1. Neste momento, \u00e9 essencial que haja uma clareza do que \u00e9 prioridade dentro de uma perspectiva de curto, m\u00e9dio e longo prazo. Costumo dizer que prioridade \u00e9 uma palavra que n\u00e3o deveria ser colocada no plural porque quando tudo \u00e9 prioridade, nada \u00e9 prioridade.<br><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"652\" height=\"444\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_pensamento_estrategico.png\" alt=\"\" class=\"wp-image-9566\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_pensamento_estrategico.png 652w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_pensamento_estrategico-300x204.png 300w\" sizes=\"(max-width: 652px) 100vw, 652px\" \/><\/figure>\n\n\n\n<p><strong>Pois bem, ent\u00e3o o que OKR tem a ver com o pensamento estrat\u00e9gico exposto acima?<\/strong><br><\/p>\n\n\n\n<p>Quando falamos que o OKR \u00e9 a composi\u00e7\u00e3o do que desejo alcan\u00e7ar (objetivo) e como vou medir o progresso (conjunto de resultados-chave), precisamos partir de uma refer\u00eancia, que no caso do pensamento estrat\u00e9gico se d\u00e1 atrav\u00e9s da coleta de informa\u00e7\u00f5es. Se eu n\u00e3o conhe\u00e7o meu contexto atual, como eu posso definir onde eu quero chegar?<\/p>\n\n\n\n<p>Al\u00e9m do mais, uma vis\u00e3o clara \u00e9 necess\u00e1ria para orientar o processo de cria\u00e7\u00e3o dos OKRs. Quando a organiza\u00e7\u00e3o n\u00e3o consegue estabelecer seu norte, qualquer caminho (ou no caso OKR) servir\u00e1. O problema dessa condi\u00e7\u00e3o \u00e9 que ela gera desperd\u00edcio de dinheiro, esfor\u00e7o e energia.<\/p>\n\n\n\n<p>Por fim, os OKRs nos for\u00e7am a fazer escolhas quando precisamos pensar no que ser\u00e1 o foco de um trimestre, por exemplo. Ao definir poucos objetivos, estamos garantindo que a organiza\u00e7\u00e3o estar\u00e1 voltada naquilo que \u00e9 o mais importante para o horizonte de tempo determinado.<\/p>\n\n\n\n<p><strong>Portanto, lembre-se:<\/strong>&nbsp;sem estrat\u00e9gia, n\u00e3o faz sentido a aplica\u00e7\u00e3o de OKR.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">2) Quais problemas voc\u00ea pode resolver com OKRs?<\/h2>\n\n\n\n<p>Se voc\u00ea deseja comunicar a estrat\u00e9gia da organiza\u00e7\u00e3o, melhorar a transpar\u00eancia, trazer senso de prop\u00f3sito para as equipes e conectar o trabalho das pessoas com os resultados do neg\u00f3cio, OKR pode ser uma boa forma de voc\u00ea chegar l\u00e1.<\/p>\n\n\n\n<p><strong>2.1 &#8211; Comunica\u00e7\u00e3o da estrat\u00e9gia<\/strong><\/p>\n\n\n\n<p>A partir do momento em que a organiza\u00e7\u00e3o tem a sua estrat\u00e9gia estabelecida, os OKRs que ser\u00e3o desenhados pelas equipes dever\u00e3o se comunicar com a mesma. Em outras palavras, caso existam OKRs que n\u00e3o est\u00e3o conectados com as diretrizes estrat\u00e9gicas do neg\u00f3cio, eles deveriam ser descartados.<\/p>\n\n\n\n<p><strong>2.2 Transpar\u00eancia<\/strong><\/p>\n\n\n\n<p>Ao acompanhar semanalmente o progresso dos resultados-chave, validar e comunicar mensalmente os resultados dos OKRs e refinar trimestralmente os avan\u00e7os em um momento de inspe\u00e7\u00e3o e adapta\u00e7\u00e3o, a organiza\u00e7\u00e3o reduzir\u00e1 uma natural assimetria de informa\u00e7\u00e3o que existe nas hierarquias e nos silos departamentais. Ficou na d\u00favida de como aumentar a transpar\u00eancia? Siga o fluxo abaixo.<\/p>\n\n\n\n<figure class=\"wp-block-gallery columns-1 is-cropped wp-block-gallery-1 is-layout-flex wp-block-gallery-is-layout-flex\"><ul class=\"blocks-gallery-grid\"><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" decoding=\"async\" width=\"960\" height=\"720\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_fluxo_cadencia_okr.png\" alt=\"\" data-id=\"9568\" data-full-url=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_fluxo_cadencia_okr.png\" data-link=\"http:\/\/blog.plataformatec.com.br\/imagem_fluxo_cadencia_okr\/\" class=\"wp-image-9568\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_fluxo_cadencia_okr.png 960w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_fluxo_cadencia_okr-300x225.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_fluxo_cadencia_okr-768x576.png 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/figure><\/li><\/ul><\/figure>\n\n\n\n<p>Ao atingirmos as cad\u00eancias mencionadas na imagem acima, aumentamos a visibilidade do que est\u00e1 acontecendo no neg\u00f3cio e deixamos os problemas palp\u00e1veis para serem tratados.<\/p>\n\n\n\n<p><strong>2.3 Conex\u00e3o do trabalho com os resultados<\/strong><\/p>\n\n\n\n<p>Ao atrelar as iniciativas (ex: projetos, evolu\u00e7\u00f5es de um produto) com os resultados do neg\u00f3cio, trazemos um senso de prop\u00f3sito que pode motivar e engajar as pessoas no trabalho que est\u00e1 sendo feito.<\/p>\n\n\n\n<p>Como exerc\u00edcio, tenho proposto uma amarra\u00e7\u00e3o onde toda iniciativa trabalhada por uma equipe (ex: projeto, hist\u00f3ria de usu\u00e1rio etc.) deve ter um objetivo e uma clareza do impacto no neg\u00f3cio, al\u00e9m da sua descri\u00e7\u00e3o e crit\u00e9rio de t\u00e9rmino.<\/p>\n\n\n\n<p>O exemplo abaixo \u00e9 uma situa\u00e7\u00e3o de uma equipe que, a priori, tinha recebido a \u201cdemanda\u201d de contratar uma solu\u00e7\u00e3o de for\u00e7a de vendas. Ao conectar tal demanda com o objetivo do neg\u00f3cio e com os resultados-chave, a equipe conseguiu ter maior entendimento da import\u00e2ncia do trabalho que seria feito.<\/p>\n\n\n\n<figure class=\"wp-block-gallery columns-1 is-cropped wp-block-gallery-2 is-layout-flex wp-block-gallery-is-layout-flex\"><ul class=\"blocks-gallery-grid\"><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" decoding=\"async\" width=\"774\" height=\"474\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_exemplo_aplicacao_okr_iniciativa.png\" alt=\"\" data-id=\"9569\" data-full-url=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_exemplo_aplicacao_okr_iniciativa.png\" data-link=\"http:\/\/blog.plataformatec.com.br\/imagem_exemplo_aplicacao_okr_iniciativa\/\" class=\"wp-image-9569\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_exemplo_aplicacao_okr_iniciativa.png 774w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_exemplo_aplicacao_okr_iniciativa-300x184.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_exemplo_aplicacao_okr_iniciativa-768x470.png 768w\" sizes=\"(max-width: 774px) 100vw, 774px\" \/><\/figure><\/li><\/ul><\/figure>\n\n\n\n<p>Ao unir a entrega com o resultado, voc\u00ea garantir\u00e1 a necessidade das pessoas olharem os n\u00fameros e os dados da organiza\u00e7\u00e3o. Al\u00e9m disso, voc\u00ea evitar\u00e1 que a equipe invista tempo e esfor\u00e7o para atender uma demanda que n\u00e3o gera impacto nos objetivos do neg\u00f3cio. E em \u00faltimo caso, mas nem por isso menos importante, voc\u00ea for\u00e7ar\u00e1 a equipe se questionar o porqu\u00ea de estarem fazendo algo que n\u00e3o impacta diretamente nos objetivos do neg\u00f3cio.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">3) Qual a import\u00e2ncia das m\u00e9tricas na defini\u00e7\u00e3o dos OKRs?<\/h2>\n\n\n\n<p>Indicadores de neg\u00f3cio s\u00e3o as melhores medidas para avaliar o progresso em dire\u00e7\u00e3o aos objetivos. Se voc\u00ea est\u00e1 em busca de sair de um modelo onde h\u00e1 uma cobran\u00e7a por entregas (<em>output<\/em>) e deseja ser cobrado por resultado (<em>outcome<\/em>), defina resultados-chave (<em>key results<\/em>) que se acoplem com os&nbsp;<a href=\"https:\/\/www.klipfolio.com\/resources\/articles\/what-is-a-key-performance-indicator\">indicadores de performance (KPI)<\/a>&nbsp;da organiza\u00e7\u00e3o.<\/p>\n\n\n\n<p>Lembrando que a sigla OKR \u00e9 composta de duas partes (objetivos e resultados-chave), um KPI que precisa ser melhorado ser\u00e1 um excelente ponto de partida para criar um OKR e se tornar\u00e1 um resultado-chave para um objetivo.<\/p>\n\n\n\n<p><strong>Lembre-se:<\/strong>&nbsp;OKR e KPI funcionar\u00e3o perfeitamente juntos dado que os KPIs ajudam a monitorar o desempenho e a identificar problemas e \u00e1reas de melhoria no modo atual de operar da organiza\u00e7\u00e3o. J\u00e1 os OKRs, contribuem na resolu\u00e7\u00e3o de problemas, na melhoria de processos e no impulsionamento de inova\u00e7\u00f5es.<\/p>\n\n\n\n<p>Para exemplificar, gostaria de compartilhar um caso real de uma organiza\u00e7\u00e3o que tinha como objetivo \u201cExpandir os talentos da \u00e1rea de produto\u201d e possu\u00eda como indicadores de performance o tempo m\u00e9dio de contrata\u00e7\u00e3o, o n\u00famero de vagas ocupadas e a pesquisa de satisfa\u00e7\u00e3o. Depois de uma sess\u00e3o de defini\u00e7\u00e3o, sa\u00edmos com o seguinte OKR:<\/p>\n\n\n\n<p><strong>Objetivo:<\/strong>&nbsp;Expandir os talentos da \u00e1rea de produto.<\/p>\n\n\n\n<p><strong>Resultados-chave:<\/strong><\/p>\n\n\n\n<ul><li>Contratar 4 novas pessoas de desenvolvimento para aumentar a senioridade da equipe.<\/li><li>Aumentar o resultado da pesquisa de satisfa\u00e7\u00e3o de 75% (resultado no \u00faltimo trimestre) para 85%.<\/li><li>Reduzir o tempo m\u00e9dio de contrata\u00e7\u00e3o de 45 dias para 30 dias.<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">4) Dicas pr\u00e1ticas<\/h2>\n\n\n\n<p>Antes de finalizar o texto gostaria, de compartilhar 6 dicas pr\u00e1ticas para voc\u00ea revisar sua estrat\u00e9gia de ado\u00e7\u00e3o de OKR:<\/p>\n\n\n\n<ol><li><strong>Tenha o apoio executivo:<\/strong>&nbsp;OKR, assim como qualquer outra mudan\u00e7a organizacional precisa do suporte executivo para acontecer. Acreditar que apenas movimentos locais (debaixo para cima) far\u00e3o com que a transforma\u00e7\u00e3o aconte\u00e7a \u00e9 come\u00e7ar o jogo perdendo. Portanto, \u00e9 fundamental que os OKRs da empresa se desdobrem para os times.<\/li><li><strong>N\u00e3o defina muitos objetivos:<\/strong>&nbsp;independente do contexto (empresa, equipe, tribo etc.), tenha de 2 at\u00e9 3 objetivos para garantir que as pessoas estejam focadas naquilo que importa durante o trimestre.<\/li><li><strong>Tenha resultados-chave mensur\u00e1veis:<\/strong>&nbsp;se voc\u00ea n\u00e3o consegue medir, voc\u00ea n\u00e3o saber\u00e1 se est\u00e1 alcan\u00e7ado o seu objetivo. N\u00e3o criei resultados-chave para m\u00e9tricas que n\u00e3o existem. Se voc\u00ea quer ter bons OKRs, coloque um esfor\u00e7o para ter as m\u00e9tricas dispon\u00edveis.<\/li><li><strong>N\u00e3o tenha mais do que 3 resultados-chave por objetivo:<\/strong>&nbsp;se \u00e9 muito dif\u00edcil de medir um objetivo talvez ela possa ser repensando, reescrito ou reestruturado.<\/li><li><strong>Deixe os resultados vis\u00edveis para todas as pessoas da organiza\u00e7\u00e3o:<\/strong>&nbsp;visibilidade \u00e9 alma para um melhor alinhamento e para que os problemas que surgirem de fato sejam resolvidos.<\/li><li><strong>Evite resultados-chave orientados por tarefas (ex: entrega de projetos):<\/strong>&nbsp;foque em resultados orientados ao neg\u00f3cio porque isso ajudar\u00e1 a organiza\u00e7\u00e3o a traduzir os benef\u00edcios de uma nova abordagem de trabalho e suportar\u00e1 a ideia de equipes multidisciplinares.<\/li><\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">Conclus\u00e3o<br><a href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2019-12-OKR-licoes-aprendidas.md#conclus%C3%A3o\"><\/a><\/h2>\n\n\n\n<p>OKR \u00e9 uma \u00f3tima forma de pensar de forma estrat\u00e9gica e fazer com que as pessoas colaborem na execu\u00e7\u00e3o daquilo que a organiza\u00e7\u00e3o busca conquistar. O&nbsp;<em>framework<\/em>&nbsp;em si \u00e9 bem simples, por\u00e9m sua ado\u00e7\u00e3o, nem tanto.<\/p>\n\n\n\n<p>Pensando em sistematizar a mensagem deste <em>post<\/em>, resolvi criar um Canvas que te ajudar\u00e1 no momento de desenvolver os OKRs na sua organiza\u00e7\u00e3o.<\/p>\n\n\n\n<p>Basta seguir os passos sinalizados pelas setas e responder \u00e0s perguntas necess\u00e1rias em cada um dos quadrantes. Comece pela estrat\u00e9gia, defina os objetivos, crie os resultados-chave, priorize as iniciativas e defina as \u00e1reas que precisar\u00e3o colaborar com aquele OKR. Cada linha do quadro representar\u00e1 um OKR.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"662\" height=\"422\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_okr_canvas.png\" alt=\"\" class=\"wp-image-9567\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_okr_canvas.png 662w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/12\/imagem_okr_canvas-300x191.png 300w\" sizes=\"(max-width: 662px) 100vw, 662px\" \/><\/figure>\n\n\n\n<p>E voc\u00ea, quais t\u00eam sido os desafios e os principais aprendizados com OKRs? O que achou do OKR Canvas?<\/p>\n\n\n\n<p>Compartilhe comigo sua opini\u00e3o nos coment\u00e1rios abaixo!<\/p>\n\n\n\n<p>Refer\u00eancias:<\/p>\n\n\n\n<ul><li><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\/\">Como definir OKRs em equipes \u00e1geis?<\/a><\/li><li><a href=\"http:\/\/eleganthack.com\/the-art-of-the-okr\/\">The Art of the OKR<\/a><\/li><li><a href=\"https:\/\/felipecastro.com\/en\/blog\/\">Blog do Felipe Castro<\/a><\/li><\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Depois do sucesso do livro&nbsp;Measure What Matters: How Google, Bono, and the Gates Foundation Rock the World with OKRs&nbsp;de John Doerr, praticamente toda organiza\u00e7\u00e3o vem buscando utilizar OKR como forma de desdobrar seus objetivos e medir os avan\u00e7os dos resultados. Assim como qualquer modelo,&nbsp;framework&nbsp;ou ferramenta, existe uma tend\u00eancia natural das pessoas acreditarem que o artefato &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/12\/okr-licoes-aprendidas-para-voce-comecar-a-aplica-lo-de-forma-efetiva\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[1],"tags":[123,300],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9570"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9570"}],"version-history":[{"count":9,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9570\/revisions"}],"predecessor-version":[{"id":9590,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9570\/revisions\/9590"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9570"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9570"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9570"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}