{"id":6241,"date":"2017-04-20T15:43:37","date_gmt":"2017-04-20T18:43:37","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6241"},"modified":"2017-09-05T14:18:26","modified_gmt":"2017-09-05T17:18:26","slug":"dilemas-de-uma-equipe-de-produto-desenhando-uma-entrega","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/04\/dilemas-de-uma-equipe-de-produto-desenhando-uma-entrega\/","title":{"rendered":"Dilemas de PO: priorizar features e projetar entregas"},"content":{"rendered":"<p>Se voc\u00ea gerencia um produto de <em>software<\/em> que j\u00e1 est\u00e1 em uso, \u00e9 bem prov\u00e1vel que j\u00e1 tenha se deparado com duas perguntas ao pensar em evolu\u00e7\u00f5es e melhorias da aplica\u00e7\u00e3o:<\/p>\n<ul>\n<li>Como prioriz\u00e1-las?<\/li>\n<li>Quando elas ser\u00e3o entregues?<\/li>\n<\/ul>\n<p>Neste blog post, teremos a oportunidade de discutir algumas abordagens que poder\u00e3o ajudar voc\u00ea a responder tais questionamentos (neste ano, falarei mais sobre o assunto aqui no blog).<\/p>\n<p>Tenho observado um movimento de gest\u00e3o de produtos que vem concretizando os princ\u00edpios por tr\u00e1s do <em>Lean Startup<\/em> que diziam: construa, me\u00e7a e aprenda. A partir da \u00f3tica de <strong>medir<\/strong>\u00a0e <strong>aprender<\/strong>, \u00e9 percept\u00edvel que gestoras e gestores de produto come\u00e7am a levantar hip\u00f3teses de neg\u00f3cio a partir de m\u00e9tricas como taxa de convers\u00e3o, recorr\u00eancia mensal, taxa de evas\u00e3o, an\u00e1lise da intera\u00e7\u00e3o dos usu\u00e1rios nos fluxos cr\u00edticos da aplica\u00e7\u00e3o, etc.<\/p>\n<p>Voltando para a primeira pergunta que abriu o texto, nos deparamos com atributos quantitativos que nos permitem priorizar o que precisamos construir. Tal ferramental sustenta a ideia de que estamos interessados em melhorar os resultados do produto a partir de n\u00fameros.<\/p>\n<p>Antes que algu\u00e9m me crucifique, nem s\u00f3 baseados em n\u00fameros devem ser os fatores para a prioriza\u00e7\u00e3o de novas <em>features<\/em> dos produtos que trabalhamos. Caso voc\u00ea tenha a possibilidade de se aproximar do seu usu\u00e1rio para pergunt\u00e1-lo o que ele deseja, voc\u00ea tamb\u00e9m estar\u00e1 aumentando a probabilidade de construir algo que traga valor para ele. Dados qualitativos podem ser coletados atrav\u00e9s de question\u00e1rios <em>online<\/em>, pesquisas de campo, an\u00e1lises de intera\u00e7\u00e3o a partir de prot\u00f3tipos, etc.<\/p>\n<p>Ao priorizarmos uma funcionalidade, estamos em busca de gerarmos uma solu\u00e7\u00e3o que traga valor para nossos usu\u00e1rios, clientes, acionistas e empresa. Em outras palavras, podemos dizer que estamos em busca de encontrarmos uma rela\u00e7\u00e3o positiva na equa\u00e7\u00e3o de valor que nada mais \u00e9 do que a diferen\u00e7a entre o valor criado pela solu\u00e7\u00e3o menos o pre\u00e7o pago por ela #maisvalorporfavor.<\/p>\n<div id=\"attachment_6242\" style=\"width: 506px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-6242\" class=\"wp-image-6242 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_quadro_metodos.png\" alt=\"\" width=\"496\" height=\"168\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_quadro_metodos.png 496w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_quadro_metodos-300x102.png 300w\" sizes=\"(max-width: 496px) 100vw, 496px\" \/><p id=\"caption-attachment-6242\" class=\"wp-caption-text\">Quadro de abordagens quali e quantitativa<\/p><\/div>\n<p>Dado que priorizamos aquilo que \u00e9 mais importante para a sa\u00fade do produto e para os usu\u00e1rios, um segundo questionamento que por vezes fica na cabe\u00e7a \u00e9: quanto tempo levaremos para entregar essa nova <em>feature<\/em>?<\/p>\n<p>Partindo do pressuposto que vivemos em um contexto incerto (sim, acredite, desenvolver <em>softwar<\/em>e n\u00e3o \u00e9 algo determin\u00edstico), trabalhar com cen\u00e1rios de entrega passa a ser uma abordagem mais confi\u00e1vel. Ao utilizar proje\u00e7\u00f5es voc\u00ea passa a calcular ou predizer um evento futuro a partir da an\u00e1lise dos dados dispon\u00edveis (passado).<\/p>\n<p>Para que isso seja poss\u00edvel, sugiro que voc\u00ea e a sua equipe passem a monitorar uma m\u00e9trica de processo: lead time (n\u00famero de dias entre o in\u00edcio e o fim do processo de entrega de uma hist\u00f3ria do usu\u00e1rio, um bug, etc.).<\/p>\n<p>Em outras oportunidades tivemos a chance de discutir formas de analisar o lead time (<a href=\"http:\/\/blog.plataformatec.com.br\/2016\/03\/looking-at-lead-time-in-a-different-way\/\">\u201cLooking at Lead Time in a different way\u201d<\/a> e <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/02\/why-we-love-metrics-learning-with-lead-time\/\">\u201cWhy we love metrics? Learning with Lead time\u201d<\/a>), por\u00e9m, gostaria de compartilhar como o percentil pode ser uma refer\u00eancia \u00fatil para desenhar cen\u00e1rios futuros a partir de refer\u00eancias do passado.<\/p>\n<p>Se voc\u00ea n\u00e3o conhece, percentil \u00e9 uma medida que divide a amostra ordenada (por ordem crescente dos dados) em 100 partes, cada uma com uma percentagem de dados aproximadamente igual. Traduzindo e relacionando com uma distribui\u00e7\u00e3o de <em>lead time<\/em>, \u00e9 como se analis\u00e1ssemos o <em>lead time<\/em>\u00a0das demandas que foram entregues e discut\u00edssemos qual o percentual de chances de um determinado valor ser atingido a partir do percentil.<\/p>\n<p>Em um projeto recente utilizamos a informa\u00e7\u00e3o de percentil para projetar poss\u00edveis prazos de entrega de uma demanda de neg\u00f3cio que havia sido priorizada pelo Product Owner (PO) da c\u00e9lula em que trabalhamos.<\/p>\n<div id=\"attachment_6244\" style=\"width: 1034px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-6244\" class=\"wp-image-6244 size-large\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_post_exemplo-1024x353.png\" alt=\"\" width=\"1024\" height=\"353\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_post_exemplo-1024x353.png 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_post_exemplo-300x103.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_post_exemplo-768x265.png 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/04\/blog_post_exemplo.png 1080w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><p id=\"caption-attachment-6244\" class=\"wp-caption-text\">Histograma de lead time<\/p><\/div>\n<p>A equipe utilizou o histograma acima e passou a seguinte an\u00e1lise do cen\u00e1rio ao PO:<\/p>\n<ul>\n<li>50% das demandas levaram at\u00e9 6 dias para serem conclu\u00eddas (mediana).<\/li>\n<li>75% das demandas levaram at\u00e9 12 dias para serem conclu\u00eddas ou seja apenas 25% levaram mais do que tal limite para serem conclu\u00eddas (percentil 75).<\/li>\n<li>95% das demandas levaram at\u00e9 18 dias para serem conclu\u00eddas, o que nos leva a afirmar que apenas 5% delas levaram mais tempo do que isso para serem finalizadas (percentil 95).<\/li>\n<\/ul>\n<p>A partir dos dados acima, o time demonstrou confian\u00e7a de entregar a demanda entre 6 e\u00a012 dias. Com tal informa\u00e7\u00e3o em m\u00e3os, o PO tra\u00e7ou o plano de comunica\u00e7\u00e3o e promo\u00e7\u00e3o do novo recurso do produto. Se voc\u00ea ficou curioso em saber, a demanda foi entregue em 8 dias.<\/p>\n<p>Ao utilizar tal abordagem de proje\u00e7\u00e3o, o time e o PO se sentiram mais confort\u00e1veis e confiantes. Caso o PO tivesse imposto para o time que a nova demanda deveria ser entregue em 3 dias, com posse das informa\u00e7\u00f5es de percentil, o time teria insumos para dizer que seria muito dif\u00edcil entreg\u00e1-la pelo simples fato de que apenas 25% das demandas entregues foram conclu\u00eddas no prazo determinado (percentil 25).<\/p>\n<p>Fecho esse texto com algumas sugest\u00f5es:<\/p>\n<ol>\n<li>Crie hip\u00f3teses atrav\u00e9s de fatos que podem ser originados por dados quanti ou qualitativos.<\/li>\n<li>Projete cen\u00e1rios de entrega a partir de uma refer\u00eancia (hist\u00f3rico do time).<\/li>\n<li>Desenvolva pequenas entregas de valor, pois elas permitir\u00e3o que voc\u00ea mude de dire\u00e7\u00e3o mais r\u00e1pido.<\/li>\n<li>N\u00e3o acredite que m\u00e9trica de produto ou processo \u00e9 algo burocr\u00e1tico, pois elas servem como uma base para voc\u00ea construir um futuro melhor.<\/li>\n<\/ol>\n<p>E voc\u00ea? Como tem priorizado e projetado suas entregas? Quais m\u00e9tricas e abordagens tem utilizado? Compartilhe sua opini\u00e3o nos coment\u00e1rios abaixo. Estou curioso para aprender com o seu exemplo.<\/p>\n<p>Se est\u00e1 interessado saber mais como lidar com prazos de projetos de <em>software<\/em>\u00a0n\u00e3o deixe de conferir nosso <a href=\"http:\/\/pages.plataformatec.com.br\/ebook-como-lidar-com-prazos-em-projetos-de-software?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=ebook-como-lidar-com-prazos&amp;utm_content=cta-blog-post-middle\">e-book gratuito sobre o assunto<\/a>.<\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/ebook-como-lidar-com-prazos-em-projetos-de-software?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=ebook-como-lidar-com-prazos&amp;utm_content=cta-blog-post-bottom\" target=\"_blank&quot;&quot;\"><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-6158\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos.jpg\" alt=\"\" width=\"831\" height=\"147\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos.jpg 831w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos-300x53.jpg 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos-768x136.jpg 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><br \/>\n<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Se voc\u00ea gerencia um produto de software que j\u00e1 est\u00e1 em uso, \u00e9 bem prov\u00e1vel que j\u00e1 tenha se deparado com duas perguntas ao pensar em evolu\u00e7\u00f5es e melhorias da aplica\u00e7\u00e3o: Como prioriz\u00e1-las? Quando elas ser\u00e3o entregues? Neste blog post, teremos a oportunidade de discutir algumas abordagens que poder\u00e3o ajudar voc\u00ea a responder tais questionamentos &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/04\/dilemas-de-uma-equipe-de-produto-desenhando-uma-entrega\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,254,275,166,260,15],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6241"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6241"}],"version-history":[{"count":17,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6241\/revisions"}],"predecessor-version":[{"id":6666,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6241\/revisions\/6666"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6241"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6241"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6241"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}