{"id":7192,"date":"2018-02-19T10:50:33","date_gmt":"2018-02-19T13:50:33","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7192"},"modified":"2018-02-21T14:07:59","modified_gmt":"2018-02-21T17:07:59","slug":"a-confianca-como-aspecto-de-valorizacao-das-pessoas","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/02\/a-confianca-como-aspecto-de-valorizacao-das-pessoas\/","title":{"rendered":"A Confian\u00e7a Como Aspecto De Valoriza\u00e7\u00e3o Das Pessoas"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Imagine que voc\u00ea faz parte de um time de desenvolvimento de software. At\u00e9 aqui, muito f\u00e1cil! Agora, pense que esse mesmo time trabalha sob forte supervis\u00e3o, com cobran\u00e7as cont\u00ednuas e frequentes, hor\u00e1rio de trabalho r\u00edgido e vivencia as famosas frases \u201co que voc\u00ea est\u00e1 fazendo neste site?\u201d, \u201cpreciso disso agora!\u201d, entre tantas outras. H\u00e1 confian\u00e7a nas pessoas neste cen\u00e1rio? Pode at\u00e9 existir, mas ser\u00e1 que n\u00e3o h\u00e1 formas mais produtivas de gerenciamento?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Resgatando a raiz do \u00e1gil, no final de seu <\/span><a href=\"http:\/\/www.manifestoagil.com.br\/principios.html\"><span style=\"font-weight: 400;\">5\u00ba princ\u00edpio<\/span><\/a><span style=\"font-weight: 400;\">, h\u00e1 o termo de confiar que os indiv\u00edduos (pessoas) far\u00e3o seus respectivos trabalhos, contanto que estejam em ambientes apropriados. N\u00e3o faz sentido acreditar que a valoriza\u00e7\u00e3o deste time est\u00e1 &#8211; tamb\u00e9m &#8211; relacionada com a confian\u00e7a que a empresa deposita nele?<\/span><\/p>\n<h2><b>Trabalhando a quest\u00e3o nos projetos de software<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Vivemos em uma \u00e9poca em que um dos principais diferenciais competitivos das organiza\u00e7\u00f5es (e provavelmente o mais relevante deles) <\/span><b>s\u00e3o as pessoas<\/b><span style=\"font-weight: 400;\">. Logo, \u00e9 fundamental fomentar a colabora\u00e7\u00e3o entre elas, disponibilizando mecanismos de comunica\u00e7\u00e3o adequados e um ambiente prop\u00edcio para o trabalho (seguro e com todos os itens necess\u00e1rios), bem como, seguindo no tema desta newsletter, prover confian\u00e7a.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">No texto <\/span><a href=\"http:\/\/cio.com.br\/opiniao\/2013\/10\/28\/cresce-a-adesao-aos-metodos-ageis\/\"><span style=\"font-weight: 400;\">Cresce a ades\u00e3o aos m\u00e9todos \u00e1geis<\/span><\/a><span style=\"font-weight: 400;\">, Luca Bastos argumenta que \u201cAs metodologias \u00e1geis tamb\u00e9m t\u00eam como princ\u00edpio b\u00e1sico a valoriza\u00e7\u00e3o das pessoas\u201d. Ele tamb\u00e9m lembra que isso est\u00e1 expl\u00edcito no Manifesto \u00c1gil, em sua primeira proposi\u00e7\u00e3o, onde encontramos o trecho indiv\u00edduos e intera\u00e7\u00f5es mais que processos e ferramentas.<\/span><\/p>\n<p><b>Confiar <\/b><span style=\"font-weight: 400;\">que os membros do time do projeto s\u00e3o respons\u00e1veis, sabem da necessidade do cliente e da empresa, possuem maestria e que conhecem os objetivos do projeto s\u00e3o fatores que motivam a equipe e, al\u00e9m disso, <\/span><b>s\u00e3o formas de valoriza\u00e7\u00e3o<\/b><span style=\"font-weight: 400;\">. Isso n\u00e3o significa largar o projeto para as pessoas, muito menos aus\u00eancia de direcionamentos. O ponto \u00e9: o representante no papel de lideran\u00e7a deve estar sempre presente para conceder apoio e suporte para toda a equipe, bem como apresentar os objetivos do projeto, construindo o caminho do desenvolvimento da solu\u00e7\u00e3o de forma conjunta. Por outro lado, n\u00e3o precisa se preocupar demasiadamente com pontos que n\u00e3o s\u00e3o relevantes para o projeto, seguindo o exemplo apresentado no in\u00edcio deste texto.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">O artigo (em Ingl\u00eas) <\/span><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/11\/how-to-improve-trust-among-team-members\/\"><span style=\"font-weight: 400;\">Como melhorar a confian\u00e7a entre os membros da equipe<\/span><\/a><span style=\"font-weight: 400;\">, escrito por Lucas Colucci, aborda o aspecto da confian\u00e7a de forma mais aprofundada. Ele, que atua como Agile Consultant na Ptec, cita que \u201cEquipes com defici\u00eancia de confian\u00e7a tendem a demorar mais tempo para entregar suas tarefas\u201d. Trabalhar nas esferas da transpar\u00eancia, carga de trabalho e individualidade s\u00e3o complementos da confian\u00e7a existente na equipe, todas abordadas no artigo (vale a leitura!).<\/span><\/p>\n<h2><b>A colabora\u00e7\u00e3o como meio de alcan\u00e7ar a confian\u00e7a<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Disponibilizar meios de colabora\u00e7\u00e3o para a equipe (ferramentas, ambiente de trabalho adequado, etc.), e deixar que ela pr\u00f3pria se organize para trabalhar da melhor maneira poss\u00edvel para o projeto, s\u00e3o maneiras de demonstrar confian\u00e7a e, dessa forma, valorizar os colaboradores do time por suas capacidades (no caso de software, muito relacionadas com intelecto e criatividade).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Times auto-organizados precisam que seus membros colaborem em todos os aspectos do projeto, e muito! Pensando no desenvolvimento, onde as entradas s\u00e3o transformadas em sa\u00eddas atrav\u00e9s de um processo, a colabora\u00e7\u00e3o deve estar fortemente presente em todo o percurso. Uma forma de trabalhar este ponto \u00e9 promovendo a colabora\u00e7\u00e3o nos tr\u00eas n\u00edveis (entradas, processos e sa\u00eddas), como explicado por Wesley Zapellini no texto <\/span><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/08\/5-strategies-to-improve-software-development-workflow\/\"><span style=\"font-weight: 400;\">5 estrat\u00e9gias para melhorar o fluxo de trabalho de desenvolvimento de software<\/span><\/a><span style=\"font-weight: 400;\"> (em Ingl\u00eas).<\/span><\/p>\n<h2><b>E como os projetos de sua empresa est\u00e3o caminhando?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">A confian\u00e7a no time, seja ela incentivada, ou n\u00e3o, pela colabora\u00e7\u00e3o em todo o processo de desenvolvimento, n\u00e3o \u00e9 o \u00fanico meio de alcan\u00e7ar a valoriza\u00e7\u00e3o das pessoas em projetos. \u00c9, no ponto de vista deste artigo, um complemento relevante e indispens\u00e1vel em meio a v\u00e1rios outros aspectos (sal\u00e1rio, carreira, desafios, seguran\u00e7a, entre outros). Mas vale a pergunta: em seu projeto, h\u00e1 plena confian\u00e7a nas pessoas? Se a resposta for n\u00e3o, \u00e9 importante repensar este aspecto, pois ele provavelmente ir\u00e1 refletir nos resultados esperados do projeto.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><em>Este texto tamb\u00e9m faz parte da Cont\u00c1gil, nossa newsletter mensal com curadoria de conte\u00fado pela equipe da Plataformatec sobre\u00a0gerenciamento de projetos, metodologias e cultura \u00e1gil. Se voc\u00ea ainda n\u00e3o \u00e9 assinante, assine agora!\u00a0\ud83d\ude42<\/em><\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-6110\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png\" alt=\"\" width=\"831\" height=\"147\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png 831w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-300x53.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-768x136.png 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Imagine que voc\u00ea faz parte de um time de desenvolvimento de software. At\u00e9 aqui, muito f\u00e1cil! Agora, pense que esse mesmo time trabalha sob forte supervis\u00e3o, com cobran\u00e7as cont\u00ednuas e frequentes, hor\u00e1rio de trabalho r\u00edgido e vivencia as famosas frases \u201co que voc\u00ea est\u00e1 fazendo neste site?\u201d, \u201cpreciso disso agora!\u201d, entre tantas outras. H\u00e1 confian\u00e7a &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/02\/a-confianca-como-aspecto-de-valorizacao-das-pessoas\/\">\u00bb<\/a><\/p>\n","protected":false},"author":61,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,284,265,157],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7192"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7192"}],"version-history":[{"count":5,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7192\/revisions"}],"predecessor-version":[{"id":7199,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7192\/revisions\/7199"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7192"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7192"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7192"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}