{"id":5922,"date":"2016-12-01T16:10:54","date_gmt":"2016-12-01T18:10:54","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=5922"},"modified":"2016-12-02T14:50:02","modified_gmt":"2016-12-02T16:50:02","slug":"nos-nao-somos-necessariamente-ageis-mas-com-certeza-somos-ageis","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2016\/12\/nos-nao-somos-necessariamente-ageis-mas-com-certeza-somos-ageis\/","title":{"rendered":"N\u00f3s n\u00e3o somos necessariamente \u00c1geis&#8230; Mas com certeza somos \u00e1geis!"},"content":{"rendered":"<p>Voc\u00ea pode ter ouvido essa express\u00e3o anteriormente e, se a ouviu, o t\u00edtulo do post pode ter dado informa\u00e7\u00e3o o suficiente para entender como a Plataformatec trabalha. No entanto, se nunca a ouviu antes ou se ainda se interessa por como n\u00f3s trabalhamos, <em>&#8220;senta que l\u00e1 vem hist\u00f3ria&#8221;<\/em> &#8211; R\u00e1-Tim-Bum 1990.<\/p>\n<h2>Agile, agile. Tom\u0101to, tom\u0103to?<\/h2>\n<p>Voc\u00ea pode estar se perguntando: <em>&#8220;Por que raios ele est\u00e1 diferenciando duas palavras id\u00eanticas, enquanto a \u00fanica diferen\u00e7a entre elas \u00e9 o A mai\u00fasculo?&#8221;<\/em>. Bom, voc\u00ea est\u00e1 certo&#8230; elas deveriam significar a mesma coisa. Mas depois de 2001, o ano do Manifesto \u00c1gil, tudo mudou. Mas primeiramente, vamos falar um pouco de hist\u00f3ria.<\/p>\n<h3>O malvado modelo Cascata (<em>Waterfall<\/em>)<\/h3>\n<p>O modo com o qual nossa ind\u00fastria rodava projetos de software antigamente \u00e9 um tanto quanto antiquado. Costumava funcionar com projetos que possu\u00edam baixa probabilidade de mudan\u00e7a ao seu decorrer e, portanto, era mais f\u00e1cil de planejar tudo no come\u00e7o do projeto. No entanto, a frase que a m\u00e3e de Forrest Gump usou para definir a vida (<em>&#8220;A vida \u00e9 como uma caixa de chocolates, voc\u00ea nunca sabe o que vai encontrar&#8221;<\/em> &#8211; Forrest Gump, 1994) tamb\u00e9m vale para projetos de software.<\/p>\n<p>Acontece que a quantidade de mudan\u00e7as durante a vida de um projeto \u00e9 enorme, e a maioria das coisas que s\u00e3o definidas anteriormente geralmente perdem seu valor e n\u00e3o s\u00e3o mais necess\u00e1rias.<\/p>\n<h3>A revolu\u00e7\u00e3o \u00e1gil<\/h3>\n<p>Para que fosse poss\u00edvel entregar solu\u00e7\u00f5es mais rapidamente e melhor (com mais agilidade), uma revolu\u00e7\u00e3o foi iniciada na \u00e1rea de desenvolvimento de software. Entre os anos 1990 e 2000, muitas metodologias foram inventadas e o modelo Cascata come\u00e7ou a se tornar obsoleto.<\/p>\n<p>Para generalizar a inten\u00e7\u00e3o de todas essas novas metodologias, algumas pessoas se reuniram em Snowbird, perto de Salt Lake City em Utah (EUA), e assinaram um manifesto com alguns princ\u00edpios que eles acreditavam serem os pilares do desenvolvimento de software \u00e1gil. Esse manifesto ficou conhecido como Manifesto \u00c1gil, e aqui foi onde come\u00e7amos a usar a palavra com A mai\u00fasculo.<\/p>\n<h3>Metodologias \u00c1geis<\/h3>\n<p>Depois do Manifesto \u00c1gil, muitas pessoas come\u00e7aram a combinar diferentes metodologias &#8220;modernas&#8221; em uma caixinha chamada de Metodologias \u00c1geis. Com isso, <em>eXtreme Programming<\/em>, <em>Scrum<\/em>, <em>Kanban<\/em>, <em>Lean<\/em>, AUP, FDD entre outras, se tornaram partes de uma grande caixa m\u00e1gica.<\/p>\n<p>Desde ent\u00e3o, todos que falam de \u00c1gil, est\u00e3o se referindo \u00e0 caixa de ferramentas e metodologias que nasceram com a inten\u00e7\u00e3o de serem \u00e1geis.<\/p>\n<h2>O mal entendido<\/h2>\n<p>Quando n\u00f3s falamos que somos \u00c1geis (ou at\u00e9 mesmo \u00e1gil, j\u00e1 que estamos falando e n\u00e3o escrevendo), as pessoas quase sempre nos perguntam: &#8220;Ah! Voc\u00ea usa Kanban ou Scrum?&#8221;. \u00c1gil se tornou sin\u00f4nimo dessas pr\u00e1ticas. Mas e se n\u00f3s estivermos sendo \u00e1geis sem seguir nenhum processo previamente documentado?<\/p>\n<blockquote style=\"border-left: solid 4px #bbb; padding-left: 15px; color: #888;\"><p>\n    <cite style=\"font-size:1.3em;\">Eles podem tirar as nossas vidas, mas eles nunca ir\u00e3o tirar a nossa liberdade.<\/cite><br \/>\n    \u2014 Cora\u00e7\u00e3o Valente, 1995\n<\/p><\/blockquote>\n<p>Sim, estou sendo dram\u00e1tico. Mas sim, n\u00f3s n\u00e3o seguimos estritamente nenhuma dessas metodologias, mesmo que tenhamos estudado a maioria delas avidamente.<\/p>\n<h2>O Jeito Plataformatec<\/h2>\n<p>N\u00f3s gostamos, e seguimos, a maioria das ideias do Manifesto \u00c1gil. N\u00f3s reagimos r\u00e1pido em rela\u00e7\u00e3o \u00e0 mudan\u00e7as, mantemos uma rela\u00e7\u00e3o constante e saud\u00e1vel com nosso cliente, aplicamos entrega cont\u00ednua e muito mais. Mas a ideia por tr\u00e1s de seguir tais metodologias n\u00e3o \u00e9 para sermos chamados de \u00c1geis, mas para trazer agilidade \u00e0 nossa cultura. N\u00f3s queremos entregar software de maneira r\u00e1pida e certeira.<\/p>\n<p>Portanto, n\u00f3s definimos tr\u00eas valores que seguimos no decorrer de um projeto:<\/p>\n<ul>\n<li>\n        <strong>Previsibilidade<\/strong><br \/>\n        N\u00f3s queremos ser capazes de prever o m\u00e1ximo poss\u00edvel, e isso nos fez construir e utilizar uma s\u00e9rie de m\u00e9tricas e modelos para melhorar nosso trabalho:<\/p>\n<ul style=\"-webkit-margin-before: -1em;-webkit-margin-after: 1em;-webkit-margin-start: 0px;-webkit-margin-end: 0px;-webkit-padding-start: 40px;\">\n<li>\n                <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/03\/why-we-love-metrics-cumulative-flow-diagrams\/\">Cumulative flow diagrams<\/a>\n            <\/li>\n<li>\n                <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/02\/why-we-love-metrics-throughput-and-burnup-charts\/\">Vaz\u00e3o e gr\u00e1ficos Burnup<\/a>\n            <\/li>\n<li>\n                <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/02\/why-we-love-metrics-learning-with-lead-time\/\">Lead time<\/a>\n            <\/li>\n<li>\n                <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/10\/lead-time-experiment-calculating-lead-time-of-the-whole-process\/\">Lead Time do processo inteiro<\/a>\n            <\/li>\n<li>\n                <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/09\/case-study-of-a-wip-limit-implementation-why-when-and-how-to-use-wip-limits\/\">Limite de WIP<\/a>\n            <\/li>\n<li>\n                <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/08\/forecasting-software-projects-completion-date-through-monte-carlo-simulation\/\">Proje\u00e7\u00f5es estat\u00edsticas de entrega de projeto<\/a>\n            <\/li>\n<\/ul>\n<\/li>\n<li>\n        <strong>Visibilidade<\/strong><br \/>\n        Que visibilidade e transpar\u00eancia s\u00e3o essenciais para um projeto, todos j\u00e1 sabem. E n\u00f3s concordamos, mas vamos um pouco mais a fundo: para n\u00f3s, visibilidade n\u00e3o \u00e9 o fim, mas o meio para um fim, que \u00e9 suportar a tomada de decis\u00e3o gerando a\u00e7\u00f5es. N\u00f3s dividimos essa estrat\u00e9gia em:<\/p>\n<ul style=\"-webkit-margin-before: -1em;-webkit-margin-after: 1em;-webkit-margin-start: 0px;-webkit-margin-end: 0px;-webkit-padding-start: 40px;\">\n<li>\n                <strong>Monitoramento<\/strong><br \/>\n                Constantemente monitorar nossas m\u00e9tricas para ajudar nosso cliente e nosso time a entender a sa\u00fade do projeto.\n            <\/li>\n<li>\n                <strong>An\u00e1lise<\/strong><br \/>\n                Se uma de nossas m\u00e9tricas est\u00e1 fora do esperado, significa que precisamos agir.\n            <\/li>\n<li>\n                <strong>A\u00e7\u00e3o<\/strong><br \/>\n                Todas as semanas n\u00f3s mandamos um relat\u00f3rio com tais m\u00e9tricas para nossos clientes, juntamente com an\u00e1lises e sugest\u00f5es de poss\u00edveis a\u00e7\u00f5es que podemos tomar juntos para superar a situa\u00e7\u00e3o.\n            <\/li>\n<\/ul>\n<\/li>\n<li>\n        <strong>Excel\u00eancia<\/strong><br \/>\n        Apenas prever e ter visibilidade do processo n\u00e3o \u00e9 o suficiente. Al\u00e9m disso, n\u00f3s buscamos a excel\u00eancia. N\u00f3s somos nerds que estudam muito para entregar a melhor solu\u00e7\u00e3o poss\u00edvel. Um exemplo desse engajamento \u00e9 o fato de termos quatro livros escritos por pessoas da Plataformatec (e dois ainda por vir):<\/p>\n<ul style=\"-webkit-margin-before: -1em;-webkit-margin-after: 1em;-webkit-margin-start: 0px;-webkit-margin-end: 0px;-webkit-padding-start: 40px;\">\n<li>\n                <a href=\"https:\/\/pragprog.com\/book\/phoenix\/programming-phoenix\">Programming Phoenix<\/a>\n            <\/li>\n<li>\n                <a href=\"https:\/\/pragprog.com\/book\/jvrails2\/crafting-rails-4-applications\">Crafting Rails 4 Applications<\/a>\n            <\/li>\n<li>\n                <a href=\"https:\/\/www.casadocodigo.com.br\/products\/livro-cucumber-rspec-tdd-bdd\">Cucumber e RSpec<\/a>\n            <\/li>\n<li>\n                <a href=\"https:\/\/www.casadocodigo.com.br\/products\/livro-html-css\">HTML5 e CSS3<\/a>\n            <\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2>Conclus\u00e3o<\/h2>\n<p>N\u00f3s n\u00e3o podemos afirmar que somos \u00c1geis, j\u00e1 que n\u00e3o seguimos \u00e0 risca nenhuma metodologia. No entanto, podemos afirmar com certeza que somos \u00e1geis. Apresentamos aqui apenas um pouco de como fazemos projetos de software na Plataformatec. Mais blog posts est\u00e3o por vir para explicar em mais detalhes o que fazemos. \ud83d\ude09<\/p>\n<blockquote style=\"border-left: solid 4px #bbb; padding-left: 15px; color: #888;\"><p>\n    <cite style=\"font-size:1.3em;\">I&#8217;ll be back.<\/cite><br \/>\n    \u2014 The Terminator, 1984\n<\/p><\/blockquote>\n<p>E voc\u00ea? Se considera \u00e1gil ou \u00c1gil? Deixe seus coment\u00e1rios abaixo!<\/p>\n<hr>\n<div style=\"margin:20px 0 60px;\">\n<a href=\"http:\/\/pages.plataformatec.com.br\/spreadsheet-forecasting-software-project-completion-date?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=monte-carlo-spreadsheet&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\"><img decoding=\"async\" class=\"aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/08\/forecasting-software-project-cta.png\" alt=\"Download: Forecasting software project through Monte Carlo simulation (FREE spreadsheet)\"\/><\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Voc\u00ea pode ter ouvido essa express\u00e3o anteriormente e, se a ouviu, o t\u00edtulo do post pode ter dado informa\u00e7\u00e3o o suficiente para entender como a Plataformatec trabalha. No entanto, se nunca a ouviu antes ou se ainda se interessa por como n\u00f3s trabalhamos, &#8220;senta que l\u00e1 vem hist\u00f3ria&#8221; &#8211; R\u00e1-Tim-Bum 1990. Agile, agile. Tom\u0101to, tom\u0103to? &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2016\/12\/nos-nao-somos-necessariamente-ageis-mas-com-certeza-somos-ageis\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,254,243],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/5922"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=5922"}],"version-history":[{"count":9,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/5922\/revisions"}],"predecessor-version":[{"id":5933,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/5922\/revisions\/5933"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=5922"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=5922"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=5922"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}