{"id":8868,"date":"2019-03-27T15:30:14","date_gmt":"2019-03-27T18:30:14","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=8868"},"modified":"2019-03-27T11:34:03","modified_gmt":"2019-03-27T14:34:03","slug":"chegando-no-kanban-completo-com-o-proto-kanban","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/03\/chegando-no-kanban-completo-com-o-proto-kanban\/","title":{"rendered":"Chegando no Kanban Completo com o Proto-Kanban"},"content":{"rendered":"<p>\u00c9 f\u00e1cil cair na armadilha de aplicar alguns conceitos e chamar de Kanban. Muitos agilistas j\u00e1 ouviram a barb\u00e1rie: &#8220;n\u00e3o cabe na sprint, vamos fazer um Kanban&#8221;, quando a demanda n\u00e3o se aplica num contexto Scrum e a ideia \u00e9 s\u00f3 jogar as coisas num board sem olhar timebox.<\/p>\n<p>Mas a ideia deste post \u00e9 justamente mostrar como o proto-Kanban pode ajudar um time ou empresa \u00e0 chegar no Kanban completo.<\/p>\n<hr>\n<p>Pesquisando alguns conte\u00fados um pouco mais avan\u00e7ados sobre Kanban, encontrei v\u00e1rias refer\u00eancias ao Proto-Kanban, na maioria das vezes recomendando at\u00e9 &#8220;fugir&#8221; dele.<\/p>\n<p>Proto, do grego pr\u014dto- (de pr\u014dtos), \u00e9 o <em>original<\/em>, ou <em>em estado inicial<\/em>. Mas e no contexto de Kanban?<\/p>\n<p>No artigo <a href=\"https:\/\/leankanban.com\/patterns-of-kanban-maturity\/\" target=\"_blank\" rel=\"noopener noreferrer\">&#8220;Patterns of Kanban Maturity&#8221;<\/a>, David Anderson, criador do m\u00e9todo Kanban como usamos hoje em desenvolvimento de software (lembrando que ele se aplica a todo trabalho de conhecimento, n\u00e3o apenas software), mostra v\u00e1rios tipo de boards Kanban que encontrou nos mais de 10 anos em que pratica o m\u00e9todo, e como os relaciona com diferentes n\u00edveis de maturidade das organiza\u00e7\u00f5es.<\/p>\n<p>Ao abordar esses diferentes tipos de quadro, ele usa o termo &#8220;proto-Kanban&#8221; para classific\u00e1-los, e nos mostra que tal termo foi cunhado por Richard Tuner, engenheiro de Software, ao notar que muitas implementa\u00e7\u00f5es de Kanban inicialmente julgadas como parciais acabaram por evoluir em sistemas Kanban completos. O termo Proto-Kanban se aplicaria ent\u00e3o \u00e0 sistemas Kanban incompletos, mas com a inten\u00e7\u00e3o de se tornarem Kanbans completos. Sem essa inten\u00e7\u00e3o, nas palavras do pr\u00f3prio Anderson, o quadro &#8220;\u00e9 apenas um board numa parede para visualizar algo&#8221;.<\/p>\n<p>E na pr\u00e1tica, o que \u00e9 o proto-Kanban?<br \/>\nN\u00e3o \u00e9 um Kanban completo (essa parte n\u00f3s entendemos pelo par\u00e1grafo acima), mas ele tem alguns elementos que devem ser levados em considera\u00e7\u00e3o:<\/p>\n<ul>\n<li>Visualiza\u00e7\u00e3o de trabalho em progresso e seu fluxo em um quadro<\/li>\n<li><strong>Podem<\/strong> existir algumas pol\u00edticas expl\u00edcitas e\/ou algumas <a href=\"http:\/\/blog.plataformatec.com.br\/2019\/01\/tipos-de-demanda-e-classes-de-servico-afinal-e-tudo-a-mesma-coisa\/\" target=\"_blank\" rel=\"noopener noreferrer\">classes de servi\u00e7o<\/a><\/li>\n<li><strong>Podem<\/strong> estabelecer-se alguns ciclos de feedback<\/li>\n<\/ul>\n<p>O fato mais importante do proto-Kanban \u00e9 justamente o que lhe proporciona o nome: <strong>a inten\u00e7\u00e3o de se tornar um Kanban completo<\/strong>.<\/p>\n<h3>Mas como funcionaria o proto-Kanban como ferramenta para implementa\u00e7\u00e3o do Kanban completo?<\/h3>\n<p>O <a href=\"https:\/\/jeronimopalacios.com\/2018\/05\/proto-kanban-que-es-y-sus-beneficios\/\" target=\"_blank\" rel=\"noopener noreferrer\">post<\/a> em espanhol de Nacho Navarro mostra muito bem como aplicar o proto-Kanban como processo de implanta\u00e7\u00e3o do Kanban.<\/p>\n<ul>\n<li>Segundo ele, dada a maturidade da equipe ou organiza\u00e7\u00e3o, o time pode avan\u00e7ar por algumas fases: Personal Kanban: Um quadro individual para cada pessoa do time visualizar o trabalho que est\u00e1 fazendo<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8871 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-1.jpg\" alt=\"\" width=\"962\" height=\"517\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-1.jpg 962w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-1-300x161.jpg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-1-768x413.jpg 768w\" sizes=\"(max-width: 962px) 100vw, 962px\" \/>Muitas vezes, o quadro tem colunas pouco definidas, mas isso \u00e9 ok, \u00e9 uma primeira ideia, est\u00e1 promovendo visualiza\u00e7\u00e3o do trabalho.<\/li>\n<li>Personal Kanban Agregado: \u00c9 um \u00fanico quadro, mas com uma raia (lane) para cada pessoa<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8872 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-2.jpg\" alt=\"\" width=\"821\" height=\"497\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-2.jpg 821w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-2-300x182.jpg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/03\/Quadro-Bruno-2-768x465.jpg 768w\" sizes=\"(max-width: 821px) 100vw, 821px\" \/><\/li>\n<li>Team Kanban: finalmente acaba a distin\u00e7\u00e3o por pessoa. O foco muda de &#8220;quem est\u00e1 fazendo o que&#8221; para &#8220;o que est\u00e1 sendo feito&#8221;<\/li>\n<li>Introdu\u00e7\u00e3o de WIP Limit por pessoa: \u00c9 um come\u00e7o \u00e0 gest\u00e3o de trabalho ao inv\u00e9s de gest\u00e3o de pessoas<\/li>\n<\/ul>\n<p>Claro, sempre podem surgir discuss\u00f5es e implementa\u00e7\u00f5es de tipos de demanda, classes de servi\u00e7o, pol\u00edticas expl\u00edcitas e introdu\u00e7\u00e3o de ciclos de feedback.<\/p>\n<p>No mesmo post, Navarro enumera algumas das vantagens dessa abordagem:<\/p>\n<ul>\n<li>Com r\u00e1pida visualiza\u00e7\u00e3o do trabalho, melhores decis\u00f5es s\u00e3o tomadas mais cedo<\/li>\n<li>Fica poss\u00edvel disseminar a cultura de <strong>sistema puxado<\/strong> e colher seus benef\u00edcios<\/li>\n<li>Possibilidade de gerar e analisar m\u00e9tricas b\u00e1sicas, como <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-o-que-lead-time-fala-sobre-seu-projeto\/\" target=\"_blank\" rel=\"noopener noreferrer\">leadtime<\/a> e <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-throughput-e-graficos-burnup\/\" target=\"_blank\" rel=\"noopener noreferrer\">throughput<\/a><\/li>\n<\/ul>\n<p>Um problema em tentativas de implementa\u00e7\u00e3o de Kanban \u00e9 conseguir deslocar o time de suas atividades para que todos conceitos sejam definidos e implementados. Muitas vezes os respons\u00e1veis pelo time v\u00e3o sentir esse tempo como &#8220;perdido&#8221;.<\/p>\n<p>Usando o proto-Kanban como m\u00e9todo, assume-se que haver\u00e1 acompanhamento por um tempo bem maior por parte do profissional de implanta\u00e7\u00e3o de Kanban. N\u00e3o se pode assumir como um pacote fechado de dura\u00e7\u00e3o determinada&#8230; Mas n\u00e3o reserva tanto tempo do time inicialmente.<\/p>\n<p>\u00c9 a\u00ed que o proto-Kanban pode ser uma solu\u00e7\u00e3o. Ele aceita que o processo funcione com o Kanban incompleto e v\u00e1 evoluindo aos poucos. \u00c9 menos disruptivo. Se pensarmos em kaizen vs kaikaku, o evolucion\u00e1rio vs o revolucion\u00e1rio, o proto-Kanban como processo de transi\u00e7\u00e3o se encaixa mais no primeiro.<\/p>\n<p>E a\u00ed, ser\u00e1 que o proto-Kanban n\u00e3o \u00e9 o empurr\u00e3o que faltava pra aplicar o Kanban no seu time?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u00c9 f\u00e1cil cair na armadilha de aplicar alguns conceitos e chamar de Kanban. Muitos agilistas j\u00e1 ouviram a barb\u00e1rie: &#8220;n\u00e3o cabe na sprint, vamos fazer um Kanban&#8221;, quando a demanda n\u00e3o se aplica num contexto Scrum e a ideia \u00e9 s\u00f3 jogar as coisas num board sem olhar timebox. Mas a ideia deste post \u00e9 &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/03\/chegando-no-kanban-completo-com-o-proto-kanban\/\">\u00bb<\/a><\/p>\n","protected":false},"author":78,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8868"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/78"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=8868"}],"version-history":[{"count":18,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8868\/revisions"}],"predecessor-version":[{"id":8890,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8868\/revisions\/8890"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=8868"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=8868"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=8868"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}