{"id":7349,"date":"2018-04-24T15:21:35","date_gmt":"2018-04-24T18:21:35","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7349"},"modified":"2018-04-24T15:22:52","modified_gmt":"2018-04-24T18:22:52","slug":"filas-e-seus-impactos-no-processo","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/04\/filas-e-seus-impactos-no-processo\/","title":{"rendered":"Um mal invis\u00edvel: filas e seus impactos no processo"},"content":{"rendered":"<p>\u201cFestina lente.&#8221;\u00a0&#8212;\u00a0<em>&#8220;Apressa-te lentamente&#8221;,\u00a0<\/em>assim Don Reinertsen inicia o cap\u00edtulo sobre filas no livro &#8220;The Principles of Product Development Flow&#8221;.<\/p>\n<p>A express\u00e3o foi utilizada para referenciar a f\u00e1bula &#8220;A Lebre e a Tartaruga&#8221;. Na hist\u00f3ria, uma tartaruga vence a corrida contra uma lebre muito mais r\u00e1pida. A lebre, confiante da vit\u00f3ria, acabou parando para uma soneca.<\/p>\n<p>H\u00e1 uma s\u00e9rie de morais ligadas a esta f\u00e1bula, e a que Reinertsen nos traz \u00e9: eliminar per\u00edodos de inatividade pode trazer mais resultados para o processo do que acelerar as atividades que j\u00e1 fazem parte dele.<\/p>\n<p>&#8220;Inatividade&#8221; refere-se ao tempo que uma demanda fica em uma\u00a0<strong>fila<\/strong>\u00a0at\u00e9 que algu\u00e9m volte a trabalhar nela. Exemplo: uma\u00a0<em>user story<\/em>\u00a0aguardando para ser testada. &#8212; \u00a0N\u00e3o confundir com a inatividade de um membro da equipe tirando uma soneca no meio da tarde, assim como a lebre :D.<\/p>\n<p>No Sistema Toyota de Produ\u00e7\u00e3o, uma das bases para o\u00a0<em>Lean Manufacturing<\/em>, Taiichi Ohno prop\u00f4s que tudo que n\u00e3o agrega valor ao cliente \u00e9 desperd\u00edcio e identificou sete principais causas de desperd\u00edcio na manufatura, entre elas, espera em filas e estoques.<\/p>\n<p>No\u00a0livro &#8220;<a href=\"https:\/\/www.amazon.com.br\/Lean-Software-Development-Agile-Toolkit\/dp\/0321150783\">Lean Software Development<\/a>&#8220;, Mary e Tom Poppendieck,\u00a0adaptaram os sete desperd\u00edcios para o contexto de desenvolvimento de produtos de software\u00a0e, novamente, estava l\u00e1: espera em filas e trabalho parcialmente feito (uma demanda que j\u00e1 teve esfor\u00e7o, por exemplo, de design e ainda n\u00e3o foi desenvolvida), um paralelo com os estoques da manufatura.<\/p>\n<p>Don Reinertsen \u00e9 mais enf\u00e1tico: filas s\u00e3o as maiores causadoras de processos com baixa performance. Para ele, as filas:<\/p>\n<ul>\n<li>aumentam\u00a0<em>lead time<\/em>, custos do processo, variabilidade e riscos;<\/li>\n<li>reduzem efici\u00eancia do processo, motiva\u00e7\u00e3o da equipe e tornam o feedback mais lento, o que compromete a qualidade e propicia bugs.<\/li>\n<\/ul>\n<p>Com tantas evid\u00eancias, o que voc\u00ea pode fazer para minimizar os efeitos das filas no processo? A minha dica \u00e9:\u00a0<strong>acompanhe e controle o tamanho das filas em seu fluxo de trabalho<\/strong>.<\/p>\n<p>Se voc\u00ea n\u00e3o tem visibilidade das filas no seu\u00a0<em>workflow<\/em>, crie etapas intermedi\u00e1rias. Por exemplo, adicione uma etapa entre &#8220;desenvolvimento&#8221;\u00a0e &#8220;testes&#8221;\u00a0para acomodar as demandas que j\u00e1 foram desenvolvidas e est\u00e3o aguardando para serem testadas. Assim, fica evidente as demandas em progresso e as que est\u00e3o paradas, facilitando a identifica\u00e7\u00e3o de gargalos.<\/p>\n<p>Ap\u00f3s isso, acompanhe\u00a0suas filas pelos gr\u00e1ficos\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2016\/03\/why-we-love-metrics-cumulative-flow-diagrams\/\"><em>Cumulative Flow Diagram<\/em>\u00a0e\u00a0<em>Lead Time Breakdown<\/em><\/a>. O gr\u00e1fico CFD permite que voc\u00ea identifique gargalos e aumento no tamanho das filas; com LT Breakdown voc\u00ea identifica demandas h\u00e1 muito tempo em uma fila ou bloqueadas.<\/p>\n<p>Por fim, definir limites de trabalho em progresso (<a href=\"http:\/\/blog.plataformatec.com.br\/2016\/09\/case-study-of-a-wip-limit-implementation-why-when-and-how-to-use-wip-limits\">WIP<\/a>) para cada uma das etapas do seu fluxo, incluindo as filas. Dessa forma, evita-se que demandas sejam iniciadas antes que o trabalho em progresso seja finalizado, sobrecarregando ainda mais o sistema, especialmente, as filas.<\/p>\n<p><em>Este texto tamb\u00e9m faz parte da Cont\u00c1gil, nossa newsletter mensal com curadoria de conte\u00fado pela equipe da Plataformatec sobre\u00a0gerenciamento de projetos, metodologias e cultura \u00e1gil. Se voc\u00ea ainda n\u00e3o \u00e9 assinante, assine agora!\u00a0\ud83d\ude42<\/em><\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=contagil-subscription&amp;utm_content=banner-sidebar\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-7432\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar.png\" alt=\"\" width=\"867\" height=\"153\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar.png 831w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar-300x53.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar-768x136.png 768w\" sizes=\"(max-width: 867px) 100vw, 867px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u201cFestina lente.&#8221;\u00a0&#8212;\u00a0&#8220;Apressa-te lentamente&#8221;,\u00a0assim Don Reinertsen inicia o cap\u00edtulo sobre filas no livro &#8220;The Principles of Product Development Flow&#8221;. A express\u00e3o foi utilizada para referenciar a f\u00e1bula &#8220;A Lebre e a Tartaruga&#8221;. Na hist\u00f3ria, uma tartaruga vence a corrida contra uma lebre muito mais r\u00e1pida. A lebre, confiante da vit\u00f3ria, acabou parando para uma soneca. H\u00e1 &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/04\/filas-e-seus-impactos-no-processo\/\">\u00bb<\/a><\/p>\n","protected":false},"author":62,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,284],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7349"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/62"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7349"}],"version-history":[{"count":4,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7349\/revisions"}],"predecessor-version":[{"id":7474,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7349\/revisions\/7474"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7349"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7349"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7349"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}