{"id":6102,"date":"2017-02-10T09:30:54","date_gmt":"2017-02-10T11:30:54","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6102"},"modified":"2017-02-10T15:28:51","modified_gmt":"2017-02-10T17:28:51","slug":"contagil-a-nossa-nova-newsletter-mensal-de-agilidade","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/02\/contagil-a-nossa-nova-newsletter-mensal-de-agilidade\/","title":{"rendered":"Cont\u00c1gil: A nossa nova newsletter mensal de agilidade"},"content":{"rendered":"<div style=\"border:solid 1px #FFE041; background-color:#FFF9CA; padding:20px; font:13px Gotham, Helvetica Neue, Helvetica, Arial,' sans-serif';\"><strong>TL;DR<\/strong>: Criamos uma nova newsletter mensal com conte\u00fados sobre agilidade, a <a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=contagil-subscription&#038;utm_content=link1\" style=\"text-decoration: underline\">Cont\u00c1gil<\/a>! Entre e se inscreva!<\/div>\n<p>Como voc\u00eas devem ter percebido, nos \u00faltimos anos a Plataformatec tem investido cada vez mais na \u00e1rea de processos. A quantidade de conte\u00fado sobre agilidade que produzimos em 2016 foi superior ao que fizemos em todos os anos anteriores <strong>somados<\/strong>!<\/p>\n<p>No entanto, temos muito mais a falar do que conseguimos escrever&#8230; Temos muitos assuntos interessantes, abordados no contato di\u00e1rio com nossos clientes, e sentimos que precisamos compartilhar ainda mais as novidades que presenciamos. Com isso, veio a ideia da newsletter mensal de agilidade!<\/p>\n<p>O prop\u00f3sito da newsletter \u00e9 compartilhar com voc\u00eas blog-posts, artigos e conte\u00fado em geral que nos impulsionam e nos ajudam a superar os desafios que encontramos no dia-a-dia.<\/p>\n<h2><em>Ah eu sou dev, o que isso agregar\u00e1 para mim?<\/em><\/h2>\n<p>Tenha voc\u00ea um papel de Dev, Product Owner, Gerente de Projetos, Scrum Master, CTO, CEO ou qualquer outro relacionado a tecnologia, essa newsletter \u00e9 para voc\u00ea. Para voc\u00ea que quer desenvolver softwares melhores de maneira mais \u00e1gil. Para voc\u00ea que precisa priorizar melhor as features do seu produto, para gerar valor mais r\u00e1pido para sua empresa. Pra voc\u00ea que precisa de mais ferramentas para engajar o time e fazer com que a cad\u00eancia de entrega seja mantida. Seja qual for o seu cargo, se voc\u00ea tem tecnologia no cora\u00e7\u00e3o e agilidade na veia, essa newsletter \u00e9 para voc\u00ea.<\/p>\n<div style=\"margin:20px 0\">\n<a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=contagil-subscription&#038;utm_content=cta-blog-post-middle\" target=\"_blank\"><img decoding=\"async\" class=\"aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/banner-lateral-blog.png\" alt=\"Quero assinar a Cont\u00c1gil Newsletter\"\/><\/a>\n<\/div>\n<h2><em>Mas Colucci, o conte\u00fado ser\u00e1 sobre Scrum? Kanban? XP?<\/em><\/h2>\n<p>Bom, como dissemos em nosso blog post &#8220;<a href=\"http:\/\/blog.plataformatec.com.br\/2016\/12\/nos-nao-somos-necessariamente-ageis-mas-com-certeza-somos-ageis\/\">N\u00f3s n\u00e3o somos necessariamente \u00c1geis\u2026 Mas com certeza somos \u00e1geis!<\/a>&#8220;, n\u00f3s consideramos que o futuro do \u00e1gil n\u00e3o est\u00e1 em seguir uma ou outra metodologia, e sim adaptar ao seu contexto as pr\u00e1ticas que impulsionem seu processo de desenvolvimento. Com isso, n\u00e3o vamos nos prender \u00e0 metodologias na hora de compartilhar tais conte\u00fados. Vamos focar em apresentar conte\u00fado de qualidade, seja de XP, Scrum, Kanban, PMBOK ou outra vertente.<\/p>\n<h2><em>Ent\u00e3o ser\u00e1 apenas uma curadoria de conte\u00fado? Por que n\u00e3o uso o Google?<\/em><\/h2>\n<p>Google, e afins, s\u00e3o \u00f3timas fontes de informa\u00e7\u00f5es (acredito que sem Google, Stackoverflow e Wikipedia o mundo ainda estaria dependendo de m\u00e1quinas a vapor), mas para us\u00e1-los voc\u00ea precisa saber o que n\u00e3o sabe. A nossa inten\u00e7\u00e3o \u00e9 apresentar conte\u00fados que voc\u00ea n\u00e3o sabia que precisava, trazer um grau de <a href=\"http:\/\/www.dicionarioinformal.com.br\/serendipidade\/\">serendipidade<\/a> \u00e0 newsletter.<\/p>\n<p>No entanto, n\u00e3o \u00e9 apenas uma curadoria de conte\u00fado. Em cada edi\u00e7\u00e3o, um de nossos Agile Consultants vai desenvolver sua an\u00e1lise, opini\u00e3o e vis\u00e3o acerca de um tema \u00c1gil, baseando-se na experi\u00eancia da Plataformatec de 8 anos entregando projetos de software e prestando consultoria sobre agile.<\/p>\n<h2><em>Mas eu n\u00e3o quero minha caixa de entrada do email lotada!<\/em><\/h2>\n<p>E nem ter\u00e1! A nossa newsletter ser\u00e1 mensal! Entre um m\u00eas e outro voc\u00ea ter\u00e1 tempo de sobra para amadurecer o conte\u00fado compartilhado.<\/p>\n<h2><em>E quanto isso vai me custar?<\/em><\/h2>\n<p>Nada. Zero. &#8220;De gratis&#8221;. &#8220;0800&#8221;. \ud83d\ude42<\/p>\n<h2><em>Como me inscrevo?!<\/em><\/h2>\n<p>Se voc\u00ea se interessou e deseja se inscrever, basta entrar no link da <a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=contagil-subscription&amp;utm_content=link2\">Cont\u00c1gil<\/a> e colocar seu email. F\u00e1cil, r\u00e1pido e indolor.<\/p>\n<div style=\"margin:20px 0 60px;\">\n<a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=contagil-subscription&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\"><img decoding=\"async\" style=\"max-width:95%;\" class=\"aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png\" alt=\"Quero assinar a Cont\u00c1gil Newsletter\"\/><\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>TL;DR: Criamos uma nova newsletter mensal com conte\u00fados sobre agilidade, a Cont\u00c1gil! Entre e se inscreva! Como voc\u00eas devem ter percebido, nos \u00faltimos anos a Plataformatec tem investido cada vez mais na \u00e1rea de processos. A quantidade de conte\u00fado sobre agilidade que produzimos em 2016 foi superior ao que fizemos em todos os anos anteriores &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/02\/contagil-a-nossa-nova-newsletter-mensal-de-agilidade\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,52],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6102"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6102"}],"version-history":[{"count":22,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6102\/revisions"}],"predecessor-version":[{"id":6122,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6102\/revisions\/6122"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6102"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6102"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6102"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}