{"id":7092,"date":"2018-01-11T11:07:32","date_gmt":"2018-01-11T13:07:32","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7092"},"modified":"2018-09-25T17:11:11","modified_gmt":"2018-09-25T20:11:11","slug":"o-que-seriam-boas-metricas-para-produtos-digitais","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/01\/o-que-seriam-boas-metricas-para-produtos-digitais\/","title":{"rendered":"O que seriam boas m\u00e9tricas para produtos digitais?"},"content":{"rendered":"<p>Em <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/04\/dilemas-de-uma-equipe-de-produto-desenhando-uma-entrega\/\">Dilemas de PO: priorizar features e projetar entregas<\/a> tive a oportunidade de compartilhar a import\u00e2ncia do uso de m\u00e9tricas de neg\u00f3cio quali e quantitativas para a prioriza\u00e7\u00e3o de funcionalidades em equipes de produto. No blog post de hoje, gostaria de aprofundar um pouco mais no assunto e falar sobre o que seriam boas m\u00e9tricas de neg\u00f3cio.<\/p>\n<h2>Caracter\u00edsticas de uma boa m\u00e9trica de neg\u00f3cio<\/h2>\n<p>Primeiramente, uma boa m\u00e9trica de neg\u00f3cio deve ser compar\u00e1vel. Saber que a taxa de convers\u00e3o de pessoas interessadas no seu produto para clientes \u00e9 de 10% n\u00e3o lhe servir\u00e1 para muita coisa se voc\u00ea n\u00e3o tiver como analisar o comportamento da mesma ao longo do tempo. Como estava a m\u00e9trica na semana passada? No m\u00eas passado? No ano anterior? As convers\u00f5es est\u00e3o crescendo? Responder quest\u00f5es como essa permitir\u00e3o que voc\u00ea possa fazer melhor uso da m\u00e9trica.<\/p>\n<p>Outra caracter\u00edstica importante sobre m\u00e9tricas de neg\u00f3cio \u00e9 que elas devem ser simples para que todos compreendam o que elas representam.<\/p>\n<p>A m\u00e9trica de neg\u00f3cio deve tamb\u00e9m ser uma rela\u00e7\u00e3o ou uma taxa. A quantidade de usu\u00e1rios pode ser pouco \u00fatil, por\u00e9m, a porcentagem de usu\u00e1rios ativos di\u00e1rios j\u00e1 poder\u00e1 trazer tend\u00eancias de crescimento. Raz\u00f5es e taxas s\u00e3o comparativas, o que o ajudam a tomar melhores decis\u00f5es.<\/p>\n<p>Por fim, lembre-se: m\u00e9tricas de neg\u00f3cio boas se transformam. Se a m\u00e9trica muda e voc\u00ea n\u00e3o sabe a motiva\u00e7\u00e3o ou o que fazer com ela, ent\u00e3o voc\u00ea tem uma m\u00e9trica ruim.<\/p>\n<h2>M\u00e9tricas de produto<\/h2>\n<p>A seguir, listarei um conjunto de m\u00e9tricas que voc\u00ea poder\u00e1 utilizar quando tiver o trabalho de analisar os resultados dos produtos de software, por\u00e9m, sugiro leituras complementares como Lean Analytics e Product Management (uma boa dica de leitura \u00e9 o livro <a href=\"https:\/\/www.casadocodigo.com.br\/products\/livro-gestao-produtos\">Gest\u00e3o de produtos de software: como aumentar as chances de sucesso do seu software<\/a> do Joaquim Torres).<\/p>\n<ul>\n<li><strong>Receita recorrente mensal:<\/strong> total de receita gerada pelos clientes que assinam o produto m\u00eas a m\u00eas.<\/p>\n<\/li>\n<li>\n<p><strong>Receita recorrente anual:<\/strong> total de receita recorrente gerada pelo produto (ex: soma das receitas mensais gerada pela assinatura do produto).<\/p>\n<\/li>\n<li>\n<p><strong>Receita recorrente anual por cliente:<\/strong> total de receita recorrente gerada por cada cliente da carteira. Se o valor dessa m\u00e9trica est\u00e1 subindo, isso representa que voc\u00ea est\u00e1 conseguindo, por exemplo, aumentar o pre\u00e7o do servi\u00e7o, aumentar o ticket m\u00e9dio no geral ou vender novas solu\u00e7\u00f5es aos clientes.<\/p>\n<\/li>\n<li>\n<p><strong>Receita anual total:<\/strong> total de receita gerada pela organiza\u00e7\u00e3o tanto via produto como via servi\u00e7o. Geralmente os investidores avaliam as empresas a partir da sua capacidade de gera\u00e7\u00e3o de receita recorrente, pois presta\u00e7\u00e3o de servi\u00e7o \u00e9 algo peri\u00f3dico e menos escal\u00e1vel do que a venda de um produto.<\/p>\n<\/li>\n<li>\n<p><strong>Taxa de convers\u00e3o:<\/strong> \u00e9 o percentual entre os pontenciais interessados em seu produto (leads) e os que acabam efetivamente se tornando clientes. Quanto maior for a taxa de convers\u00e3o, maior ser\u00e1 a capacidade de monetiza\u00e7\u00e3o do seu produto. Outra vari\u00e1vel importante de analisar em conjunto da taxa de convers\u00e3o \u00e9 o tempo no qual um lead levou para se tornar um cliente. Neste caso, quanto menor o tempo mais otimizado estar\u00e1 o funil de convers\u00e3o dos leads em clientes.<\/p>\n<\/li>\n<li>\n<p><strong>Custo de aquisi\u00e7\u00e3o do cliente:<\/strong> \u00e9 o custo total de aquisi\u00e7\u00e3o de clientes (CAC). \u00c9 poss\u00edvel considerar o CAC a partir de duas perspectivas: (i) custo para a aquisi\u00e7\u00e3o de qualquer cliente do produto; (ii) custo para a aquisi\u00e7\u00e3o dos clientes oriundos de investimentos feitos em marketing. Ao calcular o CAC total como um custo que inclui os clientes adquiridos organicamente ao inv\u00e9s de isolar clientes adquiridos atrav\u00e9s de marketing &#8220;pago&#8221;, voc\u00ea deixa de saber o qu\u00e3o bem suas campanhas pagas est\u00e3o funcionando e se elas s\u00e3o lucrativas. \u00c9 por isso que os investidores consideram que o CAC pago \u00e9 mais importante do que o CAC misturado na avalia\u00e7\u00e3o da viabilidade de um neg\u00f3cio, pois ele informa se uma empresa pode escalar seu or\u00e7amento de aquisi\u00e7\u00e3o de usu\u00e1rios de forma lucrativa.<\/p>\n<\/li>\n<li>\n<p><strong>Evas\u00e3o (churn):<\/strong> indica a m\u00e9dia de cancelamentos de assinaturas dos clientes de uma empresa, assim como as perdas financeiras que elas representam, em determinado per\u00edodo. Pode ser calculado atrav\u00e9s de um taxa do total de clientes cancelados dividido pelo n\u00famero total de clientes ativos do \u00faltimo m\u00eas ou pela receita recorrente mensal gerada pelos clientes cancelados dividido pelo total de receita recorrente mensal.<\/p>\n<\/li>\n<li>\n<p><strong>N\u00famero de usu\u00e1rios ativos:<\/strong> pode ser considerada uma m\u00e9trica que n\u00e3o ajuda na tomada de decis\u00e3o dado que voc\u00ea pode ter muitos usu\u00e1rios ativos que n\u00e3o geram receita, por\u00e9m, tal m\u00e9trica pode ser \u00fatil como forma de entender o engajamento da solu\u00e7\u00e3o no mercado.<\/p>\n<\/li>\n<li>\n<p><strong>Rela\u00e7\u00e3o entre clientes pagos e o total de usu\u00e1rios:<\/strong> \u00e9 o percentual entre os clientes pagos (geradores de receita) e o total de usu\u00e1rios do seu produto. Se o seu produto possui diferentes planos, tal m\u00e9trica pode ser \u00fatil para analisar, a partir da base total de usu\u00e1rios, a representatividade de cada plano a partir do total de usu\u00e1rios pagos. Ex: Caso seu produto possua uma base de 5.000 usu\u00e1rios sendo que 4.900 fazem parte de um plano &#8220;free&#8221;, apenas 2% (100) dos clientes comp\u00f5e os planos pagos.<\/p>\n<\/li>\n<\/ul>\n<h2>Conclus\u00e3o<\/h2>\n<p>As m\u00e9tricas discutidas acima ajudar\u00e3o voc\u00ea e a sua a equipe na tomada de melhores decis\u00f5es quando estiverem discutindo qual funcionalidade trar\u00e1 maior resultado para o neg\u00f3cio e, principalmente, servir\u00e3o como um guia para an\u00e1lise da sa\u00fade dos produtos que estiverem sob a tutela da empresa.<\/p>\n<p>E voc\u00ea, tem visto algum tipo de m\u00e9trica diferente das comentadas? N\u00e3o deixe de compartilhar nos coment\u00e1rios abaixo sua opini\u00e3o.<\/p>\n<p>&nbsp;<\/p>\n<div style=\"background-color: #fffdf9; border: 1px solid #e9af35; border-radius: 6px; margin: 32px 0; padding: 22px 24px; font-family: sans-serif;\">\n<h3 style=\"font-size: 1.5em; line-height: 1.5em; margin-top: 0em !important;\">Curso: M\u00e9tricas para Projetos Agile<\/h3>\n<p style=\"margin-top: 0.5em !important;\">Em 7 e-mails voc\u00ea vai aprender neste curso o que medir e como interpretar os dados. <strong>Curso gratuito<\/strong> criado pelo autor do livro \u201cM\u00e9tricas \u00c1geis\u201d, Raphael Albino.<\/p>\n<p><a style=\"background: #e9af35; border: none; border-radius: 3px; color: #fff; display: inline-block; font-size: 12px; line-height: 1.5; margin-top: 5px; padding: 8px 16px; text-align: center; text-decoration: none; letter-spacing: 0.1em;\" href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=curso-metricas-agile&amp;utm_content=cta-blog-post-bottom\" target=\"_blank\" rel=\"noopener\">INSCREVA-SE GRATUITAMENTE<\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Em Dilemas de PO: priorizar features e projetar entregas tive a oportunidade de compartilhar a import\u00e2ncia do uso de m\u00e9tricas de neg\u00f3cio quali e quantitativas para a prioriza\u00e7\u00e3o de funcionalidades em equipes de produto. No blog post de hoje, gostaria de aprofundar um pouco mais no assunto e falar sobre o que seriam boas m\u00e9tricas &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/01\/o-que-seriam-boas-metricas-para-produtos-digitais\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,263],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7092"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7092"}],"version-history":[{"count":4,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7092\/revisions"}],"predecessor-version":[{"id":7802,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7092\/revisions\/7802"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7092"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7092"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7092"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}