{"id":3013,"date":"2012-07-31T16:02:28","date_gmt":"2012-07-31T19:02:28","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=3013"},"modified":"2012-07-31T16:02:28","modified_gmt":"2012-07-31T19:02:28","slug":"lancamos-mais-um-livro-o-html5-e-css3-domine-a-web-do-futuro","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2012\/07\/lancamos-mais-um-livro-o-html5-e-css3-domine-a-web-do-futuro\/","title":{"rendered":"Lan\u00e7amos mais um livro! \\o\/ &#8220;HTML5 e CSS3: Domine a web do futuro&#8221;"},"content":{"rendered":"<p>Aqui na Plataformatec eu trabalho lado-a-lado com desenvolvedores (back\/front-end), designers e gerentes de projetos. Francamente, \u00e9 dif\u00edcil saber onde termina o trabalho de um e onde come\u00e7a o trabalho do outro. Existe muita sobreposi\u00e7\u00e3o de conhecimentos entre os membros das nossas equipes e isso \u00e9 muito bom! N\u00f3s realmente acreditamos no poder das equipes multi-disciplinares e os nossos resultados nos convencem cada vez mais disso.<\/p>\n<div id=\"attachment_3022\" style=\"width: 522px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-3022\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2012\/07\/htmlcss-capa.jpg\" alt=\"A capa do livro &quot;HTML5 e CSS3: Domine a web do futuro&quot;\" title=\"htmlcss-capa\" width=\"512\" class=\"size-full wp-image-3022\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2012\/07\/htmlcss-capa.jpg 800w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2012\/07\/htmlcss-capa-300x204.jpg 300w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><p id=\"caption-attachment-3022\" class=\"wp-caption-text\">A capa do livro &#8220;HTML5 e CSS3: Domine a web do futuro&#8221;<\/p><\/div>\n<p>E a melhor evid\u00eancia de que eu tamb\u00e9m acredito em multi-disciplinaridade \u00e9 o meu rec\u00e9m lan\u00e7ado livro: <a href=\"http:\/\/casadocodigo.com.br\/products\/html5-e-css3-domine-a-web-do-futuro\">&#8220;HTML5 e CSS3: Domine a web do futuro&#8221;<\/a> publicado pela <a href=\"http:\/\/casadocodigo.com.br\">Casa do C\u00f3digo<\/a>. Sou desenvolvedor h\u00e1 algum tempo e sempre me interessei por front-end. No come\u00e7o eu tive d\u00favidas em qual assunto me aprofundar, mas entre escolher um caminho ou outro acabei optando em aprofundar em ambos. Confesso que eu n\u00e3o me arrependo em nada da minha escolha e estou muito contente em ter aprendido bastante ao longo do caminho e hoje eu poder compartilhar o que aprendi em HTML e CSS atrav\u00e9s deste livro.<\/p>\n<p>Escrevi este livro pensando em desenvolvedores web que desejam aprimorar os seus conhecimentos em front-end e profissionais que estejam dedicando exclusivamente a estes assuntos. Aprendi muitas coisas ao &#8216;fazer&#8217;, por isso eu tentei replicar este tipo de aprendizado no livro com v\u00e1rios tutoriais e li\u00e7\u00f5es sobre t\u00e9cnicas cl\u00e1ssicas de CSS e HTML (utilizando float, pseudo elementos e outros) e combina\u00e7\u00f5es de CSS3 para componentes visuais.<\/p>\n<p>Para quem se interessar, o livro est\u00e1 a venda online na Casa do C\u00f3digo (vers\u00f5es impressa, .mobi, .epub e .pdf).<\/p>\n<h3>Plataformatec na QCon SP<\/h3>\n<p>Aproveito para fazer o convite para assitirem o meu lightning talk sobre <em>CSS3 Transitions<\/em> e a palestra do Jos\u00e9 Valim <a href=\"http:\/\/www.qconsp.com\/palestra\/jose-valim\/uma-abordagem-moderna-para-programacao-na-erlang-vm-elixir\">&#8220;Uma abordagem moderna para programa\u00e7\u00e3o na Erlang VM: Elixir&#8221;<\/a> na <a href=\"http:\/\/www.qconsp.com\/\">QCon SP<\/a>, neste final de semana, no dia 04 de Agosto.<\/p>\n<p>Fora a minha palestra, eu estarei no stand da Casa do C\u00f3digo (l\u00e1 na QCon). Passe por l\u00e1 para bater um papo. Ser\u00e1 um prazer! \ud83d\ude09<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Aqui na Plataformatec eu trabalho lado-a-lado com desenvolvedores (back\/front-end), designers e gerentes de projetos. Francamente, \u00e9 dif\u00edcil saber onde termina o trabalho de um e onde come\u00e7a o trabalho do outro. Existe muita sobreposi\u00e7\u00e3o de conhecimentos entre os membros das nossas equipes e isso \u00e9 muito bom! N\u00f3s realmente acreditamos no poder das equipes multi-disciplinares &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2012\/07\/lancamos-mais-um-livro-o-html5-e-css3-domine-a-web-do-futuro\/\">\u00bb<\/a><\/p>\n","protected":false},"author":17,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[159,189,188,187],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/3013"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=3013"}],"version-history":[{"count":20,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/3013\/revisions"}],"predecessor-version":[{"id":3036,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/3013\/revisions\/3036"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=3013"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=3013"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=3013"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}