{"id":7243,"date":"2018-03-01T15:49:29","date_gmt":"2018-03-01T18:49:29","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7243"},"modified":"2018-03-05T09:51:19","modified_gmt":"2018-03-05T12:51:19","slug":"processo-adaptar-e-necessario","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/03\/processo-adaptar-e-necessario\/","title":{"rendered":"Processo: Adaptar \u00e9 Necess\u00e1rio"},"content":{"rendered":"<p>H\u00e1 algum tempo, encontrei um amigo desenvolvedor em um evento e ele me contou que as coisas estavam &#8220;complicadas&#8221; na equipe em que ele trabalhava. O olhar era um misto de d\u00favida e cansa\u00e7o, como quase sempre que algu\u00e9m menciona a palavra &#8220;complicado&#8221;. Quis entender os detalhes, pois em outra ocasi\u00e3o ele me falou maravilhas sobre o trabalho e a equipe.<\/p>\n<p>O que ele me contou, resumidamente, \u00e9 que a equipe manteve um bom desempenho desde a sua cria\u00e7\u00e3o, mas que aqueles \u00faltimos 2 meses tinham sido bem ruins. Reuni\u00f5es e cerim\u00f4nias come\u00e7aram a necessitar de mais tempo para serem feitas e o time passou a entregar menos, deixando um clima de desmotiva\u00e7\u00e3o. A pergunta que me fiz foi: o que aconteceu para que o comportamento do time fosse alterado dessa forma?<\/p>\n<p>Recentemente nos encontramos novamente. Ele concluiu que dois fatores foram determinantes para a mudan\u00e7a:<br \/>\n1. A disponibiliza\u00e7\u00e3o de um board de m\u00e9tricas do produto;<br \/>\n2. A entrada de dois desenvolvedores, alterando a forma\u00e7\u00e3o do time de 5 para 7 pessoas.<\/p>\n<p>A equipe n\u00e3o tinha acesso em tempo real \u00e0s informa\u00e7\u00f5es de uso e convers\u00e3o do produto, apenas quando solicitava \u00e0 \u00e1rea de BI. Quando o acesso a um board com esses n\u00fameros foi liberado, discuss\u00f5es frequentes sobre eles se iniciaram de forma desestruturada em dailies e reviews. Na maioria das vezes n\u00e3o se chegava a uma conclus\u00e3o sobre o ponto levantado e a cerim\u00f4nia se alongava.<\/p>\n<p>Fred Brooks, em seu livro &#8220;Mythical Man-Month&#8221;, j\u00e1 falou sobre os efeitos de incluir mais pessoas em um time de software, mas ainda assim n\u00e3o havia ind\u00edcios t\u00e3o fortes de que a inclus\u00e3o de apenas duas pessoas de n\u00edvel pleno, que j\u00e1 trabalhavam em um time que permaneceria pequeno tornaria impratic\u00e1vel dois processos rotineiros:<\/p>\n<ul>\n<li>As retrospectivas: o volume de coment\u00e1rios aumentou, assim como os pontos levantados. Ficou imposs\u00edvel passar por todos os pontos e alguns, bastante relevantes, simplesmente deixaram de ser discutidos, frustrando o time.<\/p>\n<\/li>\n<li>\n<p>Os refinings das hist\u00f3rias de usu\u00e1rio: o n\u00famero de perguntas e conflitos de opini\u00e3o aumentou durante as reuni\u00f5es, reduzindo drasticamente a efici\u00eancia dela. Sem ter hist\u00f3rias prontas para desenvolvimento e com as cerim\u00f4nias demorando mais tempo, a equipe simplesmente perdeu throughput.<\/p>\n<\/li>\n<\/ul>\n<p>Mudan\u00e7as simples como as mencionadas podem alterar bastante a din\u00e2mica do time ao ponto dos processos em uso n\u00e3o serem capazes de suportar as mudan\u00e7as sem algum ajuste. Os conceitos de melhoria cont\u00ednua, itera\u00e7\u00f5es e avalia\u00e7\u00e3o do processos est\u00e3o t\u00e3o relacionados \u00e0s metodologias \u00e1geis, que parece ingenuidade considerar que algu\u00e9m possa esquecer disso.<\/p>\n<p>Mas&#8230; pode ser que aquele conjunto de processos produziu bons resultados por tanto tempo que a equipe perdeu o h\u00e1bito de question\u00e1-lo\u2026 pode ser que as mudan\u00e7as cheguem sem aviso, sem parecerem particularmente importantes\u2026 pode ser que o time, sem querer, invista energia em culpar as mudan\u00e7as ao inv\u00e9s de se adaptar a elas\u2026 pode ser que na nossa <strong><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/12\/nos-nao-somos-necessariamente-ageis-mas-com-certeza-somos-ageis\/\">busca em aplicar &#8220;\u00c1gil&#8221;, esque\u00e7amos de ser \u00e1geis<\/a><\/strong>\u2026 Por isso, nunca \u00e9 demais lembrar que ter um olhar cr\u00edtico para os processos \u00e9 um exerc\u00edcio constante e necess\u00e1rio.<\/p>\n<p>Meu amigo tamb\u00e9m contou quais solu\u00e7\u00f5es o time adotou quando perceberam o problema. Come\u00e7aram criando um f\u00f3rum mensal dedicado a discutir os n\u00fameros do produto, do qual saem ideias de itens de backlog, insumos para prioriza\u00e7\u00e3o e a\u00e7\u00f5es para o time de neg\u00f3cios. A partir da\u00ed, quando o assunto surgia na daily e na review, quase sempre estava dentro do escopo da cerim\u00f4nia, sem divergir dos objetivos dela.<\/p>\n<p>Nos refinamentos, embora o escopo final ainda passe pelo crivo de todos, a prepara\u00e7\u00e3o da hist\u00f3ria para desenvolvimento passou a ser feita com participa\u00e7\u00e3o de menos pessoas, reduzindo o tempo das reuni\u00f5es. Na retrospectiva, passaram a usar uma ferramenta web para preencher os itens antes da cerim\u00f4nia e prioriz\u00e1-los, de forma que conseguiram manter as discuss\u00f5es importantes dentro do timebox em que est\u00e3o todos reunidos.<\/p>\n<p>Independente do n\u00edvel de ajuste e qual a solu\u00e7\u00e3o adotada, \u00e9 certo que seus processos precisar\u00e3o ser revistos. Portanto, esteja atento a padr\u00f5es indesej\u00e1veis, colete <strong><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/03\/why-we-love-metrics-cumulative-flow-diagrams\/\">m\u00e9tricas que mensurem seus processos<\/a> <\/strong>e as acompanhe, converse com as pessoas, fique de olho em mudan\u00e7as na din\u00e2mica do time e esteja sempre aberto a sugest\u00f5es.<\/p>\n<p><em>Este texto tamb\u00e9m faz parte da Cont\u00c1gil, nossa newsletter mensal com curadoria de conte\u00fado pela equipe da Plataformatec sobre\u00a0gerenciamento de projetos, metodologias e cultura \u00e1gil. Se voc\u00ea ainda n\u00e3o \u00e9 assinante, assine agora!\u00a0\ud83d\ude42<\/em><\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-6110\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png\" alt=\"\" width=\"831\" height=\"147\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png 831w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-300x53.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-768x136.png 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>H\u00e1 algum tempo, encontrei um amigo desenvolvedor em um evento e ele me contou que as coisas estavam &#8220;complicadas&#8221; na equipe em que ele trabalhava. O olhar era um misto de d\u00favida e cansa\u00e7o, como quase sempre que algu\u00e9m menciona a palavra &#8220;complicado&#8221;. Quis entender os detalhes, pois em outra ocasi\u00e3o ele me falou maravilhas &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/03\/processo-adaptar-e-necessario\/\">\u00bb<\/a><\/p>\n","protected":false},"author":40,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[1],"tags":[123,284],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7243"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7243"}],"version-history":[{"count":4,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7243\/revisions"}],"predecessor-version":[{"id":7251,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7243\/revisions\/7251"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7243"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7243"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7243"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}