{"id":7278,"date":"2018-03-07T16:31:48","date_gmt":"2018-03-07T19:31:48","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7278"},"modified":"2018-03-07T16:31:48","modified_gmt":"2018-03-07T19:31:48","slug":"a-importancia-do-processo-de-refining-em-um-projeto","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/03\/a-importancia-do-processo-de-refining-em-um-projeto\/","title":{"rendered":"A import\u00e2ncia do processo de refining em um projeto"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Durante um projeto de desenvolvimento de software, independente da metodologia ou framework que est\u00e1 sendo utilizada, n\u00e3o \u00e9 raro que existam pontos de controle onde paramos e olhamos para o futuro, seja breve (dia, semana ou sprint) ou um futuro mais distante (release ou final do projeto). Nesse momento, usualmente planejamos quais os pr\u00f3ximos passos de constru\u00e7\u00e3o do produto. Geralmente isso ocorre no planejamento ou replenishment.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Em alguns processos, durante o planejamento, replenishing ou outro momento de se organizar para o futuro, tende a ocorrer (tende, n\u00e3o \u00e9 uma regra) a discuss\u00e3o sobre as user stories que precisam ser desenvolvidas. O refining ou grooming (esse \u00faltimo vem entrando em desuso, inclusive o <\/span><a href=\"http:\/\/www.scrumguides.org\/scrum-guide.html\"><span style=\"font-weight: 400;\">Scrum Guide<\/span><\/a><span style=\"font-weight: 400;\"> abandonou o uso da palavra em 2013). Ainda que algumas pessoas realizem tal processo, percebo que em muitos times ainda n\u00e3o est\u00e1 t\u00e3o clara a sua import\u00e2ncia dentro de um projeto.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Inclusive em alguns locais, n\u00e3o h\u00e1 sequer o conhecimento do que seja o refining. Isso \u00e9 problema? Claro que n\u00e3o! Ado\u00e7\u00e3o da agilidade \u00e9 incremental, ningu\u00e9m \u00e9 obrigado a saber todas suas nuances. Ent\u00e3o, caso voc\u00ea n\u00e3o conhe\u00e7a o processo, relaxe! Vou ajud\u00e1-lo!<\/span><\/p>\n<h3><strong>&#8220;Come with me if you wanna live the refining!&#8221;<\/strong><\/h3>\n<p><span style=\"font-weight: 400;\">Refining \u00e9 o processo pelo qual realizamos o levantamento e escrita dos cards, de forma a deix\u00e1-lo pronto para desenvolvimento. Neste processo, s\u00e3o levantados uma s\u00e9rie de questionamentos acerca de neg\u00f3cio, c\u00f3digo, crit\u00e9rios de aceite e quaisquer outras informa\u00e7\u00f5es que sejam relevantes para a constru\u00e7\u00e3o daquele incremento de produto. O processo de refining \u00e9 respons\u00e1vel por criar um acordo do que ser\u00e1 constru\u00eddo entre os envolvidos. Definindo o escopo das user stories (o que ser\u00e1 feito e tamb\u00e9m o que n\u00e3o ser\u00e1 feito).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">J\u00e1 ouvi o seguinte argumento:<\/span><\/p>\n<p><em><span style=\"font-weight: 400;\">&#8220;Ah, mas j\u00e1 fazemos isso durante o planning na etapa de estimativa! Ent\u00e3o o refining \u00e9 desnecess\u00e1rio!&#8221;<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">O que acontece \u00e9 que durante a etapa de estimativa geralmente ocorre uma discuss\u00e3o acerca da user story, para saber se todos entenderam o que est\u00e1 escrito e a\u00ed sim estimar. Entretanto essa discuss\u00e3o aborda somente o card j\u00e1 escrito. E como fica o preparo? Caso o time utilize o momento da estimativa para escrever tudo o que deve estar contido na user story e tamb\u00e9m estimar, o evento ter\u00e1 uma dura\u00e7\u00e3o elevada.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Legal, mas qual o momento para essa escrita ent\u00e3o? \u00c9 justamente durante o processo de refining, que acredito deve ser iniciado antes do planning, por exemplo. Para que neste momento a user story j\u00e1 chegue com mais informa\u00e7\u00f5es para a discuss\u00e3o.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">O refining n\u00e3o garante, mas aumenta consideravelmente as chances de uma user story estar bem escrita. E user stories bem escritas s\u00e3o importantes para evitar incertezas no desenvolvimento, evitando interrup\u00e7\u00f5es durante a escrita de c\u00f3digo, reduzindo o <\/span><strong><em><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/03\/looking-at-lead-time-in-a-different-way\/\">leadtime<\/a><\/em><\/strong><span style=\"font-weight: 400;\"> e aumentando a efici\u00eancia do time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Os benef\u00edcios para o time e para o processo podem ser facilmente identificados. Alguns percept\u00edveis de forma mais r\u00e1pida s\u00e3o:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">User stories melhor escritas: como voc\u00ea tem um tempo de preparo maior para escrev\u00ea-las, as chances de ter user stories claras, mais informativas e com crit\u00e9rios de aceite melhor escritos \u00e9 grande;<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Estimativas mais assertivas: sabemos que estimativas n\u00e3o s\u00e3o prazos, e sim valores aproximados. Entretanto, a assertividade dessa estimativa tende a aumentar, caso voc\u00ea possua mais informa\u00e7\u00f5es em m\u00e3os, com user stories melhor escritas, voc\u00ea melhora as formas de estimar;<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Menor n\u00famero de incertezas: com um melhor preparo antes de levar a user story para discuss\u00e3o, voc\u00ea remove incertezas, melhorando o processo, e fazendo com que a funcionalidade seja melhor entendida e que seja mais f\u00e1cil de identificar e sanar d\u00favidas.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">O processo de refining tamb\u00e9m \u00e9 uma \u00f3tima maneira de conhecer o neg\u00f3cio, delimitar escopo (o que vai ser feito, e o que n\u00e3o vai ser feito). Al\u00e9m de ser uma excelente forma de manter o alinhamento do time. No refining fica claro para todos o que ser\u00e1 constru\u00eddo e como. Sendo assim os silos de comunica\u00e7\u00e3o reduzem bastante.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ficou curioso de como executar um processo de refining? Ou quer saber o motivo de eu chamar o refining de processo e n\u00e3o de cerim\u00f4nia, reuni\u00e3o ou evento? N\u00e3o deixe de ler este <\/span><strong><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/05\/aprendi-sobre-refining-user-stories-em-projetos\/\">blog post aqui<\/a><\/strong><span style=\"font-weight: 400;\">! D\u00e1 uma lida, e comenta como voc\u00ea faz no seu time!<\/span><\/p>\n<p><em>Este texto tamb\u00e9m faz parte da Cont\u00c1gil, nossa newsletter mensal com curadoria de conte\u00fado pela equipe da Plataformatec sobre\u00a0gerenciamento de projetos, metodologias e cultura \u00e1gil. Se voc\u00ea ainda n\u00e3o \u00e9 assinante, assine agora!\u00a0\ud83d\ude42<\/em><\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-6110 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png\" alt=\"assinatura da newsletter de Agile.\" width=\"831\" height=\"147\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png 831w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-300x53.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-768x136.png 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Durante um projeto de desenvolvimento de software, independente da metodologia ou framework que est\u00e1 sendo utilizada, n\u00e3o \u00e9 raro que existam pontos de controle onde paramos e olhamos para o futuro, seja breve (dia, semana ou sprint) ou um futuro mais distante (release ou final do projeto). Nesse momento, usualmente planejamos quais os pr\u00f3ximos passos &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/03\/a-importancia-do-processo-de-refining-em-um-projeto\/\">\u00bb<\/a><\/p>\n","protected":false},"author":52,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,284],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7278"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/52"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7278"}],"version-history":[{"count":3,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7278\/revisions"}],"predecessor-version":[{"id":7281,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7278\/revisions\/7281"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7278"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7278"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7278"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}