{"id":1225,"date":"2010-07-28T06:47:50","date_gmt":"2010-07-28T09:47:50","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=1225"},"modified":"2010-08-31T09:48:46","modified_gmt":"2010-08-31T12:48:46","slug":"estamos-contratando-de-novo","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2010\/07\/estamos-contratando-de-novo\/","title":{"rendered":"Estamos contratando! de novo =D"},"content":{"rendered":"<p>H\u00e1 estudos indicando que 42% das empresas paulistas fecham com at\u00e9 dois anos de exist\u00eancia.<br \/>\nE n\u00f3s estamos sobrevivendo bem\u00a0\u00e0s estat\u00edsticas. Por isso, estamos em busca de mais desenvolvedores Rails para trabalhar conosco! \\o\/<\/p>\n<p>Procuramos por geeks, com disponibilidade full-time, que realmente gostem de &#8216;codar&#8217; e fazer um trabalho bem feito, limpo e sem remendos. Para esta vaga em aberto, n\u00e3o \u00e9 necess\u00e1rio ter experi\u00eancia com Rails. Por\u00e9m, \u00e9 um requisito que voc\u00ea j\u00e1 tenha trabalhado com outras linguagens orientadas a objeto e desenvolvimento para web por pelo menos um ano. Ao final do post h\u00e1 uma lista de habilidades que buscamos. N\u00e3o esque\u00e7a de checar.<\/p>\n<div id=\"attachment_1279\" style=\"width: 460px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-1279\" class=\"size-full wp-image-1279\" title=\"We love geeks! v2.0 (sorry girls!)\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2010\/07\/92ACAD61-C990-638A-AD90DD36016599EE2.jpg\" alt=\"homer simpson dough!\" width=\"450\" height=\"342\" \/><p id=\"caption-attachment-1279\" class=\"wp-caption-text\">We love geeks! v2.0 (sorry girls!)***<\/p><\/div>\n<p>Sobre a vaga&#8230; apesar de n\u00e3o atuar diretamente, o novo desenvolvedor estar\u00e1 envolvido com todas as \u00e1reas relacionadas aos projetos (deployment, decis\u00f5es de arquitetura e infra-estrutura, quest\u00f5es de escalabilidade, gest\u00e3o de projetos \u00e1geis e o pr\u00f3prio desenvolvimento em si).<\/p>\n<p>\u00c9 assim que trabalhamos na Plataforma Tecnologia. N\u00e3o h\u00e1 feudos de Gerentes Projetos vs. Arquitetos vs. Desenvolvedores vs. Designers. Cada um possui seu papel, mas a entrega de resultados depende de um time multi-disciplinar que entende a vis\u00e3o geral do projeto.<\/p>\n<p>Bem pessoal, segue o <strong>resumo dos requisitos<\/strong>:<br \/>\n&#8211; Ingl\u00eas intermedi\u00e1rio<br \/>\n&#8211; Cultura &#8216;hacker&#8217;<br \/>\n&#8211; Programa\u00e7\u00e3o orientada a objetos<br \/>\n&#8211; Experi\u00eancia pr\u00e9via com desenvolvimento de aplicativos web<br \/>\n&#8211;\u00a0N\u00e3o \u00e9 necess\u00e1rio experi\u00eancia em Ruby on Rails (mas ser\u00e1 diferencial para os que tiverem)<br \/>\n&#8211; Desej\u00e1vel ser usu\u00e1rio de OS Linux ou Mac (Windows is so over&#8230;)<br \/>\n&#8211; Disponibilidade full-time<br \/>\n&#8211; Local: S\u00e3o Paulo (negoci\u00e1vel)<\/p>\n<p>Geeks com sede por aprendizado, uni-vos!<br \/>\nEnviem seus CVs para trabalhe@plataformatec.com.br.<\/p>\n<p><em>*** Por total insensibilidade da minha parte, e totalmente sem querer, a imagem previamente publicada neste post poderia ser interpretada como ofensiva e machista. N\u00e3o era essa a id\u00e9ia. Estamos procurando por developers, independente do sexo.<br \/>\n<span style=\"font-style: normal;\"><em><br \/>\nAproveito para <\/em><em>agradecer as gentis meninas do &#8216;devchix&#8217;\u00a0que nos alertaram e nos deram feedback sobre a imagem originalmente postada. Thanks and really sorry girls! =)<\/em><\/span><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>H\u00e1 estudos indicando que 42% das empresas paulistas fecham com at\u00e9 dois anos de exist\u00eancia. E n\u00f3s estamos sobrevivendo bem\u00a0\u00e0s estat\u00edsticas. Por isso, estamos em busca de mais desenvolvedores Rails para trabalhar conosco! \\o\/ Procuramos por geeks, com disponibilidade full-time, que realmente gostem de &#8216;codar&#8217; e fazer um trabalho bem feito, limpo e sem remendos. &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2010\/07\/estamos-contratando-de-novo\/\">\u00bb<\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/1225"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=1225"}],"version-history":[{"count":45,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/1225\/revisions"}],"predecessor-version":[{"id":1275,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/1225\/revisions\/1275"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=1225"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=1225"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=1225"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}