{"id":7475,"date":"2018-04-25T11:34:37","date_gmt":"2018-04-25T14:34:37","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7475"},"modified":"2018-04-25T17:27:50","modified_gmt":"2018-04-25T20:27:50","slug":"onde-foi-parar-o-gerente-de-projetos","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/04\/onde-foi-parar-o-gerente-de-projetos\/","title":{"rendered":"Onde foi parar o Gerente de Projetos?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Com a evolu\u00e7\u00e3o dos modelos de gest\u00e3o motivado pela necessidade de adapta\u00e7\u00e3o ao ambiente de desenvolvimento de software, o papel do Gerente de Projetos nas empresas de tecnologia tem se transformado bastante nos \u00faltimos tempos. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Responsabilidades como aloca\u00e7\u00e3o de equipes, controle de recursos financeiros, desenvolvimento de cronogramas e elabora\u00e7\u00e3o de enormes Planos de Projetos passaram a ser responsabilidades de outros pap\u00e9is.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Alavancado pelo uso das metodologias \u00e1geis, o conceito de gest\u00e3o distribu\u00edda tem levado uma nova caracter\u00edstica aos times: mais autonomia para tomar decis\u00f5es de neg\u00f3cio, cuja participa\u00e7\u00e3o do time no direcionamento de um produto tem sido essencial para que a mudan\u00e7a constante, inerente desse ambiente, tenha menor impacto sobre a qualidade do projeto. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ent\u00e3o, eu lhe pergunto: com o empoderamento dos times nas organiza\u00e7\u00f5es, onde foi parar o Gerente de Projetos com perfil &#8220;manda-chuva&#8221;? Para ficar mais claro o que quero dizer com esse termo, imagine o tradicional gestor de uma estrutura funcional e hierarquizada, onde funcion\u00e1rios, coordenadores, gerentes, diretores e presidente se baseiam no conceito comando-controle e estes respondem diretamente ao seu gerente funcional.<\/span><\/p>\n<div id=\"attachment_7476\" style=\"width: 972px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-7476\" class=\" wp-image-7476\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Screen-Shot-2018-04-17-at-16.02.29-1024x626.png\" alt=\"\" width=\"962\" height=\"588\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Screen-Shot-2018-04-17-at-16.02.29-1024x626.png 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Screen-Shot-2018-04-17-at-16.02.29-300x183.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Screen-Shot-2018-04-17-at-16.02.29-768x469.png 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Screen-Shot-2018-04-17-at-16.02.29.png 1296w\" sizes=\"(max-width: 962px) 100vw, 962px\" \/><p id=\"caption-attachment-7476\" class=\"wp-caption-text\">Diagrama representando uma estrutura funcional<\/p><\/div>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">O dinamismo, a necessidade de adapta\u00e7\u00e3o r\u00e1pida e resposta \u00e0s mudan\u00e7as, embasadas pelo modelo de gest\u00e3o \u00e1gil, fez com que os profissionais da antiga estrutura funcional se adequassem aos times multidisciplinares focados na entrega de valor, que saibam responder imediatamente \u00e0 imprevisibilidade deste ambiente e que se adaptem constantemente a novos contextos. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">O papel do tradicional Gerente de Projetos pode ser comparado ao papel exigido pela necessidade requerida nesse novo ambiente: o Gerente de Produto, Product Manager, ou qualquer nome da moda que se d\u00ea ao cargo do respons\u00e1vel pela evolu\u00e7\u00e3o do produto. Limito-me aqui a chamar de Gerente de Produtos. O que faz esse tal Gerente de Produtos ent\u00e3o, se n\u00e3o cobrar e exigir produtividade?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">O Gerente de Produtos deve ter como objetivo ser a sustenta\u00e7\u00e3o e prover o suporte necess\u00e1rio ao time de desenvolvimento. Se o time tem que ser capaz de tomar as decis\u00f5es e se auto-organizar para desenvolver e entregar o m\u00e1ximo de valor nas entregas ao cliente, o Gerente de Produtos deve ser o canal de comunica\u00e7\u00e3o entre o time e os interessados pelo projeto (<\/span><i><span style=\"font-weight: 400;\">stakeholders<\/span><\/i><span style=\"font-weight: 400;\">), definir os objetivos e vis\u00e3o estrat\u00e9gica, construir um roadmap s\u00f3lido dos entreg\u00e1veis, priorizar as demandas e intermediar a integra\u00e7\u00e3o e o entendimento das principais \u00e1reas de desenvolvimento de um produto: <\/span><i><span style=\"font-weight: 400;\">UX<\/span><\/i><span style=\"font-weight: 400;\">, <\/span><i><span style=\"font-weight: 400;\">Business<\/span><\/i><span style=\"font-weight: 400;\"> e Tecnologia.<\/span><\/p>\n<div id=\"attachment_7486\" style=\"width: 820px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-7486\" class=\" wp-image-7486\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/skitch-1.png\" alt=\"\" width=\"810\" height=\"539\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/skitch-1.png 554w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/skitch-1-300x200.png 300w\" sizes=\"(max-width: 810px) 100vw, 810px\" \/><p id=\"caption-attachment-7486\" class=\"wp-caption-text\">Papel de um gerente de produto<\/p><\/div>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Diferentemente do tradicional Gerente de Projetos, o Gerente de Produtos deve focar no <\/span><b>&#8220;o que deve ser feito&#8221;<\/b><span style=\"font-weight: 400;\"> e menos em <\/span><b>&#8220;como deve ser feito<\/b><span style=\"font-weight: 400;\">&#8220;, sendo essa responsabilidade compartilhada com o time, o que inclui definir processo de desenvolvimento, remover impedimentos, tomar decis\u00f5es sobre mudan\u00e7a de escopo e detalhar requisitos das tarefas. Os times que antes eram considerados times de desenvolvedores, passaram a ser times de produto com membros multidisciplinares, respons\u00e1veis por validar, testar e desenvolv\u00ea-lo, como uma &#8220;mini-startup&#8221;.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Assumindo este como sendo o rumo que o papel do Gerente de Projetos tem tomado, \u00e9 fato que o engajamento e a participa\u00e7\u00e3o do time t\u00eam se tornado cada vez mais importante, o que mostra tamb\u00e9m o quanto os princ\u00edpios \u00e1geis t\u00eam influenciado na transforma\u00e7\u00e3o desse papel nas empresas que trabalham com desenvolvimento de software. \u00a0<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Para aprofundar um pouco mais nesse assunto, recomendo dois blogposts que foram escritos aqui na Plataformatec sobre <\/span><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\/\"><span style=\"font-weight: 400;\">defini\u00e7\u00e3o de objetivos<\/span><\/a><span style=\"font-weight: 400;\"> e <\/span><a href=\"http:\/\/blog.plataformatec.com.br\/2017\/04\/dilemas-de-uma-equipe-de-produto-desenhando-uma-entrega\/\"><span style=\"font-weight: 400;\">prioriza\u00e7\u00e3o de features e proje\u00e7\u00e3o de entregas<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Com a evolu\u00e7\u00e3o dos modelos de gest\u00e3o motivado pela necessidade de adapta\u00e7\u00e3o ao ambiente de desenvolvimento de software, o papel do Gerente de Projetos nas empresas de tecnologia tem se transformado bastante nos \u00faltimos tempos. Responsabilidades como aloca\u00e7\u00e3o de equipes, controle de recursos financeiros, desenvolvimento de cronogramas e elabora\u00e7\u00e3o de enormes Planos de Projetos passaram &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/04\/onde-foi-parar-o-gerente-de-projetos\/\">\u00bb<\/a><\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,284,275],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7475"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7475"}],"version-history":[{"count":8,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7475\/revisions"}],"predecessor-version":[{"id":7488,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7475\/revisions\/7488"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7475"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7475"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7475"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}