{"id":7377,"date":"2018-03-28T14:59:29","date_gmt":"2018-03-28T17:59:29","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7377"},"modified":"2018-03-28T15:01:43","modified_gmt":"2018-03-28T18:01:43","slug":"contagil-edicao-de-aniversario","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/03\/contagil-edicao-de-aniversario\/","title":{"rendered":"Cont\u00c1gil &#8211; Edi\u00e7\u00e3o de Anivers\u00e1rio"},"content":{"rendered":"<p>Fizemos a seguinte pergunta para a equipe de Agile da Plataformatec: &#8220;O gerenciamento de projetos de software tem mudado muito com o tempo. Waterfall, manifesto \u00c1gil, Scrum, Lean, Kanban\u2026 Como voc\u00ea acha que ser\u00e1 daqui a 5 anos? Alguma dica para se preparar para o futuro?&#8221;<\/p>\n<p>Veja aqui quais foram as respostas:<\/p>\n<h2><strong>Daniel Mello\u00a0<\/strong><\/h2>\n<p>Sempre existe a tend\u00eancia de que as novas metodologias apare\u00e7am como resposta a ponto fraco not\u00f3rio do status quo. Como nota-se que a abordagem Agile est\u00e1 sofrendo com quest\u00f5es de escalabilidade, ent\u00e3o a pr\u00f3xima onda metodol\u00f3gica dever\u00e1 atacar a gest\u00e3o de projetos dentro de uma vis\u00e3o mais corporativa e de neg\u00f3cios, principalmente porque n\u00e3o \u00e9 mais poss\u00edvel tratar o desenvolvimento de software como processo estanque ao restante da organiza\u00e7\u00e3o. Tamb\u00e9m percebo uma tend\u00eancia na evolu\u00e7\u00e3o das plataformas de gest\u00e3o, sendo que qualquer tecnologia disruptiva que afetar os neg\u00f3cios afetar\u00e1 tamb\u00e9m a gest\u00e3o de projetos de software. Isto posto, minhas apostas s\u00e3o na consolida\u00e7\u00e3o de abordagens de transforma\u00e7\u00e3o digital, transforma\u00e7\u00e3o \u00e1gil e \u00e1gil em escala, assim como no uso de tecnologias como blockchain e deep learning como bases para plataformas de gest\u00e3o de projetos.<\/p>\n<p>&nbsp;<\/p>\n<h2>Guilherme Fr\u00e9<\/h2>\n<p>Em minha opini\u00e3o, o futuro da gest\u00e3o de projetos tende a ser cada vez mais &#8220;agn\u00f3stico&#8221; com rela\u00e7\u00e3o a frameworks e metodologias, e cada vez menos uma busca por &#8220;balas de prata&#8221;. Neste cen\u00e1rio, o principal desafio de agilistas e gerentes de projeto ser\u00e1 compreender os contextos em que estar\u00e3o inseridos, de maneira que consigam selecionar as pr\u00e1ticas mais adequadas \u00e0s suas necessidades dentre aquelas propostas por frameworks e metodologias existentes, propor adapta\u00e7\u00f5es sempre que necess\u00e1rio e fomentar uma cultura de aprendizado, adapta\u00e7\u00e3o e melhoria cont\u00ednua, que \u00e9 base da mentalidade \u00e1gil.<\/p>\n<p>&nbsp;<\/p>\n<h2>Raphael Albino<\/h2>\n<p>Acredito que a base da gest\u00e3o de projetos que envolve prazo, custo, escopo, qualidade, riscos, expectativas e pessoas, n\u00e3o mudar\u00e1. Os clientes continuar\u00e3o buscando obter produtos de qualidade, com um baixo grau de risco e em um determinado momento do tempo. Dados hist\u00f3ricos e t\u00e9cnicas anal\u00edticas ser\u00e3o importantes para a proje\u00e7\u00e3o dos prazos de entrega. Gerenciar os anseios dos indiv\u00edduos, saber utilizar os meios de comunica\u00e7\u00e3o digitais para transmitir mensagens claras e conhecer as habilidades e compet\u00eancias dos indiv\u00edduos ser\u00e3o disciplinas fundamentais para uma gest\u00e3o efetiva de projetos. Al\u00e9m disso, vejo que uma discuss\u00e3o que ser\u00e1 importante para os pr\u00f3ximos anos estar\u00e1 em torno dos resultados alcan\u00e7ados atrav\u00e9s do produto dos projetos e para isso penso que as organiza\u00e7\u00f5es trabalhar\u00e3o cada vez mais com iniciativas pequenas e que possam ser testadas o mais r\u00e1pido poss\u00edvel.<\/p>\n<p>&nbsp;<\/p>\n<h2>Lucas Colucci<\/h2>\n<p>Com a intensifica\u00e7\u00e3o do uso de dados massivos para tomadas de decis\u00e3o (Big Data, Machine Learning e etc), e a automatiza\u00e7\u00e3o da coleta e an\u00e1lise de m\u00e9tricas de processo, o papel de um gerente de projetos (Agile Coach) pode ficar bem diferente. As ferramentas para facilitar a nossa vida podem ficar mais robustas, mas ainda precisaremos entender como elas funcionam e como modelar nossos problemas para aproveitar todo o potencial que elas podem trazer. Portanto, acredito que cada vez mais os GPs\/ACs precisar\u00e3o entender de estat\u00edstica e leitura de fluxo para se diferenciar no mercado e conseguir tomar melhores decis\u00f5es.<\/p>\n<p>&nbsp;<\/p>\n<h2>Henrique Oliveira<\/h2>\n<p>Nos \u00faltimos anos, o mercado tem demonstrado muito dinamismo. O que era considerado correto passa a ser questionado e, com isso, novas abordagens surgem para suprir as novas necessidades e demandas das organiza\u00e7\u00f5es. Os pr\u00f3ximos cinco anos ser\u00e3o desafiadores, visto que, atualmente, projetos envolvendo Intelig\u00eancia Artificial, Machine Learning e Transforma\u00e7\u00e3o Digital est\u00e3o criando ra\u00edzes nas empresas e, por isso, novos desafios e m\u00e9todos de trabalho surgir\u00e3o para que esses projetos terminem com sucesso. A dica de ouro \u00e9: mantenha-se atualizado, n\u00e3o se apegue a um m\u00e9todo de trabalho e sempre pense em inova\u00e7\u00e3o!<\/p>\n<p>&nbsp;<\/p>\n<h2>Felipe Gimenes<\/h2>\n<p>Se olharmos de forma mais ampla, a evolu\u00e7\u00e3o dos m\u00e9todos \u00e1gil ofereceu maior autonomia a cada membro dos times, diminuindo assim, a depend\u00eancia entre eles. Portanto, dado o contexto do ambiente de TI, a tend\u00eancia s\u00e3o as equipes \u00e1geis trabalharem cada vez mais de forma remota, aumentando a necessidade por ferramentas e t\u00e9cnicas que possam garantir a qualidade do processo e mitigar os riscos de comunica\u00e7\u00e3o.<\/p>\n<p>&nbsp;<\/p>\n<h2>Luiz Bernardo<\/h2>\n<p>Com a onda de transforma\u00e7\u00e3o digital, acredito que teremos dois grupos de organiza\u00e7\u00f5es daqui a um tempo: um em que aplicaram ferramentas\/metodologias\/solu\u00e7\u00f5es \u201cbala de prata\u201d, acabaram n\u00e3o tendo todos os resultados desejados e ter\u00e3o resist\u00eancia a fazer novas tentativas, assumindo que o \u00e1gil em si fracassou; e outro grupo em que focou mais nos resultados obtidos, usando solu\u00e7\u00f5es de maneira mais pragm\u00e1tica focando nos problemas. Os agilistas devem se atentar mais aos resultados, diversificar seu ferramental e acrescentar \u201chard skills\u201d \u00e0s suas habilidades para ir de encontro \u00e0s ansiedades da sua organiza\u00e7\u00e3o.<\/p>\n<p>&nbsp;<\/p>\n<h2>Wesley Zapellini<\/h2>\n<p>Em cinco anos estaremos lidando com o resultado das transforma\u00e7\u00f5es digitais (as de sucesso e as nem tanto). Contextos em que frameworks de escala como SaFE, LeSS e DaD foram adotados e necessitam de ajustes para que fa\u00e7am sentido ao prop\u00f3sito das organiza\u00e7\u00f5es.<br \/>\nMinha dica para este futuro \u00e9 conhecer as virtudes e fraquezas destes modelos e despir-se da prefer\u00eancia pessoal para que o foco seja resolver problemas em vez de aplicar m\u00e9todos.<\/p>\n<p>&nbsp;<\/p>\n<div id=\"attachment_7403\" style=\"width: 1317px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-7403\" class=\"wp-image-7403\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/agoravai-1-1024x305.png\" alt=\"\" width=\"1307\" height=\"389\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/agoravai-1-1024x305.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/agoravai-1-300x89.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/agoravai-1-768x229.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/agoravai-1.png 1230w\" sizes=\"(max-width: 1307px) 100vw, 1307px\" \/><p id=\"caption-attachment-7403\" class=\"wp-caption-text\">Nossa equipe de agile, da esquerda para a direita: Daniel Mello, Wesley Zapellini, Luiz Bernardo, Guilherme Fr\u00e9, Lucas Colucci, Raphael Albino, Henrique Oliveira e Felipe Gimenes<\/p><\/div>\n<p>&nbsp;<\/p>\n<p>Essas foram as respostas dos consultores. E voc\u00ea? Qual \u00e9 sua opini\u00e3o sobre o tema? Compartilhe conosco nos coment\u00e1rios!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fizemos a seguinte pergunta para a equipe de Agile da Plataformatec: &#8220;O gerenciamento de projetos de software tem mudado muito com o tempo. Waterfall, manifesto \u00c1gil, Scrum, Lean, Kanban\u2026 Como voc\u00ea acha que ser\u00e1 daqui a 5 anos? Alguma dica para se preparar para o futuro?&#8221; Veja aqui quais foram as respostas: Daniel Mello\u00a0 Sempre &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/03\/contagil-edicao-de-aniversario\/\">\u00bb<\/a><\/p>\n","protected":false},"author":63,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,284],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7377"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7377"}],"version-history":[{"count":27,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7377\/revisions"}],"predecessor-version":[{"id":7409,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7377\/revisions\/7409"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7377"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7377"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7377"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}