{"id":9106,"date":"2019-06-24T14:04:22","date_gmt":"2019-06-24T17:04:22","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9106"},"modified":"2019-06-25T11:28:15","modified_gmt":"2019-06-25T14:28:15","slug":"abandonei-um-item-de-trabalho-do-meu-kanban-e-agora","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/06\/abandonei-um-item-de-trabalho-do-meu-kanban-e-agora\/","title":{"rendered":"Abandonei um item de trabalho do meu kanban, e agora?"},"content":{"rendered":"<p>Depois de iniciar o trabalho em um determinado item, o time chega \u00e0 conclus\u00e3o de que n\u00e3o faz mais sentido prosseguir e que devem abandon\u00e1-lo. E a agora?<\/p>\n<ul>\n<li>Removemos o item do quadro e segue a vida?<\/li>\n<li>Registramos em algum lugar?<\/li>\n<li>Movemos para alguma \u00e1rea especial do quadro?<\/li>\n<li>E as m\u00e9tricas, como ficam?<\/li>\n<\/ul>\n<p>\u00c9 comum que esta situa\u00e7\u00e3o crie dilemas, principalmente se o time j\u00e1 adota m\u00e9tricas de processo. Neste texto recomendarei como lidar com esta situa\u00e7\u00e3o.<\/p>\n<p>N\u00e3o deixe de conferir este outro texto que escrevi sobre mais um dilema muito comum: O de mover para tr\u00e1s ou n\u00e3o os itens do quadro kanban:<br \/>\n<a href=\"http:\/\/blog.plataformatec.com.br\/2019\/02\/evite-mover-itens-para-tras-em-um-quadro-kanban\/.\" target=\"_blank\" rel=\"noopener noreferrer\">Neste Link<\/a>.<\/p>\n<h4><strong>Tempo e dinheiro jogados fora<\/strong><\/h4>\n<hr>\n<p>Abandonar um item de trabalho iniciado \u00e9 desperd\u00edcio. Significa que as etapas anteriores do processo n\u00e3o est\u00e3o conseguindo garantir que estamos trabalhando na coisa certa. O esfor\u00e7o de refinamento, desenvolvimento e valida\u00e7\u00e3o empregado at\u00e9 aqui foi jogado fora e isto custa <strong>bem<\/strong>&nbsp;caro. Al\u00edas, quanto mais tardiamente descobrimos que algo deve ser abandonado, mais caro custa.<\/p>\n<p>Este tipo de desperd\u00edcio \u00e9 classificado pelo <em>Lean Institute<\/em> como <a href=\"https:\/\/www.lean.org\/lexicon\/muda-mura-muri\" target=\"_blank\" rel=\"noopener noreferrer\"><em>muda<\/em><\/a>:<\/p>\n<blockquote><p>Qualquer atividade que consuma recursos sem criar valor para ao cliente.<\/p><\/blockquote>\n<p>A seguir listei as principais recomenda\u00e7\u00f5es que costumam funcionar nesta situa\u00e7\u00e3o:<\/p>\n<h4><strong>Antes de qualquer coisa, avalie a frequ\u00eancia do fen\u00f4meno<\/strong><\/h4>\n<hr>\n<p>Reduzir desperd\u00edcio \u00e9 um dos mantras da filosofia <em>Lean<\/em>, algo que deve ser perseguido para que o fluxo de trabalho seja saud\u00e1vel.<\/p>\n<p>Se no seu caso acontece um abandono a cada 6 meses, talvez o custo de se adotar as medidas que vou recomendar a seguir seja maior que o retorno obtido como resultado delas. Se for este o caso, elimine o item e siga em frente. Caso contr\u00e1rio, considere adotar as medidas a abaixo:<\/p>\n<h4><strong>D\u00ea visibilidade para o abandono<\/strong><\/h4>\n<hr>\n<p>Tornar vis\u00edvel o abandono de itens ajuda a entender o fen\u00f4meno e suas causas, bem como transmitir \u00e0s outras pessoas a import\u00e2ncia de se resolver o problema.<\/p>\n<p><strong>Usando o quadro <em>kanban<\/em><\/strong><br \/>\nConsidere ter em seu quadro kanban alguma \u00e1rea espec\u00edfica para onde itens abandonados ser\u00e3o transportados e agrupados pelo motivo do abadono. Deste modo, com uma espiada saber\u00edamos responder quantos e quais abandonos aconteceram em um determinado per\u00edodo de tempo e tamb\u00e9m quais os principais motivos de desperd\u00edcio.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9107 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/quadro.jpeg\" alt=\"\" width=\"1920\" height=\"1080\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/quadro.jpeg 1920w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/quadro-300x169.jpeg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/quadro-768x432.jpeg 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/quadro-1024x576.jpeg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" \/><\/p>\n<p><strong>Usando m\u00e9tricas de processo<\/strong><br \/>\nConsidere tamb\u00e9m adotar m\u00e9tricas que falem sobre o abandono de itens, pois de posse de dados seremos capazes de diagnosticar melhor a situa\u00e7\u00e3o.<\/p>\n<p>Podemos pensar em medi\u00e7\u00f5es que respondam perguntas como estas:<\/p>\n<ul>\n<li>Quantos itens abandonamos nesta semana ou no per\u00edodo de tempo &#8220;x&#8221;?<\/li>\n<li>Em que etapa estavam os itens quando foram abandonados?<\/li>\n<li>Que propor\u00e7\u00e3o da nossa capacidade \u00e9 desperdi\u00e7ada com itens abandonados? Esta propor\u00e7\u00e3o est\u00e1 aumentando ou diminuindo?<\/li>\n<\/ul>\n<p>Que poderiam ser representadas por visualiza\u00e7\u00f5es como estas:<\/p>\n<div id=\"attachment_9108\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-9108\" class=\"wp-image-9108 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/entregas_x_abandonos.png\" alt=\"\" width=\"600\" height=\"371\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/entregas_x_abandonos.png 600w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/entregas_x_abandonos-300x186.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><p id=\"caption-attachment-9108\" class=\"wp-caption-text\">Comparativo entre a quantidade de itens entregues e abandonados semanalmente.<\/p><\/div>\n<p>&#8211;<\/p>\n<div id=\"attachment_9109\" style=\"width: 863px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-9109\" class=\"wp-image-9109 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/abandonos_por_etapa.png\" alt=\"\" width=\"853\" height=\"371\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/abandonos_por_etapa.png 853w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/abandonos_por_etapa-300x130.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/abandonos_por_etapa-768x334.png 768w\" sizes=\"(max-width: 853px) 100vw, 853px\" \/><p id=\"caption-attachment-9109\" class=\"wp-caption-text\">Abandonos semanais por etapa do fluxo.<\/p><\/div>\n<p>Vale ressaltar que para obter <em>insigths<\/em> \u00e9 importante combinar as m\u00e9tricas e visualiza\u00e7\u00f5es sugeridas acima com medi\u00e7\u00f5es de fluxo habituais, como por exemplo o <em>lead time<\/em>. Deste modo seria poss\u00edvel entender quando tempo do time foi investido em um item posteriormente abandonado e refletir sobre as consequ\u00eancias disso.<\/p>\n<p>Algumas ferramentas digitais como o <em>SwiftKanban<\/em> oferecem <a href=\"https:\/\/www.digite.com\/blog\/muda-in-kanban-system\/\" target=\"_blank\" rel=\"noopener noreferrer\">recursos para medi\u00e7\u00f5es e visualiza\u00e7\u00f5es como as que recomendei<\/a>.<\/p>\n<h4><strong>Diagnostique a situa\u00e7\u00e3o e lide com o desperd\u00edcio<\/strong><\/h4>\n<hr>\n<p>Dado que agora possu\u00edmos instrumentos que proporcionam visibilidade para o problema, \u00e9 hora de interpretar os dados e diagnosticar a situa\u00e7\u00e3o.<\/p>\n<p>Um primero passo nesta dire\u00e7\u00e3o seria, em algum encontro que vise melhoria cont\u00ednua:<\/p>\n<ul>\n<li>Agrupar os itens abandonados pelo motivo do abandono;<\/li>\n<li>Selecionar qual dos motivos deve ser objeto de uma investiga\u00e7\u00e3o mais profunda (o mais frequente, o que mais desperdi\u00e7a tempo ou dinheiro, etc);<\/li>\n<li>Investigar a causa raiz do problema;<\/li>\n<li>Colocar em andamento um plano de a\u00e7\u00e3o para atacar a causa raiz;<\/li>\n<\/ul>\n<p>Para facilitar uma din\u00e2mica como esta, voc\u00ea pode buscar inspira\u00e7\u00e3o <a href=\"https:\/\/www.infoq.com\/articles\/blockers-defects-process-improvement\" target=\"_blank\" rel=\"noopener noreferrer\">neste artigo do Troy Magennis<\/a> e <a href=\"https:\/\/www.leanability.com\/en\/blog-en\/2013\/09\/blocker-clusters-problems-are-not-isolated-events-3\/\" target=\"_blank\" rel=\"noopener noreferrer\">neste outro do Klaus Leopold<\/a>, ambos abordam uma t\u00e9cnica de agrupamento de <em>blockers <\/em>que pode ser transportada para o contexto do abandono de itens.<\/p>\n<p>Ap\u00f3s compreender as origens dos abandonos e colocar o plano de a\u00e7\u00e3o em andamento, acompanhe o comportamento do sistema afim de entender se as medidas adotadas proporcionaram uma redu\u00e7\u00e3o no desperd\u00edcio (usando as m\u00e9tricas sugeridas, por exemplo). Caso o resultado n\u00e3o tenha sido positivo, repense o plano de a\u00e7\u00e3o.<\/p>\n<p>Acredito que o tipo de an\u00e1lise feita nesta etapa tem conex\u00e3o com a cad\u00eancia <em>Risk Review<\/em> do Kanban, no fim das contas estamos analisando um risco e tomando a\u00e7\u00f5es para control\u00e1-lo ou elimin\u00e1-lo. Recomendo a leitura <a href=\"https:\/\/www.djaa.com\/project-management-kanban-part-4-risk-review\" target=\"_blank\" rel=\"noopener noreferrer\">deste texto do David Anderson<\/a>&nbsp;para esclarecer esta conex\u00e3o.<\/p>\n<h4><strong>T\u00e9cnicas como <em>Upstream Kanban<\/em>&nbsp;podem ajudar<\/strong><\/h4>\n<hr>\n<p>Um dos motivos mais recorrentes para o abandono est\u00e1 relacionado a refinamento e prioriza\u00e7\u00e3o insuficientes, que acabam por permitir que itens de trabalho que ainda n\u00e3o satisfa\u00e7am os crit\u00e9rios m\u00ednimos para que sejam codificados iniciem sua jornada pelo fluxo de desenvolvimento e depois gerem desperd\u00edcio.<\/p>\n<p>Sabendo disso, esteja atento para promover melhorias nas etapas de &#8220;preparo&#8221;, usando t\u00e9cnicas como o <em>Upstream Kanban<\/em>.<\/p>\n<p>Proposta por Patrick Steyaert, a ideia do <em>Upstream Kanban<\/em> \u00e9 garantir que esteja dispon\u00edvel um invent\u00e1rio de &#8220;op\u00e7\u00f5es&#8221; bem definidas e valorosas, para que quando o time escolha se comprometer com alguma delas e lev\u00e1-la ao <em>Downstream<\/em>, a chance de desperd\u00edcio seja a menor poss\u00edvel.<\/p>\n<p>A modelagem do processo no <em>Upstream<\/em>&nbsp;inclusive incentiva o descarte de op\u00e7\u00f5es que n\u00e3o se mostram vi\u00e1veis ou valorosas o suficiente. Neste caso descartar \u00e9 vantajoso, pois est\u00e1 sendo feito antecipadamente enquanto o investimento de esfor\u00e7o ainda \u00e9 baixo naquele item.<\/p>\n<div id=\"attachment_9110\" style=\"width: 1798px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-9110\" class=\"wp-image-9110 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/upstream_kanban.png\" alt=\"\" width=\"1788\" height=\"730\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/upstream_kanban.png 1788w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/upstream_kanban-300x122.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/upstream_kanban-768x314.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/upstream_kanban-1024x418.png 1024w\" sizes=\"(max-width: 1788px) 100vw, 1788px\" \/><p id=\"caption-attachment-9110\" class=\"wp-caption-text\">Fonte: Essential Upstream Kanban, Patrick Steyaert.<\/p><\/div>\n<p>Para se aprofundar no assunto, recomendo a leitura do <a href=\"https:\/\/leankanban.com\/upstream\/\" target=\"_blank\" rel=\"noopener noreferrer\">Essential Upstream Kanban<\/a>, um ebook gratuito escrito pelo pr\u00f3prio Patrick.<\/p>\n<h4><strong>Finalizando<\/strong><\/h4>\n<hr>\n<p>Condensei no texto as principais recomenda\u00e7\u00f5es que costumo fornecer (e que costumam ter efeito positivo) para quando se deseja lidar com desperd\u00edcio no fluxo de trabalho. No fim das contas, estamos falando sobre tornar o fluxo vis\u00edvel e concordar em melhor\u00e1-lo evolutivamente, algumas das pr\u00e1ticas e princ\u00edpios mais marcantes do Kanban.<\/p>\n<p>E para voc\u00ea? Como tem sido lidar com desperd\u00edcio no seu contexto?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Depois de iniciar o trabalho em um determinado item, o time chega \u00e0 conclus\u00e3o de que n\u00e3o faz mais sentido prosseguir e que devem abandon\u00e1-lo. E a agora? Removemos o item do quadro e segue a vida? Registramos em algum lugar? Movemos para alguma \u00e1rea especial do quadro? E as m\u00e9tricas, como ficam? \u00c9 comum &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/06\/abandonei-um-item-de-trabalho-do-meu-kanban-e-agora\/\">\u00bb<\/a><\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9106"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9106"}],"version-history":[{"count":18,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9106\/revisions"}],"predecessor-version":[{"id":9131,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9106\/revisions\/9131"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9106"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9106"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9106"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}