{"id":6202,"date":"2017-03-24T12:12:07","date_gmt":"2017-03-24T15:12:07","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6202"},"modified":"2017-03-27T13:50:26","modified_gmt":"2017-03-27T16:50:26","slug":"desenvolvendo-melhoria-continua-em-seu-processo-agil-um-daily-meeting-diferente","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/03\/desenvolvendo-melhoria-continua-em-seu-processo-agil-um-daily-meeting-diferente\/","title":{"rendered":"Desenvolvendo melhoria cont\u00ednua em seu processo \u00e1gil: Um Daily Meeting diferente"},"content":{"rendered":"<p>Parab\u00e9ns na ado\u00e7\u00e3o da cerim\u00f4nia de <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/02\/desenvolvendo-melhoria-continua-em-seu-processo-agil-a-cerimonia-de-reality-check\/\">Reality Check<\/a>! Voc\u00ea nunca teve o mesmo problema novamente e seu plano de neg\u00f3cios agora muda mais r\u00e1pido de acordo com as nuances do seu plano de desenvolvimento. (Para entender sobre o que estamos falando, d\u00ea uma olhada no primeiro blog post desta s\u00e9rie: <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/02\/desenvolvendo-melhoria-continua-em-seu-processo-agil-a-cerimonia-de-reality-check\/\">Desenvolvendo melhoria cont\u00ednua em seu processo \u00e1gil: A cerim\u00f4nia de Reality Check<\/a>)<\/p>\n<p>Seu produto come\u00e7a a ficar mais robusto, e seus clientes come\u00e7am a aderir a ideia&#8230; Incr\u00edvel! No entanto, seu time est\u00e1 se sentindo um pouco desmotivado. Voc\u00ea come\u00e7a a participar de suas retrospectivas para checar como poderia ajudar, e observa um padr\u00e3o: as pessoas est\u00e3o reclamando, com outras palavras, que o Especialista \u00c1gil est\u00e1 micro-gerenciando a todos.<\/p>\n<p>Voc\u00ea decide acompanhar de perto o time durante um m\u00eas, observando o que est\u00e1 ocorrendo em rela\u00e7\u00e3o a isso. De repente voc\u00ea se v\u00ea em uma Daily Meeting, na qual todos falam sobre o que fizeram e o que far\u00e3o. Voc\u00ea ent\u00e3o v\u00ea o problema: eles est\u00e3o usando o Daily para reportar trabalho, ao inv\u00e9s de pulverizar conhecimento e remover bloqueios. Mas e agora? Como conseguir estes objetivos sem a sensa\u00e7\u00e3o de reporte?<\/p>\n<hr \/>\n<p>O sentimento de um Daily micro-gerenciador sempre me acompanhou quando trabalhava como desenvolvedor. Eu sempre pensei que pessoas queriam que eu reportasse o que estava fazendo, com a inten\u00e7\u00e3o de saber exatamente o qu\u00e3o eficiente eu era. Isso causava diferentes tipos de comportamento, o mais comum era fazer mais coisas ao mesmo tempo, para mostrar que estava trabalhando mais.<\/p>\n<p>No entanto, fazer mais tarefas ao mesmo tempo pode trazer lentid\u00e3o ao processo, tirar valor do que voc\u00ea est\u00e1 fazendo e afetar o resto do time. Mais sobre esse assunto pode ser encontrado nestes blog posts:<br \/>\n* <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/09\/case-study-of-a-wip-limit-implementation-why-when-and-how-to-use-wip-limits\/\">Case Study of a WIP Limit Implementation: Why, When and How to use WIP Limits<\/a><br \/>\n* <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/02\/a-sindrome-do-heroi-e-como-lidar-com-ela\/\">A s\u00edndrome do her\u00f3i e como lidar com ela<\/a><\/p>\n<p>Portanto, para superar essa situa\u00e7\u00e3o, n\u00f3s da Plataformatec come\u00e7amos a usar uma abordagem diferente em nossos Dailies. N\u00f3s vimos que o problema do &#8220;m\u00e9todo antigo&#8221; era que os times focavam no que <strong>cada pessoa<\/strong> fazia ao inv\u00e9s de focar no progresso do projeto. Com isso em mente, mudamos o foco. Ao inv\u00e9s de perguntar \u00e0s pessoas o que fizeram, passamos a perguntar \u00e0s hist\u00f3rias.<\/p>\n<p>N\u00e3o, n\u00e3o estamos ficando loucos (eu acho)&#8230; E obviamente n\u00e3o estamos conversando com post-its (apesar de que falar com objetos inanimados pode ajudar no desenvolvimento, como <a href=\"https:\/\/en.wikipedia.org\/wiki\/Rubber_duck_debugging\">patos de borracha<\/a>). No entanto, mudamos como perguntamos as coisas. Aqui est\u00e1 nossa vers\u00e3o:<\/p>\n<p>Come\u00e7amos olhando o kanban, da direita para a esquerda, perguntando ao time todo como est\u00e1 o desenvolvimento de cada hist\u00f3ria:<\/p>\n<ul>\n<li>Como est\u00e1 seu desenvolvimento? Alguma dificuldade t\u00e9cnica?<\/li>\n<li>Existe algum bloqueio para o seu desenvolvimento?<\/li>\n<\/ul>\n<p>Voc\u00ea pode achar que n\u00e3o \u00e9 t\u00e3o diferente do Daily usual. No entanto, deixe-me pontuar aqui as diferen\u00e7as e suas import\u00e2ncias:<\/p>\n<ul>\n<li><strong>N\u00f3s olhamos para as hist\u00f3rias no quadro da direita para esquerda.<\/strong> Olhar a hist\u00f3ria mais a frente no processo nos faz olhar para o que provavelmente nos trar\u00e1 mais valor em um curto per\u00edodo de tempo.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/kanban-pt.png\" alt=\"Kanban\" width=\"961\" height=\"462\" class=\"aligncenter size-full wp-image-6211\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/kanban-pt.png 961w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/kanban-pt-300x144.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/kanban-pt-768x369.png 768w\" sizes=\"(max-width: 961px) 100vw, 961px\" \/><\/p>\n<ul>\n<li><strong>As quest\u00f5es s\u00e3o agora direcionadas ao time, n\u00e3o \u00e0 uma pessoa.<\/strong> Perguntar ao time todo sobre uma hist\u00f3ria traz de volta o sentimento de time, que perdemos quando fazemos perguntas individuais. Mostra que n\u00f3s n\u00e3o nos importamos com o que cada um est\u00e1 trabalhando, e quanto. Nos importamos com o desenvolvimento do projeto.<\/p>\n<\/li>\n<li>\n<p><strong>O sujeito das perguntas n\u00e3o \u00e9 mais &#8220;Voc\u00ea&#8221;, e sim a hist\u00f3ria.<\/strong> Costum\u00e1vamos a perguntar coisas como &#8220;O que voc\u00ea fez ontem? Algo est\u00e1 te bloqueando?&#8221; e etc. Mudando o sujeito da pergunta, refor\u00e7amos o foco no desenvolvimento da hist\u00f3ria, e tamb\u00e9m fazemos o time conversar apenas sobre o que \u00e9 importante ao projeto, e n\u00e3o sobre t\u00f3picos perif\u00e9ricos.<\/p>\n<\/li>\n<li>\n<p><strong>Extra: N\u00f3s simplesmente olhamos mais para o quadro.<\/strong> Sim, t\u00e3o simples quanto isso. Voc\u00ea provavelmente j\u00e1 viu que, com o tempo, as pessoas come\u00e7am a n\u00e3o olhar mais para o quadro como inicialmente. O simples fato de us\u00e1-lo como base da cerim\u00f4nia, traz aten\u00e7\u00e3o a ele, fazendo com que possamos facilmente ver quando algu\u00e9m est\u00e1 trabalhando em excesso, quando uma hist\u00f3ria est\u00e1 parada na mesma coluna por muito tempo ou outros problemas relacionados.<\/p>\n<\/li>\n<\/ul>\n<h2>Conclus\u00e3o<\/h2>\n<p>O que sugerimos aqui n\u00e3o \u00e9 uma mudan\u00e7a grande, na verdade \u00e9 bem discreta. Ao inv\u00e9s de focar nas pessoas, foque no que est\u00e1 sendo desenvolvido. Voc\u00ea ver\u00e1 grandes melhoras no sentimento das pessoas, todos estar\u00e3o em contato di\u00e1rio com o processo atrav\u00e9s do quadro e, como a famosa cita\u00e7\u00e3o do Lean diz, as pessoas v\u00e3o <em>parar de come\u00e7ar tarefas e come\u00e7ar a termin\u00e1-las<\/em>.<\/p>\n<p>O que achou? Voc\u00ea utilizaria este m\u00e9todo? Deixe seus coment\u00e1rios abaixo!<\/p>\n<hr \/>\n<div style=\"margin:20px 0 60px;\">\n<a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=contagil-subscription&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\"><img decoding=\"async\" style=\"max-width:90%;\" class=\"aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png\" alt=\"Quero assinar a Cont\u00c1gil Newsletter\"\/><\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Parab\u00e9ns na ado\u00e7\u00e3o da cerim\u00f4nia de Reality Check! Voc\u00ea nunca teve o mesmo problema novamente e seu plano de neg\u00f3cios agora muda mais r\u00e1pido de acordo com as nuances do seu plano de desenvolvimento. (Para entender sobre o que estamos falando, d\u00ea uma olhada no primeiro blog post desta s\u00e9rie: Desenvolvendo melhoria cont\u00ednua em seu &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/03\/desenvolvendo-melhoria-continua-em-seu-processo-agil-um-daily-meeting-diferente\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,254,52],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6202"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6202"}],"version-history":[{"count":11,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6202\/revisions"}],"predecessor-version":[{"id":6227,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6202\/revisions\/6227"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6202"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6202"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6202"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}