{"id":7865,"date":"2018-11-01T17:20:31","date_gmt":"2018-11-01T19:20:31","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7865"},"modified":"2018-11-06T16:29:12","modified_gmt":"2018-11-06T18:29:12","slug":"trabalhando-com-times-distribuidos","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/11\/trabalhando-com-times-distribuidos\/","title":{"rendered":"Trabalhando com times distribu\u00eddos"},"content":{"rendered":"<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7903\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_529786036-1-1024x616.png\" alt=\"trabalho remoto\" width=\"1024\" height=\"616\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_529786036-1-1024x616.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_529786036-1-300x181.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_529786036-1-768x462.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>Segundo a <a href=\"https:\/\/hbr.org\/2015\/10\/global-teams-that-work\" target=\"_blank\" rel=\"noopener\">Harvard Business Review<\/a>, uma das maiores dificuldades de times hoje e no futuro ser\u00e1 o fator da dist\u00e2ncia. Cada dia que passa, \u00e9 mais comum trabalharmos com times remotos, o que gera um grande obst\u00e1culo na comunica\u00e7\u00e3o, algo que por si s\u00f3 j\u00e1 \u00e9 um tema complexo.<\/p>\n<p>Para trabalharmos bem com times distribu\u00eddos, devemos estar sempre atentos \u00e0 nossa comunica\u00e7\u00e3o, de forma a sempre passarmos nossas mensagens com a maior clareza poss\u00edvel e evitarmos, assim, vis\u00f5es divergentes acerca do mesmo assunto.<\/p>\n<p>Al\u00e9m de uma comunica\u00e7\u00e3o efetiva, tamb\u00e9m devemos utilizar de maneira eficiente as ferramentas que temos dispon\u00edveis para esse tipo de situa\u00e7\u00e3o. Abaixo listarei algumas dicas e boas pr\u00e1ticas que temos utilizado aqui na Ptec para extrair o maior valor poss\u00edvel das ferramentas de trabalho remoto dispon\u00edveis.<\/p>\n<h2>COMUNICA\u00c7\u00c3O<\/h2>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7902\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_670364068-1024x768.png\" alt=\"comunica\u00e7\u00e3o\" width=\"1024\" height=\"768\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_670364068-1024x768.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_670364068-300x225.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_670364068-768x576.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_670364068.png 1666w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>O primeiro grupo de ferramentas, e de longe as mais utilizadas, s\u00e3o as ferramentas de videoconfer\u00eancia. Essas ferramentas t\u00eam um valor adicional \u00e0 comunica\u00e7\u00e3o via e-mail por trazerem maior facilidade de tirar d\u00favidas acerca de assuntos complexos. Outro valor muito importante \u00e9 a possibilidade da utiliza\u00e7\u00e3o de linguagem corporal, atrav\u00e9s da webcam, para melhor explicar algum ponto. As que mais utilizo s\u00e3o <a href=\"https:\/\/meet.google.com\/\" target=\"_blank\" rel=\"noopener\">Google Meet<\/a>\u00a0e <a href=\"https:\/\/hangouts.google.com\/\" target=\"_blank\" rel=\"noopener\">Hangouts<\/a>. Al\u00e9m dessas duas tamb\u00e9m recomendo <a href=\"https:\/\/appear.in\" target=\"_blank\" rel=\"noopener\">Appear.in<\/a> e <a href=\"https:\/\/zoom.us\" target=\"_blank\" rel=\"noopener\">Zoom.us<\/a>.<\/p>\n<p>Algumas dicas importantes na utiliza\u00e7\u00e3o dessas ferramentas:<\/p>\n<ul>\n<li>Sempre que n\u00e3o estiver falando deixe o seu microfone no mudo, pois isso evita que ru\u00eddos de pessoas a sua volta atrapalhem a reuni\u00e3o;<\/p>\n<\/li>\n<li>\n<p>Prefira a utiliza\u00e7\u00e3o de headphones ao uso do microfone e do som integrado do notebook, a fim de melhorar a qualidade do som;<\/p>\n<\/li>\n<li>\n<p>Ao falar com a webcam ligada, olhe para a c\u00e2mera e n\u00e3o para a tela onde est\u00e1 sendo mostrada a sua imagem projetada, isso aumenta o engajamento com a sua audi\u00eancia e com isso seu poder de influ\u00eancia;<\/p>\n<\/li>\n<li>\n<p>Tenha um agenda clara do objetivo da reuni\u00e3o e envie-a para todos que forem participar;<\/p>\n<\/li>\n<li>\n<p>Caso esteja em um grupo de pessoas em uma sala, sempre deixe a webcam ligada de uma maneira que sempre mostre todos os membros da equipe. Isso facilita a identifica\u00e7\u00e3o do interlocutor e evita que haja conversas paralelas entre as pessoas da sala. Caso identifique que uma pessoa conectada remotamente esteja falando e algumas pessoas da sala estejam conversando com o microfone desligado, pe\u00e7a que o assunto seja compartilhado entre todos, para evitar silos de comunica\u00e7\u00e3o e perda de informa\u00e7\u00f5es.<\/p>\n<\/li>\n<\/ul>\n<p>Embora seja menos efetiva que uma videoconfer\u00eancia, alguns aplicativos de mensagens instant\u00e2neas s\u00e3o prefer\u00edveis \u00e0 comunica\u00e7\u00e3o via e-mail, devido a facilidade e velocidade de resposta. A que melhor tem atendido minhas necessidades no momento \u00e9 o <a href=\"https:\/\/slack.com\" target=\"_blank\" rel=\"noopener\">Slack<\/a>.<\/p>\n<h2>COCRIA\u00c7\u00c3O<\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-7900\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_244695082.jpg\" alt=\"\" width=\"1000\" height=\"553\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_244695082.jpg 1000w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_244695082-300x166.jpg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_244695082-768x425.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p>Uma das dificuldades de times distribu\u00eddos \u00e9 conseguir que os membros estejam alinhados acerca dos objetivos a serem alcan\u00e7ados. Uma forma de reduzir esse problema \u00e9 aproximando as pessoas nos momentos em que forem tra\u00e7ados os objetivos e, para tanto, precisamos de ferramentas que possibilitem a intera\u00e7\u00e3o das pessoas que est\u00e3o remotas.<\/p>\n<p>Uma ferramenta que gosto muito de utilizar \u00e9 o <a href=\"https:\/\/www.draw.io\" target=\"_blank\" rel=\"noopener\">Draw.io<\/a>, ferramenta online e gratuita para cria\u00e7\u00e3o de diagramas. Nele \u00e9 poss\u00edvel que m\u00faltiplas pessoas trabalhem ao mesmo tempo e dessa forma colaborem. \u00c9 uma ferramenta \u00f3tima para organizar uma sess\u00e3o de <em>Brainstorm<\/em> ou uma cerim\u00f4nia de Retrospectiva, por exemplo.<\/p>\n<p>Outra ferramenta que considero interessante \u00e9 o <a href=\"https:\/\/www.groupmap.com\" target=\"_blank\" rel=\"noopener\">GroupMap<\/a>, por\u00e9m paga, mas que tamb\u00e9m possibilita que v\u00e1rios usu\u00e1rios acessem e alterem o mesmo <em>board<\/em>.<\/p>\n<p>Al\u00e9m das duas citadas acima, tamb\u00e9m vale dar uma olhada no <a href=\"https:\/\/realtimeboard.com\" target=\"_blank\" rel=\"noopener\">RealTimeBoard<\/a>, que por sua vez tem uma vers\u00e3o <em>trial<\/em> e outra paga.<\/p>\n<p>Algumas dicas para organizar se\u00e7\u00f5es utilizando esse tipo de ferramenta:<\/p>\n<ul>\n<li>Pe\u00e7a sempre para a pessoa que estiver alterando alguma coisa diga o que est\u00e1 fazendo e o motivo, pois isso evita que as coisas comecem a se mover sem que o grupo saiba o motivo;<\/li>\n<li>Eleja um facilitador para ser o respons\u00e1vel por manter a sess\u00e3o organizada e focada no objetivo. Por se tratar de uma ferramenta em que qualquer integrante pode fazer altera\u00e7\u00f5es em qualquer ponto dos diagramas, \u00e9 necess\u00e1rio algu\u00e9m para ajudar a focar no que deve ser feito;<\/li>\n<li>Sempre utilize alguma ferramenta de videoconfer\u00eancia junto \u00e0 ferramenta de cocria\u00e7\u00e3o, para facilitar e melhorar a comunica\u00e7\u00e3o;<\/li>\n<li>Pe\u00e7a para que as pessoas utilizem seus pr\u00f3prios computadores em vez de dividirem um, mesmo que trabalhem pr\u00f3ximas, para aumentar a colabora\u00e7\u00e3o e o engajamento de todos.<\/li>\n<\/ul>\n<p>Al\u00e9m destas, as aplica\u00e7\u00f5es do <a href=\"https:\/\/www.google.com\/drive\" target=\"_blank\" rel=\"noopener\">Google Drive<\/a>\u00a0s\u00e3o \u00f3timas para dividir documentos, planilhas e apresenta\u00e7\u00f5es.<\/p>\n<h2>ORGANIZA\u00c7\u00c3O DO TRABALHO<\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-7905\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_1135607204-1024x731.png\" alt=\"\" width=\"1024\" height=\"731\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_1135607204-1024x731.png 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_1135607204-300x214.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_1135607204-768x548.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/10\/shutterstock_1135607204.png 1458w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>Outra dificuldade de times apartados \u00e9 a quest\u00e3o de prioriza\u00e7\u00e3o de tarefas e quem deve fazer o que. Para resolver esse problema necessitamos de ferramentas que possam, al\u00e9m de mostrar as atividades a serem feitas, mostrar com clareza quais j\u00e1 est\u00e3o sendo feitas e dessa forma, evitar que duas pessoas fa\u00e7am o mesmo trabalho.<\/p>\n<p>Para isso recomendo o <a href=\"https:\/\/trello.com\" target=\"_blank\" rel=\"noopener\">Trello<\/a>, por ser uma ferramenta de f\u00e1cil uso, gratuita e que pode ser utilizada independente de como est\u00e1 organizado o seu time.<\/p>\n<p>Para times que trabalham em desenvolvimento de produtos digitais e softwares em geral, recomendo o <a href=\"https:\/\/www.atlassian.com\/software\/jira\" target=\"_blank\" rel=\"noopener\">Jira<\/a>, por prover <em>reports<\/em> e gr\u00e1ficos do andamento do trabalho e pela maior quantidade de integra\u00e7\u00e3o com outros softwares de desenvolvimento, como por exemplo o <a href=\"https:\/\/www.draw.io\" target=\"_blank\" rel=\"noopener\">Draw.io<\/a>, mencionado anteriormente.<\/p>\n<h2>CONCLUS\u00c3O<\/h2>\n<p>Embora seja cada vez mais comum o trabalho remoto, precisamos nos atentar em como podemos mitigar os problemas relacionados que possam surgir. Com a utiliza\u00e7\u00e3o correta das ferramentas que temos hoje em dia, \u00e9 poss\u00edvel obtermos um maior engajamento e maior produtividade do time.<\/p>\n<p>Utilizando as ferramentas e dicas mencionadas acima, voc\u00ea poder\u00e1 ter mais tranquilidade em trabalhar em uma equipe apartada, sabendo que estar\u00e1 minimizando os riscos de comunica\u00e7\u00e3o comuns dessa forma de trabalho.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Segundo a Harvard Business Review, uma das maiores dificuldades de times hoje e no futuro ser\u00e1 o fator da dist\u00e2ncia. Cada dia que passa, \u00e9 mais comum trabalharmos com times remotos, o que gera um grande obst\u00e1culo na comunica\u00e7\u00e3o, algo que por si s\u00f3 j\u00e1 \u00e9 um tema complexo. Para trabalharmos bem com times distribu\u00eddos, &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/11\/trabalhando-com-times-distribuidos\/\">\u00bb<\/a><\/p>\n","protected":false},"author":69,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7865"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/69"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7865"}],"version-history":[{"count":13,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7865\/revisions"}],"predecessor-version":[{"id":7930,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7865\/revisions\/7930"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7865"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7865"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7865"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}