{"id":9134,"date":"2019-06-25T11:26:14","date_gmt":"2019-06-25T14:26:14","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9134"},"modified":"2019-06-26T11:46:06","modified_gmt":"2019-06-26T14:46:06","slug":"utilizando-o-team-canvas-para-a-formacao-de-times","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/06\/utilizando-o-team-canvas-para-a-formacao-de-times\/","title":{"rendered":"Utilizando o Team Canvas para a forma\u00e7\u00e3o de times"},"content":{"rendered":"<p>Em janeiro de 2019 eu me deparei com um time novo e precis\u00e1vamos come\u00e7ar a trabalhar juntos o quanto antes, pois era esperado que defin\u00edssemos os <strong>OKRs<\/strong> (<em>Objectives and Key Results<\/em>) no prazo de 1 semana. Para mais informa\u00e7\u00f5es sobre <em>OKRs<\/em>, indico esse artigo do Raphael Albino: <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\" target=\"_blank\" rel=\"noopener noreferrer\">Dilemas de PO: como definir OKRs em equipes \u00e1geis<\/a>.<\/p>\n<p>Fazendo um breve paralelo com o modelo de desenvolvimento de grupos de <em>Tuckman<\/em>, n\u00f3s est\u00e1vamos na fase de forma\u00e7\u00e3o (<strong>forming<\/strong>). Para quem nunca ouviu falar, sugiro a leitura do artigo <a href=\"https:\/\/hr.mit.edu\/learning-topics\/teams\/articles\/stages-development\" target=\"_blank\" rel=\"noopener noreferrer\">Using the Stages of Team Development<\/a>, mas resumidamente essa teoria mostra alguns est\u00e1gios pelos quais as equipes passam enquanto trabalham juntas. Na etapa de forma\u00e7\u00e3o, \u00e9 normal que as pessoas que far\u00e3o parte do time estejam empolgadas e tenham muitas perguntas, al\u00e9m de haver uma certa ansiedade para saber se ir\u00e3o se encaixar como esperado.<\/p>\n<p>Antes de qualquer coisa, as pessoas desse time rec\u00e9m-formado que mencionei precisavam se conhecer, saber os nomes umas das outras, qual a fun\u00e7\u00e3o de cada uma na equipe e conversar um pouco sobre seus valores e como acreditavam que o time precisaria agir para alcan\u00e7ar seus objetivos. Para isso, era importante que as pessoas primeiramente soubessem por que a equipe foi criada e o que era esperado delas como objetivo, para que pudessem criar juntas o <strong>prop\u00f3sito<\/strong>&nbsp;do time.<\/p>\n<p>Como definir tantas coisas rapidamente para que o time pudesse trabalhar de forma alinhada o quanto antes? Eu havia visto uma ferramenta chamada <a href=\"http:\/\/theteamcanvas.com\/use\" target=\"_blank\" rel=\"noopener noreferrer\">Team Canvas<\/a> em um dos grupos que participo nas redes sociais e fui pesquisar mais a respeito. Optei pela vers\u00e3o b\u00e1sica para que a din\u00e2mica ficasse mais r\u00e1pida. Segundo o site de refer\u00eancia, o <strong>Team Canvas<\/strong>&nbsp;\u00e9 indicado para:<\/p>\n<ul>\n<li>criar um time;<\/li>\n<li>iniciar um projeto;<\/li>\n<li>dar as boas-vindas a um novo membro do time;<\/li>\n<li>encontro de alinhamento b\u00e1sico do time.<\/li>\n<\/ul>\n<p>O investimento de tempo nessa din\u00e2mica \u00e9 v\u00e1lido porque permite que as pessoas construam algo juntas pela primeira vez, despertando o sentimento de time, podendo compartilhar seus valores e objetivos, se conhecer, criar o prop\u00f3sito do time e minimizar poss\u00edveis atritos e desencontros por falta de alguns alinhamentos b\u00e1sicos. Nos pr\u00f3ximos par\u00e1grafos irei explicar melhor como realizamos a din\u00e2mica do <em>Team Canvas<\/em>.<\/p>\n<p>O n\u00famero de participantes recomendado pela ferramenta \u00e9 de 2 a 8 pessoas, mas conseguimos aplicar mesmo estando em 11, apesar da leitura dos cards demorar um pouco mais. As cores dos cards n\u00e3o tinham significados espec\u00edficos na nossa din\u00e2mica. Essa imagem ilustra o nosso resultado final:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9135 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/68747470733a2f2f692e696d6775722e636f6d2f71435130544b4c2e6a7067.jpg\" alt=\"\" width=\"2080\" height=\"1560\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/68747470733a2f2f692e696d6775722e636f6d2f71435130544b4c2e6a7067.jpg 2080w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/68747470733a2f2f692e696d6775722e636f6d2f71435130544b4c2e6a7067-300x225.jpg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/68747470733a2f2f692e696d6775722e636f6d2f71435130544b4c2e6a7067-768x576.jpg 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/06\/68747470733a2f2f692e696d6775722e636f6d2f71435130544b4c2e6a7067-1024x768.jpg 1024w\" sizes=\"(max-width: 2080px) 100vw, 2080px\" \/><\/p>\n<p>Eu propus intercalarmos as raias do <em>Team Canvas<\/em> com outras a\u00e7\u00f5es, ent\u00e3o n\u00e3o seguimos exatamente a sequ\u00eancia que est\u00e1 no site de refer\u00eancia. Primeiramente, fizemos a raia de <strong>Roles &amp; Skills <\/strong>para sabermos os nomes e o papel de cada pessoa dentro do time. Na sequ\u00eancia, como algumas pessoas n\u00e3o haviam trabalhado juntas antes e outras nem se conheciam, fizemos uma din\u00e2mica para quebrar o gelo chamada <a href=\"https:\/\/retroagil.wordpress.com\/2017\/04\/20\/5-e-hi5-hf\" target=\"_blank\" rel=\"noopener noreferrer\">5 e Hi5<\/a>. Nela, grupos de 3 pessoas tentam encontrar 5 coisas em comum entre elas e d\u00e3o um <em>Hi5<\/em>&nbsp;(batem as m\u00e3os) no final. Utilizamos a lousa para as anota\u00e7\u00f5es, ao inv\u00e9s de papel.<\/p>\n<p>Em seguida, o PO fez uma apresenta\u00e7\u00e3o do que seria o nosso escopo de atua\u00e7\u00e3o e por que o time foi formado. Ele apresentou tamb\u00e9m sua sugest\u00e3o para o nosso prop\u00f3sito. Na sequ\u00eancia, partimos para a raia de <strong>Goals<\/strong> do <em>Team Canvas<\/em> e colocamos nossos objetivos como time e tamb\u00e9m objetivos individuais. Foi um <em>brainstorming<\/em>&nbsp;mesmo, cada pessoa podia colocar o que quisesse e assim poder\u00edamos conhecer aquilo que cada uma entendia como objetivo.<\/p>\n<p>Ent\u00e3o, partimos para a raia <strong>Values<\/strong> e pudemos conhecer os valores que cada pessoa acreditava ser importante para o time. Verificamos, ent\u00e3o, que alguns valores se repetiram algumas vezes, como: respeito, empatia, confian\u00e7a e comprometimento. Era sinal de que j\u00e1 t\u00ednhamos algo em comum, criando um engajamento entre o time.<\/p>\n<p>Depois, cada pessoa escreveu o que deveria fazer parte do prop\u00f3sito do time. Para n\u00e3o prolongar, deixamos para confrontar depois o que surgiu no <em>Team Canvas<\/em>&nbsp;com a sugest\u00e3o de prop\u00f3sito inicial do PO.<\/p>\n<p>Fizemos uma pausa para o almo\u00e7o e no retorno, fizemos o \u00faltimo quadrante: <strong>Rules &amp; Activities<\/strong>. Diferente dos outros quadrantes, onde todas as pessoas escreveram em <em>post-its<\/em>, nesse eu trouxe alguns temas pr\u00e9-definidos e fui perguntando para o time o que achavam que poder\u00edamos deixar combinado sobre aquele tema, para s\u00f3 ent\u00e3o eu escrever no <em>post-it<\/em> e colar no quadro o que ficou combinado. Exemplos de temas: hor\u00e1rio e quem deve participar da <em>daily<\/em>, <em>boards<\/em> f\u00edsicos ou digitais, <em>boards<\/em> juntos ou separados para as diferentes atua\u00e7\u00f5es do time (<em>front-end<\/em>, <em>back-end<\/em>, <em>UX<\/em> e <em>CX<\/em>), <em>home office<\/em>, hor\u00e1rio de trabalho, etc. No final, abri para adicionarem outros temas, mas ningu\u00e9m tinha nada a acrescentar. Foram alguns combinados b\u00e1sicos para seguirmos trabalhando a partir do pr\u00f3ximo dia. Eu fiz essa interfer\u00eancia de trazer temas pr\u00e9-definidos para n\u00e3o estender muito a reuni\u00e3o, j\u00e1 que o PO ainda precisava de boa parte do tempo para defini\u00e7\u00f5es importantes com o time.<\/p>\n<p>Partimos ent\u00e3o para a segunda parte da apresenta\u00e7\u00e3o do PO, onde ele trouxe sua sugest\u00e3o de <em>OKRs<\/em>, j\u00e1 alinhados aos objetivos estrat\u00e9gicos da empresa e o time p\u00f4de discutir a respeito.<\/p>\n<p>No final, fechamos o nosso prop\u00f3sito de forma que o texto inicial sugerido pelo PO acabou ficando mais enxuto e ainda assim abrangendo os pontos que o time mencionou.<\/p>\n<p>Ao t\u00e9rmino de 4 horas e meia reunidos, ficamos com a sensa\u00e7\u00e3o de dever cumprido e o direcionamento do que dever\u00edamos atacar nos pr\u00f3ximos dias estava mais claro e alinhado.<\/p>\n<p>O <em>Team Canvas<\/em> foi desmontado ap\u00f3s a virada do m\u00eas porque o objetivo n\u00e3o era gerar conte\u00fado e sim promover discuss\u00e3o e entendimento dentro do time. \u00c9 claro que ainda havia um trabalho de forma\u00e7\u00e3o de time a ser continuado nos pr\u00f3ximos dias, mas de qualquer forma, acredito que alcan\u00e7amos um bom alinhamento inicial com essa din\u00e2mica. Numa pr\u00f3xima vez que eu for aplicar essa abordagem com um time, eu gostaria de deixar a raia <em>Rules &amp; Activities<\/em>&nbsp;aberta para o pr\u00f3prio time escrever e no final eu poderia trazer pontos importantes n\u00e3o mencionados para combinarmos a respeito tamb\u00e9m.<\/p>\n<p>E voc\u00ea? Que t\u00e9cnicas tem usado na forma\u00e7\u00e3o de times \u00e1geis? Compartilhe com a gente pelo e-mail contagil@plataformatec.com.br!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Em janeiro de 2019 eu me deparei com um time novo e precis\u00e1vamos come\u00e7ar a trabalhar juntos o quanto antes, pois era esperado que defin\u00edssemos os OKRs (Objectives and Key Results) no prazo de 1 semana. Para mais informa\u00e7\u00f5es sobre OKRs, indico esse artigo do Raphael Albino: Dilemas de PO: como definir OKRs em equipes &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/06\/utilizando-o-team-canvas-para-a-formacao-de-times\/\">\u00bb<\/a><\/p>\n","protected":false},"author":81,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9134"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/81"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9134"}],"version-history":[{"count":8,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9134\/revisions"}],"predecessor-version":[{"id":9144,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9134\/revisions\/9144"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9134"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9134"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9134"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}