{"id":8556,"date":"2019-01-28T15:32:43","date_gmt":"2019-01-28T17:32:43","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=8556"},"modified":"2019-02-11T15:30:08","modified_gmt":"2019-02-11T17:30:08","slug":"tipos-de-demanda-e-classes-de-servico-afinal-e-tudo-a-mesma-coisa","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2019\/01\/tipos-de-demanda-e-classes-de-servico-afinal-e-tudo-a-mesma-coisa\/","title":{"rendered":"Tipos de Demanda e Classes de Servi\u00e7o: Afinal, \u00e9 tudo a mesma coisa?"},"content":{"rendered":"\n<p>Certo dia, durante uma conversa sobre STATIK (Systems Thinking Approach to Implement Kanban) com outros colegas da Plataformatec, foi levantada uma d\u00favida interessante durante esse debate e que pode fazer parte do dia a dia de quem tem adotado as pr\u00e1ticas do m\u00e9todo Kanban: Qual \u00e9 a diferen\u00e7a de tipos de demanda e as classes de servi\u00e7o? Elas querem dizer a mesma coisa mas com nomes diferentes ou s\u00e3o de fato coisas distintas? Vou tentar explicar para voc\u00eas neste blogpost.<\/p>\n\n\n\n<p>Mas antes de tudo, vamos falar brevemente do que se trata o STATIK para ficarmos todos na mesma p\u00e1gina.<\/p>\n\n\n\n<p>O STATIK trata-se de uma abordagem difundida por David Anderson (autor do m\u00e9todo Kanban) e posteriormente por Mike Burrows (autor do livro Kanban from Inside), para se compreender como um sistema de trabalho se comporta e como aplicar\/melhorar a ado\u00e7\u00e3o do Kanban dentro de um produto ou servi\u00e7o atrav\u00e9s da execu\u00e7\u00e3o de alguns passos explorat\u00f3rios. Segundo David, estes passos n\u00e3o necessariamente precisam ser executados de forma sequencial mas, eles geram insumos e conhecimentos para o processo de melhoria cont\u00ednua e a ado\u00e7\u00e3o propriamente dita do Kanban (podendo inclusive serem revisitados conforme a necessidade).<\/p>\n\n\n\n<p>Os passos s\u00e3o:<\/p>\n\n\n\n<ol><li>Entender o prop\u00f3sito do servi\u00e7o para o cliente;<\/li><li>Entender as fontes de insatisfa\u00e7\u00f5es com o atual sistema de trabalho (internas e externas);<\/li><li><strong>Analisar as demandas<\/strong>;<\/li><li>Analisar a capacidade do grupo;<\/li><li>Analisar e modelar os fluxos de trabalho;<\/li><li><strong>Criar as classes de servi\u00e7o<\/strong>;<\/li><li>Modelar o sistema Kanban;<\/li><li>Negociar e implementar mudan\u00e7as atrav\u00e9s do trabalho colaborativo e feedbacks.<\/li><\/ol>\n\n\n\n<p>Como podemos ver nesta listagem, encontramos tanto uma etapa relacionada \u00e0 demanda quanto \u00e0 classe de servi\u00e7o (destacados em negrito) e ali os assuntos come\u00e7am a se misturar. N\u00e3o entraremos em m\u00e9ritos de explora\u00e7\u00e3o a fundo desses dois passos, e sim aprender a diferenciar e entender como as demandas e classes de servi\u00e7o se relacionam. Quando falamos de demandas, automaticamente lembramos de User Stories, Bugs e afins. Mas, como enquadramos estas demandas de trabalho para que recebam o tratamento adequado em termos de prioriza\u00e7\u00e3o ou urg\u00eancia?<\/p>\n\n\n\n<p>Vamos por partes:<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>O que caracteriza os tipos de demandas?<\/strong><\/h3>\n\n\n\n<p>Todo item de trabalho, ou demanda, possui um conjunto de informa\u00e7\u00f5es que a definem e que podemos chamar de suas <strong>caracter\u00edsticas<\/strong>. Dentre essas caracter\u00edsticas podemos destacar a motiva\u00e7\u00e3o que existe por tr\u00e1s desta tarefa, a natureza do trabalho que ser\u00e1 desenvolvido (A cria\u00e7\u00e3o de algo novo, uma melhoria ou uma corre\u00e7\u00e3o por exemplo), o solicitante, a persona que ir\u00e1 interagir com o resultado daquele trabalho, dentre outras.<\/p>\n\n\n\n<p>Atrav\u00e9s desse conjunto de informa\u00e7\u00f5es, conseguimos agrupar estes itens de acordo com suas semelhan\u00e7as e damos origem aos tipos de demanda. Utilizando como exemplo demandas de desenvolvimento de software, alguns tipos de demanda que s\u00e3o classicamente utilizados por todos (ou quase todos) os times de desenvolvimento s\u00e3o:<\/p>\n\n\n\n<ul><li>Funcionalidades &#8211; Implementa\u00e7\u00e3o de um novo requisito de neg\u00f3cio ou funcionalidade em um determinado produto e\/ou servi\u00e7o para entregar valor ao usu\u00e1rio final;<\/li><li>Bugs\/Corre\u00e7\u00f5es &#8211; Corre\u00e7\u00e3o de algum problema identificado ap\u00f3s uma implementa\u00e7\u00e3o anterior e que possivelmente est\u00e1 impactando em algum tipo de uso em uma ou mais funcionalidades;<\/li><li>Melhoria Evolutiva &#8211; Melhoria em alguma funcionalidade ou comportamento j\u00e1 existente;<\/li><li>Tarefa &#8211; atividade n\u00e3o necessariamente relacionadas a uma funcionalidade em espec\u00edfico (ex: Criar documenta\u00e7\u00e3o do projeto).<\/li><\/ul>\n\n\n\n<p>A utiliza\u00e7\u00e3o ou n\u00e3o destes tipos ou at\u00e9 de algum outro em espec\u00edfico devem ser consideradas mediante ao contexto, necessidade do time ou do escopo de trabalho daquele momento. Existem outros tipos como os Spikes\/PoC(<em>Proof of concept<\/em>), que correspondem a esfor\u00e7os tempor\u00e1rios de pesquisa e valida\u00e7\u00e3o antes de uma implementa\u00e7\u00e3o efetiva, e que podem ou n\u00e3o fazer sentido dependendo do tipo de atividade que a equipe desempenha. Equipes de outras \u00e1reas de neg\u00f3cio como suporte ou vendas, muito provavelmente ter\u00e3o tipos de demandas diferentes a se trabalhar. Resumindo, os tipos de demanda dizem respeitos aos diferentes tipos de trabalhos que uma equipe precisa lidar, de acordo com suas caracter\u00edsticas comuns.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Classes de servi\u00e7o: O que s\u00e3o? Onde vivem? Do que se alimentam?<\/strong><\/h3>\n\n\n\n<p>Como dito anteriormente, os diferentes tipos de demandas (ou at\u00e9 mesmo diferentes demandas do mesmo tipo) podem exigir diferentes tipos de tratamento de acordo com suas caracter\u00edsticas. \u00c9 a\u00ed que entram as <strong>Classes de Servi\u00e7o<\/strong>. Cada classe de servi\u00e7o corresponde a uma forma diferente de tratar as demandas de trabalho de um time diferenciando-o em termos de prioriza\u00e7\u00e3o, senso de urg\u00eancia e fluxo de trabalho baseado nas suas pr\u00f3prias defini\u00e7\u00f5es. Baseado nas suas pr\u00f3prias defini\u00e7\u00f5es, nascem o que chamamos de <strong>pol\u00edticas expl\u00edcitas do processo<\/strong>.<\/p>\n\n\n\n<p>As pol\u00edticas s\u00e3o regras e acordos definidos pelo pr\u00f3prio time e orientam fluxos de trabalhos dentro do sistema. De acordo com o m\u00e9todo Kanban, \u00e9 importante que todas essas pol\u00edticas sejam registradas e acess\u00edveis ao time para que todos possam conhec\u00ea-las e aplic\u00e1-las no dia-a-dia de trabalho. Isto contribuir\u00e1 para uma melhor gest\u00e3o de riscos e aumentar\u00e1 a previsibilidade de entrega mediante o seu enquadramento e tamb\u00e9m trar\u00e1 alinhamento de expectativas com todas as pessoas envolvidas com a demanda.<\/p>\n\n\n\n<p>Existem 4 tipos de classes de servi\u00e7o que comumente s\u00e3o utilizadas com o m\u00e9todo Kanban. S\u00e3o elas:<\/p>\n\n\n\n<ul><li><strong>Expedite<\/strong> &#8211; Itens de grande urg\u00eancia e que necessitam serem trabalhados e entregues o quanto antes pois podem trazer grandes impactos em pouco tempo. Ex: Um bug que parou completamente o funcionamento de um e-commerce de larga escala ou uma oportunidade de venda ou cria\u00e7\u00e3o de um produto que est\u00e1 em alta\/tend\u00eancia no mercado e nas redes sociais;<\/li><li><strong>Fixed Date (Ou Date-Driven)<\/strong> &#8211; Quando a demanda precisa ser entregue at\u00e9 um prazo fixo, geralmente relacionado a uma situa\u00e7\u00e3o eventual ou sazonal, e que faz sentido apenas ser entregue antes do acontecimento (ex: Um hotsite de promo\u00e7\u00f5es para o dia das m\u00e3es) ou a algum tipo de implementa\u00e7\u00e3o regulat\u00f3ria ou legislativa e que pode gerar uma penalidade se n\u00e3o entregue at\u00e9 aquela data.<\/li><li><strong>Standard<\/strong> &#8211; Itens de trabalho comuns orientados segundo uma prioriza\u00e7\u00e3o expl\u00edcita por algum tipo de crit\u00e9rio (urg\u00eancia, valor de entrega, ordem de pedido, etc) que o time ir\u00e1 trabalhar quando n\u00e3o houver nada com maior urg\u00eancia (como um item <em>expedite<\/em>). Ex: Uma nova funcionalidade de consulta em um sistema ERP.<\/li><li><strong>Intangibles<\/strong> &#8211; Demandas de trabalho que s\u00e3o dif\u00edceis de mensurar seus ganhos ou impactos a primeiro momento mas que a m\u00e9dio ou longo prazo podem tanto causar preju\u00edzos, caso n\u00e3o sejam cumpridos, quanto trazer bons resultados. Ex: Atualizar documenta\u00e7\u00e3o do projeto.<\/li><\/ul>\n\n\n\n<p>Agora algumas ressalvas:<\/p>\n\n\n\n<p>O que quer dizer diferentes fluxos de trabalho? Itens com classes diferentes podem requerer outro tipo de processo em rela\u00e7\u00e3o a como a demanda vai caminhar at\u00e9 a sua entrega. Para exemplificar melhor a defini\u00e7\u00e3o apresentada anteriormente vamos imaginar que o processo padr\u00e3o de um time seja composto da seguinte forma:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1013\" height=\"74\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/Process.png\" alt=\"\" class=\"wp-image-8566\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/Process.png 1013w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/Process-300x22.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/Process-768x56.png 768w\" sizes=\"(max-width: 1013px) 100vw, 1013px\" \/><\/figure>\n\n\n\n<p>Uma nova demanda Expedite chega, e se trata de um bug na aplica\u00e7\u00e3o que parou toda a cadeia de produ\u00e7\u00e3o. Esta tarefa precisa realmente passar por todos estes passos para ser entregue? Aparentemente n\u00e3o. Devido ao seu car\u00e1ter de urg\u00eancia e prioridade, ela provavelmente j\u00e1 nascer\u00e1 como &#8220;Pronto p\/ fazer&#8221; ou um membro do time ir\u00e1 parar sua tarefa atual para assumi-la e far\u00e1 toda a an\u00e1lise pr\u00e9-desenvolvimento j\u00e1 na fase de &#8220;Em andamento&#8221;. E tamb\u00e9m ao final, possivelmente n\u00e3o precisar\u00e1 de uma aprova\u00e7\u00e3o formal para ser submetida em produ\u00e7\u00e3o.<\/p>\n\n\n\n<p>Ent\u00e3o todo bug \u00e9 Expedite? N\u00e3o necessariamente. Cabe ao PO ou time analisarem os verdadeiros impactos desta necessidade e mapear a sua criticidade e urg\u00eancia de entrega frente ao problema que ele pode causar, ponderando tamb\u00e9m as tarefas que o time j\u00e1 est\u00e1 desenvolvendo.<\/p>\n\n\n\n<p>Preciso seguir a risca e utilizar todas as classes de servi\u00e7o? N\u00e3o, isso pode variar conforme o contexto e a necessidade do time ou do neg\u00f3cio. Um time pode trabalhar apenas com Standard e Expedite por exemplo.<\/p>\n\n\n\n<p>Existem outras classes al\u00e9m destas? Com certeza! Time de diferentes contextos podem trabalhar com classes diferentes e ter expl\u00edcito suas pr\u00f3prias pol\u00edticas. Exemplo: Um time de suporte pode trabalhar com tarefas de classes como &#8220;Tickets&#8221;, &#8220;Atendimento VIP&#8221; e &#8220;Manuten\u00e7\u00e3o&#8221;.<\/p>\n\n\n\n<p>Inclusive, podem ocorrer situa\u00e7\u00f5es em que implicitamente algumas demandas s\u00e3o tratadas de forma diferenciada, por\u00e9m n\u00e3o h\u00e1 uma pol\u00edtica expl\u00edcita para elas. S\u00e3o as chamadas Classes de servi\u00e7os ocultas.<\/p>\n\n\n\n<p>Um exemplo comum s\u00e3o demandas solicitadas por um CEO e que acabam n\u00e3o sendo encaixadas nas classes utilizadas pelo time, mas ainda sim furam fila na lista de prioridades. Neste caso, elas n\u00e3o atendem todos os requisitos necess\u00e1rios para serem enquadradas como expedites por exemplo.<\/p>\n\n\n\n<p>Se existe uma certa recorr\u00eancias deste tipo de situa\u00e7\u00e3o, \u00e9 importante destac\u00e1-las atrav\u00e9s de uma classe de servi\u00e7o para que o time possa de forma expl\u00edcita e transparente saber como trat\u00e1-las e tamb\u00e9m mensurar quais impactos elas podem estar causando e, assim, poder negociar ou discutir este tipo de situa\u00e7\u00e3o.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>A Rela\u00e7\u00e3o das Classes de Servi\u00e7o com o <\/strong><strong><em>Cost of Delay<\/em><\/strong><\/h3>\n\n\n\n<p>O Cost of Delay, ou CoD, traz uma abordagem de car\u00e1ter econ\u00f4mico de como uma demanda pode impactar financeiramente caso ela n\u00e3o seja entregue ou sofra um atraso no seu prazo ou deadline (ex: seja uma multa\/penalidade ou a oportunidade de adquirir receita ou outro tipo de valor), servindo assim como ferramenta de prioriza\u00e7\u00e3o de trabalho e aux\u00edlio na tomada de decis\u00e3o. Dentro do CoD temos algumas formas de exemplificar os diferentes tipos de impacto de acordo com a curva de rela\u00e7\u00e3o de tempo x custo. Fazendo um paralelo com as classes de servi\u00e7o exploradas anteriormente n\u00f3s temos:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Expedite<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"373\" height=\"283\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/urgent-curve.png\" alt=\"\" class=\"wp-image-8567\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/urgent-curve.png 373w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/urgent-curve-300x228.png 300w\" sizes=\"(max-width: 373px) 100vw, 373px\" \/><\/figure>\n\n\n\n<p>Demandas priorizadas na classe de servi\u00e7o expedite tem seu custo crescente de forma vertiginosa em pouco tempo, necessitando urg\u00eancia no seu tratamento para minimizar o impacto gerado.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Fixed Date<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"343\" height=\"284\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/fixed-date-curve.png\" alt=\"\" class=\"wp-image-8568\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/fixed-date-curve.png 343w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/fixed-date-curve-300x248.png 300w\" sizes=\"(max-width: 343px) 100vw, 343px\" \/><\/figure>\n\n\n\n<p>Nesta classe, inicialmente temos um baixo custo devido ao prazo at\u00e9 a data espec\u00edfica, por\u00e9m conforme esta data limite se aproxima, ela se eleva proporcionalmente ao risco e, quando atingido o deadline, que por sua vez \u00e9 inegoci\u00e1vel, temos uma mudan\u00e7a brusca na curva de custo de impacto at\u00e9 que ela volte a se estabilizar.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Standard<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"335\" height=\"277\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/standard-curve.png\" alt=\"\" class=\"wp-image-8569\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/standard-curve.png 335w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/standard-curve-300x248.png 300w\" sizes=\"(max-width: 335px) 100vw, 335px\" \/><\/figure>\n\n\n\n<p>J\u00e1 para as demandas de classe de servi\u00e7o standard, o custo cresce de forma linear \u00e0 medida que existe o atraso\/demora na entrega e geralmente n\u00e3o ocorre uma varia\u00e7\u00e3o no seu c\u00e1lculo<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Intangible<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"339\" height=\"269\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/intangible-curve.png\" alt=\"\" class=\"wp-image-8570\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/intangible-curve.png 339w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/01\/intangible-curve-300x238.png 300w\" sizes=\"(max-width: 339px) 100vw, 339px\" \/><\/figure>\n\n\n\n<p>Devido a dificuldade de mensurar seus impactos, perdas ou ganhos, a curva relacionada a classe de servi\u00e7o intang\u00edvel cresce de forma muito lenta mesmo a longo prazo, indicando um baixo risco e grau de impacto, pois possivelmente corresponde a a\u00e7\u00f5es de baixa prioridade.<\/p>\n\n\n\n<p>Comparando demandas de diferentes tipos de classes de servi\u00e7o, temos uma ideia mais clara de quais classes devem ser trabalhadas de forma priorit\u00e1ria devido o seu impacto. Com demandas de um mesmo tipo (Standard por exemplo), esta abordagem tamb\u00e9m te possibilita quantificar estes valores e compar\u00e1-las entre si a fim de se chegar a uma tomada de decis\u00e3o sobre quais itens s\u00e3o mais interessantes de se priorizar de acordo com algum ponto de an\u00e1lise (Ex: receita esperada; redu\u00e7\u00e3o de custos). <a href=\"http:\/\/blog.plataformatec.com.br\/2016\/11\/calculating-cost-of-delay-for-software-projects\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Neste blogpost (opens in a new tab)\">Neste blogpost<\/a> escrito por Lucas Colucci, temos alguns exemplos de como calcular e comparar estes custos de atraso.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclus\u00e3o<\/strong><\/h2>\n\n\n\n<p>Vimos ent\u00e3o que tipos de demanda e classes de servi\u00e7o s\u00e3o diferentes categoriza\u00e7\u00f5es mas que se correlacionam, e juntas, podem criar um entendimento mais claro de todo um contexto que precisa ser desenvolvido pelo time em um determinado item de trabalho e quais s\u00e3o as pol\u00edticas que precisam ser seguidas e respeitadas.<\/p>\n\n\n\n<p>Atribuir corretamente as demandas de trabalho aos diferentes tipos de classes de servi\u00e7o, auxiliar\u00e1 o time no processo de prioriza\u00e7\u00e3o e tomada de decis\u00e3o quanto ao trabalho a ser feito. Al\u00e9m disso, suportado pelo lado econ\u00f4mico do custo de atraso, o time poder\u00e1 mensurar o impacto da n\u00e3o entrega de uma demanda. Dessa forma, conseguimos alinhar as expectativas tanto do lado do cliente\/solicitante da demanda, fornecendo previsibilidade e alinhando as necessidades desses clientes com as prioridades da empresa, quanto no lado do time, ajudando a controlar de forma saud\u00e1vel o <em>capacity<\/em> do time de acordo com as classes de servi\u00e7o e a propor\u00e7\u00e3o de demandas existentes. Trataremos esta an\u00e1lise de m\u00e9tricas para classes de servi\u00e7o e tipos de demanda em um pr\u00f3ximo blogpost.<\/p>\n\n\n\n<p>E voc\u00ea? J\u00e1 havia utilizado estes conceitos antes? Se sim, houve ganho de valor ap\u00f3s sua aplica\u00e7\u00e3o? Deixe seu coment\u00e1rio abaixo sobre sua experi\u00eancia com classes de servi\u00e7os para aux\u00edlio na prioriza\u00e7\u00e3o.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Certo dia, durante uma conversa sobre STATIK (Systems Thinking Approach to Implement Kanban) com outros colegas da Plataformatec, foi levantada uma d\u00favida interessante durante esse debate e que pode fazer parte do dia a dia de quem tem adotado as pr\u00e1ticas do m\u00e9todo Kanban: Qual \u00e9 a diferen\u00e7a de tipos de demanda e as classes &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2019\/01\/tipos-de-demanda-e-classes-de-servico-afinal-e-tudo-a-mesma-coisa\/\">\u00bb<\/a><\/p>\n","protected":false},"author":76,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8556"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/76"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=8556"}],"version-history":[{"count":8,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8556\/revisions"}],"predecessor-version":[{"id":8578,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8556\/revisions\/8578"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=8556"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=8556"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=8556"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}