{"id":5228,"date":"2016-03-23T13:17:33","date_gmt":"2016-03-23T16:17:33","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=5228"},"modified":"2016-03-24T16:08:12","modified_gmt":"2016-03-24T19:08:12","slug":"6-dicas-para-mandar-bem-no-codigo-do-processo-seletivo-da-plataformatec","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2016\/03\/6-dicas-para-mandar-bem-no-codigo-do-processo-seletivo-da-plataformatec\/","title":{"rendered":"6 dicas para mandar bem no c\u00f3digo do processo seletivo da Plataformatec"},"content":{"rendered":"<p><img decoding=\"async\" style=\"border: 0; max-width:100% !important;\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/03\/show-me-the-code-plataformatec.png\" alt=\"Etapa: Show me the code\" \/><\/p>\n<p>Aten\u00e7\u00e3o desenvolvedoras e desenvolvedores, tenho uma \u00f3tima not\u00edcia. Estamos com <strong><a href=\"https:\/\/goo.gl\/xvFz6i\" target=\"_blank\">vagas abertas na Plataformatec<\/a><\/strong>!<\/p>\n<p>N\u00e3o estamos procurando \u201cninjas\u201d ou \u201crockstars\u201d. Procuramos pessoas respons\u00e1veis, que busquem sempre melhorar suas habilidades em desenvolvimento e gostem de trabalhar com autonomia.<\/p>\n<p>Para fazer parte do nosso time, voc\u00ea precisar\u00e1 ser aprovado em nosso processo seletivo. Hoje ele \u00e9 composto por 5 etapas:<\/p>\n<li>Bate papo inicial<\/li>\n<li>Entrevista t\u00e9cnica<\/li>\n<li>Show me the code<\/li>\n<li>Pair Programming<\/li>\n<li>Proposta Financeira<\/li>\n<p>No <strong>Bate papo inicial<\/strong>, o objetivo \u00e9 conhecermos melhor os candidatos e apresentarmos quem n\u00f3s somos; a <strong>Entrevista t\u00e9cnica<\/strong> tem por meta avaliar o conhecimento sobre desenvolvimento web (em especial, utilizando Ruby e Rails);  j\u00e1 na etapa de <strong>Show me the code<\/strong> queremos ver seu c\u00f3digo; no <strong>Pair programming<\/strong> avaliamos como os candidatos pensam e se portam ao escreverem seu c\u00f3digo. E finalmente, com todas essas informa\u00e7\u00f5es em m\u00e3os, conseguimos fazer a <strong>Proposta financeira<\/strong>.<\/p>\n<p>O objetivo desse post \u00e9 dar dicas sobre como ir bem na terceira etapa. Como j\u00e1 mencionado, a etapa <strong>Show me the code<\/strong> \u00e9 o momento que as candidatas ou os candidatos t\u00eam para demonstrarem na pr\u00e1tica o conhecimento avaliado durante a <strong>Entrevista t\u00e9cnica<\/strong>. A pessoa precisar\u00e1 desenvolver um aplicativo web de escopo reduzido que deve ser feito no prazo de uma semana.<\/p>\n<p>Depois de entregue, o aplicativo ser\u00e1 revisado por nosso time que buscar\u00e1 as boas pr\u00e1ticas de desenvolvimento.<\/p>\n<p>Vou citar algumas dicas que podem te ajudar a escrever um c\u00f3digo com mais confian\u00e7a e atingir um bom resultado:<\/p>\n<ul>\n<li>Familiarize-se com a ferramenta<\/li>\n<li>Comunique-se<\/li>\n<li>Reflita sobre a seguran\u00e7a<\/li>\n<li>Busque a simplicidade<\/li>\n<li>Valorize seu frontend<\/li>\n<li>D\u00ea aten\u00e7\u00e3o a usabilidade<\/li>\n<\/ul>\n<h2>Familiarize-se com a ferramenta<\/h2>\n<p>Somos uma consultoria de Ruby e Ruby On Rails e esperamos que o candidato tenha familiaridade com a tecnologia. Mesmo que voc\u00ea venha de outra linguagem, esperamos que voc\u00ea saiba desenvolver usando as funcionalidades mais comuns do framework. Recomendo ler <a href=\"http:\/\/guides.rubyonrails.org\/\" target=\"_blank\">Ruby On Rails Guides<\/a> e fazer o tutorial do livro online <a href=\"https:\/\/www.railstutorial.org\/book\" target=\"_blank\">Ruby On Rails Tutorial<\/a>.<\/p>\n<h2>Comunique-se<\/h2>\n<p>Comunica\u00e7\u00e3o \u00e9 muito importante para o nosso time. Durante o desenvolvimento, pense nas pessoas que v\u00e3o revisar seu aplicativo e test\u00e1-lo. Pense nelas como se elas estivessem trabalhando junto com voc\u00ea. Valorize suas mensagens de <em>commit<\/em>, diga o qu\u00ea e o porqu\u00ea das mudan\u00e7as. Uma boa ferramenta de consulta \u00e9 o <strong>GitHub<\/strong>, inspire-se em projetos open source que voc\u00ea gosta.<\/p>\n<h2>Reflita sobre a seguran\u00e7a<\/h2>\n<p>Um app seguro \u00e9 essencial para os usu\u00e1rios e conta como pontos positivos. D\u00ea uma lida no <a href=\"http:\/\/guides.rubyonrails.org\/security.html\" target=\"_blank\">guide sobre seguran\u00e7a do Ruby on Rails<\/a> e certifique-se se as actions do seu controller est\u00e3o com as permiss\u00f5es corretas.<\/p>\n<h2>Busque a simplicidade<\/h2>\n<p>Sabemos que o tempo para produzir o c\u00f3digo para nossa revis\u00e3o \u00e9 curto, mas o escopo tamb\u00e9m n\u00e3o \u00e9 grande. Portanto, tente n\u00e3o se complicar adicionando muita complexidade. N\u00e3o deixe de mostrar seus pontos fortes, por\u00e9m o fa\u00e7a de maneira simples. Por exemplo, se voc\u00ea n\u00e3o domina muito Javascript, n\u00e3o precisa fazer uma single page app, com um framework grande de frontend, integrado com backend Rails conectado em diversos microservi\u00e7os. Fa\u00e7a o simples que vai dar tudo certo.<\/p>\n<h2>Valorize seu frontend<\/h2>\n<p>Nosso foco \u00e9 desenvolvimento web, portanto conhecimento de HTML, CSS e Javascript s\u00e3o muito importantes. Esperamos que o mesmo carinho que voc\u00ea tem no seu c\u00f3digo Ruby tenha tamb\u00e9m no seu c\u00f3digo de frontend.<\/p>\n<p>Se voc\u00ea manja de HTML e CSS, aproveite essa chance. Como muitas pessoas acabam escolhendo utilizar Bootstrap, essa \u00e9 a oportunidade de mostrar seu diferencial.<\/p>\n<h2>D\u00ea aten\u00e7\u00e3o a Usabilidade<\/h2>\n<p>Pense nos usu\u00e1rios que v\u00e3o usar o aplicativo que voc\u00ea fez. Como a pessoa ir\u00e1 navegar e fazer as tarefas? Est\u00e1 intuitivo? \u00c9 bom repassar os fluxos da aplica\u00e7\u00e3o manualmente para ter certeza de que as pessoas que usarem o aplicativo n\u00e3o ir\u00e3o encontrar erros ou ficar\u00e3o perdidas.<\/p>\n<p>Vale lembrar ainda que, pelo sim ou pelo n\u00e3o, sempre te daremos um feedback. Se por algum motivo voc\u00ea n\u00e3o for aprovada(o), te enviaremos uma lista com os pontos onde voc\u00ea poderia ter ido melhor e as respectivas recomenda\u00e7\u00f5es de estudo. Trabalhe esses pontos e, quando julgar que conseguiu evoluir, se <a href=\"https:\/\/goo.gl\/xvFz6i\" target=\"_blank\">candidate novamente no nosso processo seletivo<\/a>. Por curiosidade, algumas pessoas do nosso time participaram do processo seletivo mais de uma vez. Se voc\u00ea for aprovada(o), prometemos muitos desafios e aprendizado.<\/p>\n<p>Para saber mais como ser\u00e3o seus primeiros meses de trabalho, indico dois posts para voc\u00ea: <em><a href=\"http:\/\/blog.plataformatec.com.br\/2014\/05\/1-year-working-at-plataformatec\/\">One year working at plataformatec<\/a><\/em> (escrito tamb\u00e9m por <a href=\"https:\/\/twitter.com\/ulissesalmeida\" target=\"_blank\">mim<\/a>) e <em><a href=\"http:\/\/blog.plataformatec.com.br\/2015\/04\/what-i-have-learned-in-my-first-three-months-at-plataformatec\/\">What I have learned in my first three months at plataformatec<\/a><\/em> (escrito por <a href=\"https:\/\/twitter.com\/igorflorianfs\" target=\"_blank\">Igor Florian<\/a>).<\/p>\n<p>Espero que tenha gostado dessas dicas. Se voc\u00ea gostou e acha que elas se relacionam com a maneira que voc\u00ea gosta de trabalhar, inscreva-se no nosso <a href=\"https:\/\/goo.gl\/xvFz6i\" target=\"_blank\">processo seletivo<\/a>.<\/p>\n<p>Para outras dicas de como mandar bem no desenvolvimento de software, recomendo tamb\u00e9m dar uma olhada nas palestras <a href=\"https:\/\/speakerdeck.com\/flaviafortes\/learn-from-my-mistakes\" target=\"_blank\">Learn From My Mistakes<\/a> da <a href=\"https:\/\/twitter.com\/FlaFortes\" target=\"_blank\">Flavia Fortes<\/a> e <a href=\"https:\/\/speakerdeck.com\/lucas\/10-coisas-que-eu-gostaria-de-ter-aprendido-mais-cedo\" target=\"_blank\">10 Coisas Que Eu Gostaria de Ter aprendido Mais Cedo<\/a> do <a href=\"https:\/\/twitter.com\/lucasmazza\" target=\"_blank\">Lucas Mazza<\/a>.<\/p>\n<p>Espero ver seu c\u00f3digo em breve \ud83d\ude09<\/p>\n<p style=\"margin-bottom:5px; margin-top:50px;\"><a style=\"cursor: pointer;\" href=\"https:\/\/goo.gl\/xvFz6i\" target=\"_blank\"><img decoding=\"async\" style=\"border: 0;\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/03\/estamos-contratando-developers-plataformatec.png\" alt=\"Participar do processo seletivo\" target=\"_blank\" \/><\/a><\/p>\n<div style=\"text-align:center; margin-bottom:60px;font:13px arial, sans-serif; color:#999;\">Quer receber mais informa\u00e7\u00f5es sobre nossas vagas, <a href=\"http:\/\/eepurl.com\/bS0BJr\" style=\"color:#999; text-decoration:underline;\" target=\"_blank\">inscreva-se em nossa mailing list<\/a>.<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Aten\u00e7\u00e3o desenvolvedoras e desenvolvedores, tenho uma \u00f3tima not\u00edcia. Estamos com vagas abertas na Plataformatec! N\u00e3o estamos procurando \u201cninjas\u201d ou \u201crockstars\u201d. Procuramos pessoas respons\u00e1veis, que busquem sempre melhorar suas habilidades em desenvolvimento e gostem de trabalhar com autonomia. Para fazer parte do nosso time, voc\u00ea precisar\u00e1 ser aprovado em nosso processo seletivo. Hoje ele \u00e9 composto &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2016\/03\/6-dicas-para-mandar-bem-no-codigo-do-processo-seletivo-da-plataformatec\/\">\u00bb<\/a><\/p>\n","protected":false},"author":31,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[158,196,52],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/5228"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/31"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=5228"}],"version-history":[{"count":18,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/5228\/revisions"}],"predecessor-version":[{"id":5256,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/5228\/revisions\/5256"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=5228"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=5228"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=5228"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}