{"id":9328,"date":"2019-09-24T15:32:08","date_gmt":"2019-09-24T18:32:08","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9328"},"modified":"2019-09-25T13:09:29","modified_gmt":"2019-09-25T16:09:29","slug":"entendendo-a-motivacao-do-seu-time","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/09\/entendendo-a-motivacao-do-seu-time\/","title":{"rendered":"Entendendo a motiva\u00e7\u00e3o do seu time"},"content":{"rendered":"\n<p>Como l\u00edderes podem motivar suas equipes a utilizarem plenamente suas habilidades e atingirem todo o seu potencial ?<\/p>\n\n\n\n<p>Primeiro \u00e9 importante fazer um adendo: nosso papel como profissionais (e principalmente o nosso como consultores na Plataformatec) \u00e9 encarar a situa\u00e7\u00e3o das equipes como elas realmente s\u00e3o, n\u00e3o como gostar\u00edamos que fossem. As ideias desse texto se aplicam melhor em times em forma\u00e7\u00e3o. Se voc\u00ea j\u00e1 trabalha com uma equipe auto-organizada e motivada com suas atividades, o melhor uso desse conte\u00fado pode ser no n\u00edvel organizacional.<\/p>\n\n\n\n<p>Existem v\u00e1rias teorias que falam sobre a motiva\u00e7\u00e3o no ramo da psicologia. Se voc\u00ea gosta do assunto provavelmente j\u00e1 ouviu falar da pir\u00e2mide de&nbsp;<a rel=\"noreferrer noopener\" aria-label=\"Maslow (opens in a new tab)\" href=\"https:\/\/endeavor.org.br\/pessoas\/piramide-de-maslow\/\" target=\"_blank\">Maslow<\/a>&nbsp;ou fatores higi\u00eanicos de&nbsp;<a href=\"https:\/\/medium.com\/@felquis\/teoria-dos-dois-fatores-ou-teoria-da-motiva%C3%A7%C3%A3o-higiene-de-frederick-herzberg-329da768e014\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Herzberg<\/a>. Hoje eu vou falar sobre a f\u00f3rmula de Vroom e a teoria de necessidades adquiridas. Vamos partir do pressuposto que todos os fatores b\u00e1sicos para Maslow e higi\u00eanicos de Herzberg (remunera\u00e7\u00e3o, seguran\u00e7a, condi\u00e7\u00f5es de trabalho, etc) est\u00e3o sendo atendidos.<\/p>\n\n\n\n<p>Inicialmente vamos ver quais os fatores se relacionam com a motiva\u00e7\u00e3o. Abaixo est\u00e1 uma adapta\u00e7\u00e3o da f\u00f3rmula de Vroom que os ilustram e adiciona o fator tempo ao conceito original.<br><\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/i.imgur.com\/yBYmXy0.png\" alt=\"\"\/><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"valor\">Valor<\/h4>\n\n\n\n<p>Valor nos diz sobre a percep\u00e7\u00e3o de import\u00e2ncia que as pessoas d\u00e3o para algo. Isso \u00e9 individual para cada membro da equipe, alguns valorizam apenas retorno financeiro, outros preferem folgas ou serem direcionados para atividades que lhes tragam mais satisfa\u00e7\u00e3o. Para saber o que de fato uma pessoa valoriza precisamos entender seus valores, preocupa\u00e7\u00f5es e objetivos.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"capacidade\">Capacidade<\/h4>\n\n\n\n<p>Capacidade \u00e9 a cren\u00e7a que a pessoa consegue fazer o que \u00e9 necess\u00e1rio para ganhar uma recompensa. Se um membro da equipe (ou a equipe toda) n\u00e3o acredita que consegue fazer algo, dificilmente vai se comprometer verdadeiramente com o seu objetivo. Quando dou aula, gosto de exemplificar para os meus alunos com a seguinte proposta: \u201cPasso com nota 10 na mat\u00e9ria quem conseguir ir ao departamento do outro lado do campus e voltar com essa folha assinada em 5 minutos\u201d. At\u00e9 hoje nenhum aluno se levantou da cadeira para tentar. Para aumentar a sensa\u00e7\u00e3o de capacidade garanta treinamento e ferramentas adequadas para os trabalhos da equipe.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"esfor\u00e7o\">Esfor\u00e7o<\/h4>\n\n\n\n<p>Esfor\u00e7o \u00e9 literalmente o quanto de energia uma pessoa precisa investir para receber uma recompensa. A rela\u00e7\u00e3o \u00e9 direta ao valor percebido: quanto mais dif\u00edcil for fazer algo maior precisa ser a recompensa. \u00c9 o conceito b\u00e1sico de retorno sobre investimento na esfera individual.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"tempo\">Tempo<\/h4>\n\n\n\n<p>O tempo para receber a recompensa \u00e9 um fator interessante. Tendemos a preferir o hoje ao inv\u00e9s do amanh\u00e3. Quanto mais tardia for a recompensa, menos motivados vamos estar. Isso se reflete na pr\u00e1tica em ciclos de recompensa e <em>feedback<\/em> mais curtos. Por isso algumas empresas gostam de fazer <em>OKRs<\/em> trimestrais e ciclos de avalia\u00e7\u00f5es de performance curtos.<\/p>\n\n\n\n<p>Essa f\u00f3rmula pode ajudar a guiar estrat\u00e9gias de motiva\u00e7\u00e3o. \u00c9 importante notar que se valor e capacidade forem muito baixos ou o esfor\u00e7o e tempo forem muito altos, a motiva\u00e7\u00e3o tende a ser baixa.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"o-que-tem-valor-para-os-membros-da-nossa-equipe\">O que tem valor para os membros da nossa equipe?<\/h2>\n\n\n\n<p>Agora que entendemos os fatores que influenciam a motiva\u00e7\u00e3o, vamos falar um pouco sobre a vari\u00e1vel&nbsp;<strong>Valor<\/strong>: como entender o que os membros da nossa equipe valorizam?<\/p>\n\n\n\n<p>Uma das teorias existentes \u00e9 a das&nbsp;<strong>necessidades adquiridas<\/strong>, ela diz que buscamos 3 coisas: poder (ou controle), resultados e afilia\u00e7\u00e3o. Como citado no in\u00edcio, esse \u00e9 apenas um entre v\u00e1rios modelos para entender valora\u00e7\u00e3o.<\/p>\n\n\n\n<p><strong>Necessidade de Poder<\/strong>&nbsp;(ou controle) \u00e9 a busca por influ\u00eancia. Pessoas com necessidade de poder gostam de controlar as situa\u00e7\u00f5es, s\u00e3o ambiciosos e autoconfiantes. Para motivar pessoas assim, lhes d\u00ea autonomia sobre seu trabalho, envolva-as na gest\u00e3o estrat\u00e9gica e na tomada de decis\u00e3o. Pessoas desse grupo que apresentam tra\u00e7os de empatia e que conseguem dividir o poder de escolha com seus pares podem ser futuros l\u00edderes.<\/p>\n\n\n\n<p><strong>A necessidade de Realiza\u00e7\u00e3o<\/strong>&nbsp;\u00e9 a preocupa\u00e7\u00e3o por excel\u00eancia e conquistas atrav\u00e9s do esfor\u00e7o individual. S\u00e3o pessoas en\u00e9rgicas, determinadas, que trabalham duro, apreciam <em>feedback<\/em> realista e procuram maneiras para realizar um bom trabalho. Podemos manter essas pessoas motivadas com objetivos&nbsp;<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.mindtools.com\/pages\/article\/newHTE_90.htm\" target=\"_blank\">SMART<\/a>, tarefas bem definidas e um ciclo r\u00e1pido de <em>feedback<\/em>.<\/p>\n\n\n\n<p><strong>Necessidade de Afilia\u00e7\u00e3o<\/strong>&nbsp;\u00e9 o desejo de socializar e ser aceito pelos pares. Essas pessoas gostam de desenvolver, manter e restaurar rela\u00e7\u00f5es pessoais pr\u00f3ximas. S\u00e3o sociais, com intelig\u00eancia emocional e empatia. Esses membros da sua equipe v\u00e3o se sentir motivados naturalmente se puderem ajudar a desenvolver pessoas, participar de <em>onboarding<\/em> e treinamento de novos membros da equipe.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"colocando-na-pr\u00e1tica\">Colocando na pr\u00e1tica<\/h1>\n\n\n\n<p>Agora que voc\u00ea entende melhor alguns fatores de motiva\u00e7\u00e3o, converse com as pessoas da sua equipe e descubra o que eles buscam. Ajude-os a organizar as atividades para que cada pessoa tenha responsabilidades condizentes com a seu perfil.<\/p>\n\n\n\n<p>Tamb\u00e9m pode ser necess\u00e1rio ajudar a sua organiza\u00e7\u00e3o como um todo a definir pol\u00edticas e recompensas que as pessoas valorizam. Isso vai ajudar n\u00e3o apenas a motiva\u00e7\u00e3o, mas tamb\u00e9m e engajamento e reten\u00e7\u00e3o dos talentos dos times.<\/p>\n\n\n\n<p>Quer conversar mais sobre lideran\u00e7a servidora e <em>soft-skills<\/em>? Est\u00e1 com um problema no seu time que gostaria de ver abordado? Deixe seu coment\u00e1rio e sugest\u00f5es sobre quais t\u00f3picos gostaria de ver nos coment\u00e1rios ou pelo email&nbsp;<a href=\"mailto:contagil@plataformatec.com.br\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">contagil@plataformatec.com.br<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Como l\u00edderes podem motivar suas equipes a utilizarem plenamente suas habilidades e atingirem todo o seu potencial ?<\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9328"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9328"}],"version-history":[{"count":8,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9328\/revisions"}],"predecessor-version":[{"id":9340,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9328\/revisions\/9340"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9328"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9328"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9328"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}