{"id":7567,"date":"2018-05-30T13:30:20","date_gmt":"2018-05-30T16:30:20","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7567"},"modified":"2018-05-30T13:47:12","modified_gmt":"2018-05-30T16:47:12","slug":"dicas-para-enfrentar-os-desafios-de-uma-transformacao-agil","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/05\/dicas-para-enfrentar-os-desafios-de-uma-transformacao-agil\/","title":{"rendered":"Dicas para enfrentar os desafios de uma transforma\u00e7\u00e3o \u00e1gil"},"content":{"rendered":"<p>Desenvolver uma estrutura \u00e1gil est\u00e1 na agenda de muitas empresas. A promessa de que uma organiza\u00e7\u00e3o assim ser\u00e1 mais eficiente e responder\u00e1 melhor \u00e0s mudan\u00e7as no mercado \u00e9 algo que faz brilhar os olhos de qualquer pessoa que exer\u00e7a o papel executivo de uma companhia.<\/p>\n<p>O grande problema que venho observando no mercado \u00e9 um certo sentimento de frustra\u00e7\u00e3o na ado\u00e7\u00e3o do \u00e1gil no dia a dia, bem como uma s\u00e9rie de d\u00favidas de como realizar tal mudan\u00e7a em um ambiente com uma cultura hier\u00e1rquica forte e onde h\u00e1 uma rede pol\u00edtica complexa.<\/p>\n<p>Buscando entender as empresas e o papel da lideran\u00e7a dentro de um processo de mudan\u00e7a, compartilho neste blog post dois modelos que tenho adotado para compreender contextos que queiram adotar o \u00e1gil.<\/p>\n<h2><a id=\"user-content-uma-breve-opini\u00e3o-sobre-transforma\u00e7\u00e3o-\u00e1gil\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/367864d28c738875eadb62efd256281db6a7907c\/2018-05-cultura-agil.md#uma-breve-opini%C3%A3o-sobre-transforma%C3%A7%C3%A3o-%C3%A1gil\"><\/a>Uma breve opini\u00e3o sobre transforma\u00e7\u00e3o \u00e1gil<\/h2>\n<p>Uma transforma\u00e7\u00e3o \u00e1gil ocorre quando a empresa desenvolve uma vis\u00e3o sist\u00eamica e organizacional dos aspectos que envolvem tal mudan\u00e7a, de maneira que n\u00e3o haja um olhar meramente metodol\u00f3gico de um assunto que tocar\u00e1 todas as \u00e1reas da sua estrutura.<\/p>\n<p>Adotar um novo modelo de trabalho demanda uma modifica\u00e7\u00e3o na forma como as pessoas enxergam o contexto da organiza\u00e7\u00e3o, o que vai al\u00e9m de um mero treinamento ou de um conjunto de palavras bonitas jogadas em uma apresenta\u00e7\u00e3o cheia de estilo.<\/p>\n<p>A aceita\u00e7\u00e3o de qualquer modelo como o Scrum, o SAFe, o LeSS, o Nexus, o Spotify ou mesmo o m\u00e9todo Kanban com sua abordagem evolucion\u00e1ria, sofrer\u00e1 com o famigerado\u00a0<em>mindset organizacional<\/em>, o que para mim, nada mais \u00e9 do que a cole\u00e7\u00e3o de institui\u00e7\u00f5es que definem e limitam as escolhas dos indivi\u0301duos dentro de uma empresa.<\/p>\n<p>No meu ponto de vista, as empresas possuem dois tipos de institui\u00e7\u00f5es, as formais e as informais. As primeiras s\u00e3o regras, departamentos e cargos formalizados e escritos, em geral impostos pela dire\u00e7\u00e3o. J\u00e1 as informais, s\u00e3o normas ou c\u00f3digos de conduta, formadas em geral pelas rela\u00e7\u00f5es entre os indiv\u00edduos.<\/p>\n<p>Conhecer os dois tipos de institui\u00e7\u00f5es e saber o poder pol\u00edtico de cada uma delas far\u00e1 com que o processo de mudan\u00e7a aconte\u00e7a de forma objetiva e com uma boa gest\u00e3o das expectativas. Recentemente, escutei do\u00a0<a href=\"https:\/\/twitter.com\/mhaddad\" rel=\"nofollow\">Matheus Haddad<\/a>\u00a0que o jogo pol\u00edtico existe e \u00e9 importante voc\u00ea conhec\u00ea-lo para saber jog\u00e1-lo. A seguir, apresentarei duas teorias que poder\u00e3o ser \u00fateis para voc\u00ea entender esse jogo.<\/p>\n<h2><a id=\"user-content-estruturas-de-governan\u00e7a\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/367864d28c738875eadb62efd256281db6a7907c\/2018-05-cultura-agil.md#estruturas-de-governan%C3%A7a\"><\/a>Estruturas de governan\u00e7a<\/h2>\n<p>Quando o assunto agilidade vem \u00e0 tona, provavelmente a sua empresa deve estar em busca de um modelo de trabalho que combine pr\u00e1ticas como:<\/p>\n<ul>\n<li>Estruturas mais flex\u00edveis;<\/li>\n<li>Otimiza\u00e7\u00e3o na coordena\u00e7\u00e3o do trabalho;<\/li>\n<li>Equipes multifuncionais;<\/li>\n<li>Comunica\u00e7\u00e3o horizontal e vertical;<\/li>\n<li>Poder de decis\u00e3o descentralizado e difuso.<\/li>\n<\/ul>\n<p>Pensando em entender como as organiza\u00e7\u00f5es configuram-se para criar uma estrutura que promova os benef\u00edcios listados acima, me deparei com o trabalho de Anna Grandori e Santi Furnari (artigo original dispon\u00edvel\u00a0<a href=\"http:\/\/journals.sagepub.com\/doi\/pdf\/10.1177\/0170840607088023\" rel=\"nofollow\">aqui<\/a>). As autoras observaram que as empresas italianas mais inovadoras combinam diferentes tipos de estruturas de governan\u00e7a interna, caracterizadas por:<\/p>\n<ul>\n<li><strong>Mercado (incentivos monet\u00e1rios):<\/strong>\u00a0pagamento por desempenho (individual ou coletivo);<\/li>\n<li><strong>Burocr\u00e1tico (autoridade):<\/strong>\u00a0plano de carreira, planejamento estrat\u00e9gico, sistema de avalia\u00e7\u00e3o de desempenho, programa e processo de controle de qualidade;<\/li>\n<li><strong>Comunit\u00e1rio (divis\u00e3o de conhecimento, valores e cultura):<\/strong>\u00a0compartilhamento de informa\u00e7\u00f5es, canal de comunica\u00e7\u00e3o com stakeholders (clientes, colaboradores etc.), trabalho em equipe, participa\u00e7\u00e3o no processo de decis\u00e3o\/escolhas;<\/li>\n<li><strong>Democr\u00e1tico (responsabilidade, decis\u00e3o e direitos representados):<\/strong>\u00a0distribui\u00e7\u00e3o das responsabilidades, enriquecimento das atividades dos colaboradores e empoderamento dos colaboradores.<\/li>\n<\/ul>\n<p>O estudo realizado pelas autoras demonstrou que as empresas que combinam estruturas de mercado, burocra\u0301tica e comunit\u00e1ria (plurais) apresentam alto desempenho para inova\u00e7\u00e3o e efici\u00eancia.<\/p>\n<p>Alguns insights importantes do estudo s\u00e3o:<\/p>\n<ul>\n<li>Estruturas de mercado e as comunit\u00e1rias n\u00e3o s\u00e3o mutuamente exclusivas nem obrigatoriamente complementares para incentivar a inova\u00e7\u00e3o. Portanto, uma empresa pode combinar resultado e colabora\u00e7\u00e3o para gerar inova\u00e7\u00e3o;<\/li>\n<li>As estruturas burocr\u00e1ticas apresentaram maior relev\u00e2ncia para os resultados que visam a efici\u00eancia;<\/li>\n<li>A combina\u00e7\u00e3o entre as estruturas de mercado e burocr\u00e1tica \u00e9 capaz de gerar alto desempenho de inova\u00e7\u00e3o em contextos onde h\u00e1 baixa complexidade e baixa incerteza. Sendo assim, ambientes essencialmente r\u00edgidos e competitivos podem gerar inova\u00e7\u00f5es menos disruptivas;<\/li>\n<li>A combina\u00e7\u00e3o entre as estruturas de mercado e comunit\u00e1ria \u00e9 uma forma eficaz para alcan\u00e7ar, simultaneamente, a efici\u00eancia e a inova\u00e7\u00e3o em grandes empresas.<\/li>\n<\/ul>\n<p>Voc\u00ea deve estar se perguntando: afinal, o que isso tem a ver com desenvolver uma cultura \u00e1gil?<\/p>\n<p>Se voc\u00ea atua em uma empresa onde o foco est\u00e1 no resultado (<strong>mercado<\/strong>), provavelmente voc\u00ea ter\u00e1 dificuldades em desenvolver uma base de colabora\u00e7\u00e3o, a n\u00e3o ser que exista uma estrutura j\u00e1\u00a0<strong>comunit\u00e1ria<\/strong>\u00a0estabelecida. Agora, se voc\u00ea est\u00e1 em uma empresa que possui uma estrutura de colabora\u00e7\u00e3o (<strong>comunit\u00e1ria<\/strong>), mas que n\u00e3o disp\u00f5e de controle (<strong>burocr\u00e1tica<\/strong>), \u00e9 bem prov\u00e1vel que voc\u00ea lide com um ambiente ineficiente.<\/p>\n<p>Observo que as organiza\u00e7\u00f5es que combinam resultado, gest\u00e3o baseada em processos, colabora\u00e7\u00e3o e vis\u00e3o sist\u00eamica, estabelecem ambientes verdadeiramente \u00e1geis, onde h\u00e1 efici\u00eancia, inova\u00e7\u00e3o e efic\u00e1cia.<\/p>\n<h2><a id=\"user-content-ciclo-de-vida-da-lideran\u00e7a\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/367864d28c738875eadb62efd256281db6a7907c\/2018-05-cultura-agil.md#ciclo-de-vida-da-lideran%C3%A7a\"><\/a>Ciclo de vida da lideran\u00e7a<\/h2>\n<p>Voc\u00ea j\u00e1 ouviu falar da &#8220;life cycle theory of leadership&#8221; ou &#8220;lideran\u00e7a situacional&#8221;? Essa \u00e9 uma teoria criada em 1969 por dois psic\u00f3logos chamados Paul Hersey e Ken Blanchard. Os autores defendem a exist\u00eancia de quatro est\u00e1gios distintos de maturidade dentro de uma organiza\u00e7\u00e3o, sendo que estes influenciam diretamente no estilo de agir do l\u00edder para alcan\u00e7ar o sucesso na gest\u00e3o das pessoas:<\/p>\n<p><strong>N\u00edvel 1 &#8211; Determinar:<\/strong>\u00a0os liderados n\u00e3o possuem muita maturidade para executar determinadas tarefas, seja pelo fato dos mesmos n\u00e3o se sentirem seguros ou pela aus\u00eancia de vontade em execut\u00e1-las. Para que o trabalho seja feito, o l\u00edder deve delegar e acompanhar de perto a execu\u00e7\u00e3o (foco em dire\u00e7\u00e3o).<\/p>\n<p><strong>N\u00edvel 2 &#8211; Persuadir:<\/strong>\u00a0os liderados possuem uma maturidade moderada e suficiente para executarem as tarefas, por\u00e9m n\u00e3o contam com todas as habilidades necess\u00e1rias para exerc\u00ea-las em sua plenitude. Aqui, o l\u00edder al\u00e9m de direcionar o trabalho, deve apoiar e incentivar os liderados para que os mesmos alcancem a autoconfian\u00e7a e a motiva\u00e7\u00e3o necess\u00e1rias para agir (foco em aconselhar).<\/p>\n<p><strong>N\u00edvel 3 &#8211; Compartilhar:<\/strong>\u00a0os liderados possuem a maturidade entre moderada e alta, e as habilidades para executarem as tarefas, por\u00e9m falta confian\u00e7a ou vontade de assumir responsabilidade no trabalho. Neste momento, o papel do l\u00edder \u00e9 o de buscar a participa\u00e7\u00e3o e a colabora\u00e7\u00e3o dos liderados no processo de tomada das decis\u00f5es.<\/p>\n<p><strong>N\u00edvel 4 &#8211; Delegar:<\/strong>\u00a0neste est\u00e1gio os liderados encontram-se com a maturidade alta e com as habilidades e a disposi\u00e7\u00e3o que a tarefa exige. Neste n\u00edvel, o l\u00edder n\u00e3o precisa apoiar e direcionar efetivamente o trabalho, uma vez que os liderados possuem a autonomia e a confian\u00e7a do l\u00edder para criar as melhores solu\u00e7\u00f5es e execut\u00e1-las, independente de seu acompanhamento.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-7568\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/687474703a2f2f736974756174696f6e616c2d63646e2e32396b63646e2e6e65742f77702d636f6e74656e742f75706c6f6164732f323031342f30312f417070726f7665645f5369744c6561645f4d6f64656c2e706e67.png\" alt=\"\" width=\"292\" height=\"434\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/687474703a2f2f736974756174696f6e616c2d63646e2e32396b63646e2e6e65742f77702d636f6e74656e742f75706c6f6164732f323031342f30312f417070726f7665645f5369744c6561645f4d6f64656c2e706e67.png 292w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/05\/687474703a2f2f736974756174696f6e616c2d63646e2e32396b63646e2e6e65742f77702d636f6e74656e742f75706c6f6164732f323031342f30312f417070726f7665645f5369744c6561645f4d6f64656c2e706e67-202x300.png 202w\" sizes=\"(max-width: 292px) 100vw, 292px\" \/><\/p>\n<p>Fazendo um paralelo com a ado\u00e7\u00e3o do \u00e1gil, \u00e9 poss\u00edvel perceber que uma empresa no n\u00edvel 1 precisar\u00e1 de uma lideran\u00e7a que ofere\u00e7a dire\u00e7\u00f5es claras e que esteja apta a supervisionar a mudan\u00e7a. Neste est\u00e1gio \u00e9 importante que os pap\u00e9is e as responsabilidades estejam bem definidos, bem como uma dire\u00e7\u00e3o do que, como, quando e onde executar as tarefas. Empresas que est\u00e3o neste ponto precisam de lideran\u00e7as que possuam experi\u00eancia na ado\u00e7\u00e3o do \u00e1gil.<\/p>\n<p>No est\u00e1gio 2, a empresa precisar\u00e1 de uma lideran\u00e7a que forne\u00e7a orienta\u00e7\u00e3o, afinal, a capacidade de execu\u00e7\u00e3o das pessoas ainda ser\u00e1 baixa. Al\u00e9m disso, a lideran\u00e7a deve estar engajada e entusiasmada com a mudan\u00e7a, fornecendo um comportamento de apoio para as equipes. Empresas nesse n\u00edvel devem garantir que as iniciativas de ado\u00e7\u00e3o n\u00e3o morram por quest\u00f5es pol\u00edticas ou pelo desejo de resultados imediatos.<\/p>\n<p>No terceiro est\u00e1gio, o papel da lideran\u00e7a ser\u00e1 de apoio incondicional. A\u00e7\u00f5es facilitadoras, como escuta ativa e compartilhamento na tomada de decis\u00f5es devem ser enfatizadas. Empresas que est\u00e3o neste ponto j\u00e1 desenvolveram c\u00e9lulas de agilidade que est\u00e3o em pleno funcionamento e gerando resultado, portanto, a lideran\u00e7a deve utilizar tais casos de sucesso como inspira\u00e7\u00e3o para as novas estruturas que estiverem surgindo.<\/p>\n<p>No \u00faltimo est\u00e1gio, pouca dire\u00e7\u00e3o ou suporte se faz necess\u00e1ria. As equipes j\u00e1 encontram-se auto-organizadas e s\u00e3o capazes de tomar suas pr\u00f3prias decis\u00f5es. Devido ao seu alto n\u00edvel de motiva\u00e7\u00e3o, as equipes tamb\u00e9m n\u00e3o precisam de apoio. Empresas que atingem este grau de maturidade est\u00e3o no \u00e1pice de uma estrutura onde existem c\u00e9lulas independentes e autossustent\u00e1veis (fica a dica de um texto que fala sobre a\u00a0<a href=\"https:\/\/corporate-rebels.com\/guest-post-semco\/\" rel=\"nofollow\">SEMCO<\/a>, case nacional sobre estruturas celulares).<\/p>\n<h2><a id=\"user-content-conclus\u00e3o\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/367864d28c738875eadb62efd256281db6a7907c\/2018-05-cultura-agil.md#conclus%C3%A3o\"><\/a>Conclus\u00e3o<\/h2>\n<p>As ferramentas que compartilhei acima est\u00e3o me ajudando a entender melhor as estruturas das empresas e como compreender o papel das lideran\u00e7as na elabora\u00e7\u00e3o de um modelo \u00e1gil de trabalho.<\/p>\n<p>Espero que a partir do que compartilhei, voc\u00ea possa encontrar respostas para perguntas como:<\/p>\n<ol>\n<li>Por que est\u00e1 dif\u00edcil vender a ado\u00e7\u00e3o do \u00e1gil na minha empresa?<\/li>\n<li>Ser\u00e1 que a lideran\u00e7a da minha empresa est\u00e1 pronta para suportar a ado\u00e7\u00e3o do \u00e1gil?<\/li>\n<li>Ser\u00e1 que o \u00e1gil faz sentido no ambiente que estou?<\/li>\n<li>Adotar \u00e1gil significa abrir m\u00e3o de regras, processos e resultados?<\/li>\n<\/ol>\n<p>E como voc\u00ea tem acompanhado e participado da ado\u00e7\u00e3o do \u00e1gil no seu contexto? Quais s\u00e3o os desafios? Deixe sua opini\u00e3o nos coment\u00e1rios abaixo.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Desenvolver uma estrutura \u00e1gil est\u00e1 na agenda de muitas empresas. A promessa de que uma organiza\u00e7\u00e3o assim ser\u00e1 mais eficiente e responder\u00e1 melhor \u00e0s mudan\u00e7as no mercado \u00e9 algo que faz brilhar os olhos de qualquer pessoa que exer\u00e7a o papel executivo de uma companhia. O grande problema que venho observando no mercado \u00e9 um &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/05\/dicas-para-enfrentar-os-desafios-de-uma-transformacao-agil\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[1],"tags":[],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7567"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7567"}],"version-history":[{"count":4,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7567\/revisions"}],"predecessor-version":[{"id":7574,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7567\/revisions\/7574"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7567"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7567"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7567"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}