{"id":7122,"date":"2018-01-23T16:54:03","date_gmt":"2018-01-23T18:54:03","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7122"},"modified":"2018-01-23T17:41:51","modified_gmt":"2018-01-23T19:41:51","slug":"avaliando-os-estagios-do-portfolio-de-produtos-em-uma-empresa-digital","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/01\/avaliando-os-estagios-do-portfolio-de-produtos-em-uma-empresa-digital\/","title":{"rendered":"Avaliando os est\u00e1gios do portf\u00f3lio de produtos em uma empresa digital"},"content":{"rendered":"<p>Se voc\u00ea est\u00e1 inserido em uma empresa de solu\u00e7\u00f5es digitais, \u00e9 bem prov\u00e1vel que tenha se deparado com os seguintes questionamentos:<\/p>\n<ul>\n<li>Ser\u00e1 que temos capacidade produtiva suficiente para operar a quantidade de iniciativas (evolu\u00e7\u00f5es nos produtos atuais e cria\u00e7\u00e3o de novos produtos) que foram definidas para suportar a estrat\u00e9gia da empresa?<\/li>\n<li>Os crit\u00e9rios de prioriza\u00e7\u00e3o das iniciativas est\u00e3o claros para os diferentes n\u00edveis da empresa? Todos compreendem as motiva\u00e7\u00f5es pelas quais as iniciativas foram organizadas do jeito que est\u00e3o?<\/li>\n<li>Como est\u00e1 a sa\u00fade do portf\u00f3lio de produtos da empresa? Todos os produtos est\u00e3o operando eficientemente e gerando resultado financeiro positivo?<\/li>\n<\/ul>\n<p>Neste blog post, compartilharei uma t\u00e9cnica que temos utilizado na Plataformatec e que vem ajudando nossos clientes a terem visibilidade sobre em que est\u00e1gio os diferentes produtos do seu portf\u00f3lio se encontram.<\/p>\n<h2><a id=\"user-content-premissas-para-uma-boa-gest\u00e3o-de-portf\u00f3lio-de-produtos\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2017-12-estagios-produto.md#premissas-para-uma-boa-gest%C3%A3o-de-portf%C3%B3lio-de-produtos\" aria-hidden=\"true\"><\/a>Premissas para uma boa gest\u00e3o de portf\u00f3lio de produtos<\/h2>\n<p>Antes de aprofundar na descri\u00e7\u00e3o da t\u00e9cnica, gostaria de compartilhar tr\u00eas premissas importantes que apoiam uma gest\u00e3o de portf\u00f3lio de produtos inteligente:<\/p>\n<ul>\n<li><strong>Estabele\u00e7a resultados de neg\u00f3cio:<\/strong>\u00a0um erro comum que tenho observado nas empresas que atuam com produtos digitais \u00e9 uma obsess\u00e3o pela entrega de funcionalidades (features) e pouca discuss\u00e3o sobre como o entreg\u00e1vel de fato est\u00e1 contribuindo para um melhor resultado no neg\u00f3cio (aumento da receita, diminui\u00e7\u00e3o da evas\u00e3o de clientes, aumento no n\u00famero de clientes ativos, etc.). Sendo assim, para que o portf\u00f3lio de produtos seja administrado de forma inteligente, \u00e9 fundamental que todos da empresa estejam engajados em como ajudar o neg\u00f3cio a gerar melhores resultados.<\/li>\n<li><strong>Colete e divulgue as m\u00e9tricas de neg\u00f3cio:<\/strong>\u00a0para que todos tenham consci\u00eancia do impacto que o seu trabalho tem no resultado da empresa, se faz necess\u00e1ria a coleta e a dissemina\u00e7\u00e3o das m\u00e9tricas do neg\u00f3cio (para mais informa\u00e7\u00f5es sobre o assunto, n\u00e3o deixe de ler o blog post\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2018\/01\/o-que-seriam-boas-metricas-para-produtos-digitais\/\">O que seriam boas m\u00e9tricas para produtos digitais?<\/a>). Neste sentido, desenvolver rotinas que garantam visibilidade sobre a sa\u00fade do neg\u00f3cio se torna algo primordial para que as pessoas criem uma cultura orientada a dados. Algumas formas inteligentes que tenho observado e recomendado s\u00e3o: envio de uma mensagem di\u00e1ria atrav\u00e9s de um canal ass\u00edncrono (ex: email) com os principais indicadores do neg\u00f3cio; cria\u00e7\u00e3o de uma plataforma anal\u00edtica com as m\u00e9tricas do neg\u00f3cio dispon\u00edveis para consulta; reuni\u00f5es quinzenais sobre como as funcionalidades constru\u00eddas est\u00e3o impactando os resultados dos produtos; reuni\u00f5es mensais sobre como est\u00e1 a sa\u00fade financeira do portf\u00f3lio de produtos e para a defini\u00e7\u00e3o de planos de a\u00e7\u00e3o; reuni\u00f5es trimestrais para a defini\u00e7\u00e3o de OKRs (h\u00e1 um tempo atr\u00e1s escrevi um blog post sobre como\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\/\" rel=\"nofollow\">definir OKRs em equipes \u00e1geis<\/a>).<\/li>\n<li><strong>Equilibre os investimentos:<\/strong>\u00a0expandir o neg\u00f3cio atual e explorar novas oportunidades \u00e9 algo tentador, principalmente em empresas que acabaram de captar montantes consider\u00e1veis de dinheiro. Por\u00e9m, lembre-se que manter e desenvolver o territ\u00f3rio atual do neg\u00f3cio da empresa \u00e9 algo que garantir\u00e1 uma sa\u00fade financeira no curto prazo. Portanto, balancear a carga de recursos (financeiros, pessoas, tecnologia, pesquisa, etc.) investidos garantir\u00e1 que a empresa olhe para o curto, m\u00e9dio e longo prazo, a partir da combina\u00e7\u00e3o de evolu\u00e7\u00f5es nos produtos atuais, em inova\u00e7\u00f5es para o mercado atual e na explora\u00e7\u00e3o de um mercado futuro.<\/li>\n<\/ul>\n<h2><a id=\"user-content-analisando-os-diferentes-est\u00e1gios-dos-produtos\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2017-12-estagios-produto.md#analisando-os-diferentes-est%C3%A1gios-dos-produtos\" aria-hidden=\"true\"><\/a>Analisando os diferentes est\u00e1gios dos produtos<\/h2>\n<p>Vamos ao que interessa. Com objetivo de analisar o portf\u00f3lio de produtos em uma empresa, tenho utilizando um modelo que leva em considera\u00e7\u00e3o tr\u00eas est\u00e1gios de um ciclo de vida que s\u00e3o:<\/p>\n<ol>\n<li><strong>Discovery:<\/strong>\u00a0neste est\u00e1gio, a empresa identificou uma oportunidade de mercado, desenvolveu um modelo de neg\u00f3cio, definiu uma estrat\u00e9gia comercial, criou uma solu\u00e7\u00e3o tecnol\u00f3gica m\u00ednima que entrega valor aos usu\u00e1rios e estruturou um processo, mesmo que ineficiente, para sustentar a opera\u00e7\u00e3o do produto. \u00c9 muito comum acontecerem mudan\u00e7as e desperd\u00edcios, pois h\u00e1 o desafio de descobrir uma solu\u00e7\u00e3o que o mercado enxergar\u00e1 valor. Al\u00e9m disso, o est\u00e1gio de descoberta exige um maior investimento e geralmente \u00e9 mais estressante.<\/li>\n<li><strong>Refinamento:<\/strong>\u00a0neste est\u00e1gio, o produto j\u00e1 se encontra em opera\u00e7\u00e3o e o modelo de neg\u00f3cio precisa ser refinado para que a opera\u00e7\u00e3o se torne vi\u00e1vel. Evolu\u00e7\u00f5es na plataforma tecnol\u00f3gica, intensifica\u00e7\u00e3o na promo\u00e7\u00e3o atrav\u00e9s das estrat\u00e9gias em marketing e a identifica\u00e7\u00e3o de novos canais de vendas s\u00e3o temas corriqueiros no dia a dia de produtos neste est\u00e1gio. O produto ainda est\u00e1 descobrindo a melhor forma de gerar resultado e qualquer est\u00edmulo do mercado (ex: concorr\u00eancia, clientes, pre\u00e7o de venda, etc.) pode ser cr\u00edtico para que ele se torne um player de express\u00e3o.<\/li>\n<li><strong>Market share:<\/strong>\u00a0o \u00faltimo est\u00e1gio do modelo tem como objetivo garantir que o produto esteja gerando lucro para a empresa em um horizonte de curto, m\u00e9dio e longo prazo e, pode ser dividido em duas frentes:<\/li>\n<\/ol>\n<ul>\n<li><strong>Efici\u00eancia operacional:<\/strong>\u00a0as evolu\u00e7\u00f5es e melhorias no produto t\u00eam como foco o ganho atrav\u00e9s da escala. Redu\u00e7\u00e3o no custo de aquisi\u00e7\u00e3o por cliente, redu\u00e7\u00e3o no custo de atendimento aos clientes e diminui\u00e7\u00e3o nos custos de infraestrutura tecnol\u00f3gica s\u00e3o exemplos de direcionadores que garantir\u00e3o uma maior efici\u00eancia operacional para a empresa.<\/li>\n<li><strong>Inova\u00e7\u00e3o:<\/strong>\u00a0as evolu\u00e7\u00f5es t\u00eam como cerne a cria\u00e7\u00e3o de um diferencial competitivo que torne o produto cada vez mais valioso, raro, dif\u00edcil de ser imitado e insubstitu\u00edvel. Para que a empresa promova a inova\u00e7\u00e3o no produto \u00e9 importante que ela compreenda as necessidades dos clientes, promova rotinas que estimulem solu\u00e7\u00f5es &#8220;fora da caixa&#8221; e pense em maneiras de expandir o mercado atual.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-7124 aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/01\/estagios_produto_blog_post-1024x525.png\" alt=\"\" width=\"887\" height=\"455\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/01\/estagios_produto_blog_post-1024x525.png 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/01\/estagios_produto_blog_post-300x154.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/01\/estagios_produto_blog_post-768x394.png 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/01\/estagios_produto_blog_post.png 1062w\" sizes=\"(max-width: 887px) 100vw, 887px\" \/><\/p>\n<h2>Conclus\u00e3o<\/h2>\n<p>A visualiza\u00e7\u00e3o dos produtos a partir dos est\u00e1gios apresentados anteriormente tem os seguintes benef\u00edcios:<\/p>\n<ul>\n<li><strong>Quando tudo \u00e9 prioridade, nada \u00e9 prioridade.<\/strong>\u00a0Dar visibilidade aos diferentes stakeholders sobre o n\u00famero de produtos que a empresa est\u00e1 operando e criando e, ajudar a repensar a estrat\u00e9gia caso a rela\u00e7\u00e3o entre a capacidade de entrega e o n\u00famero de demandas seja elevadamente desproporcional.<\/li>\n<li><strong>Questione a cren\u00e7a de que todos os produtos d\u00e3o o mesmo resultado.<\/strong>\u00a0Estruturar e acelerar o processo de tomada de decis\u00e3o no caso de produtos que estejam h\u00e1 um tempo sem gerar resultado para a empresa, bem como dar clareza sobre os crit\u00e9rios utilizados para a manuten\u00e7\u00e3o do atual portf\u00f3lio de produtos.<\/li>\n<li><strong>Promova o desapego nas decis\u00f5es.<\/strong>\u00a0Equilibrar os investimentos e a aloca\u00e7\u00e3o das equipes sem ficar preso a desenhos organizacionais, mas sim com base na necessidade de acelera\u00e7\u00e3o dos resultados do neg\u00f3cio.<\/li>\n<\/ul>\n<p>E voc\u00ea? Os est\u00e1gios apresentados acima fazem sentido para o contexto de produtos da sua empresa? Deixe seu coment\u00e1rio abaixo.<\/p>\n<p>Ps: Caso voc\u00ea trabalhe com servi\u00e7o, saiba que estamos aplicando no portf\u00f3lio de servi\u00e7os da Plataformatec todos os conceitos apresentados neste blog post \ud83d\ude09<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=curso-metricas-agile&amp;utm_content=cta-blog-post-bottom\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-6692\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/curso-por-email-m\u00e9tricas-para-projetos-agile.png\" alt=\"\" width=\"277\" height=\"165\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Se voc\u00ea est\u00e1 inserido em uma empresa de solu\u00e7\u00f5es digitais, \u00e9 bem prov\u00e1vel que tenha se deparado com os seguintes questionamentos: Ser\u00e1 que temos capacidade produtiva suficiente para operar a quantidade de iniciativas (evolu\u00e7\u00f5es nos produtos atuais e cria\u00e7\u00e3o de novos produtos) que foram definidas para suportar a estrat\u00e9gia da empresa? Os crit\u00e9rios de prioriza\u00e7\u00e3o &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/01\/avaliando-os-estagios-do-portfolio-de-produtos-em-uma-empresa-digital\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,257,260],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7122"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7122"}],"version-history":[{"count":5,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7122\/revisions"}],"predecessor-version":[{"id":7129,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7122\/revisions\/7129"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7122"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7122"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7122"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}