{"id":6062,"date":"2017-02-02T16:06:29","date_gmt":"2017-02-02T18:06:29","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6062"},"modified":"2017-02-02T16:05:57","modified_gmt":"2017-02-02T18:05:57","slug":"a-sindrome-do-heroi-e-como-lidar-com-ela","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/02\/a-sindrome-do-heroi-e-como-lidar-com-ela\/","title":{"rendered":"A s\u00edndrome do her\u00f3i e como lidar com ela"},"content":{"rendered":"<p>Em 2010, Alex Payne escreveu <a href=\"https:\/\/al3x.net\/2010\/01\/09\/dont-be-a-hero.html\">um post sobre a s\u00edndrome do her\u00f3i<\/a> para seu blog. No entanto, mesmo algumas pessoas j\u00e1 estando cientes de que esse problema existe, n\u00f3s ainda vemos muitos her\u00f3is em projetos, e eles acabam afetando o processo de desenvolvimento. Portanto, decidimos falar um pouco mais sobre tal problema para tentar convenc\u00ea-lo de que ser um her\u00f3i n\u00e3o \u00e9 saud\u00e1vel para voc\u00ea, e nem para o seu trabalho.<\/p>\n<h2>Defini\u00e7\u00e3o<\/h2>\n<p>Vamos come\u00e7ar com a defini\u00e7\u00e3o de her\u00f3i. Fazendo uma tradu\u00e7\u00e3o livre do conte\u00fado do blog do Payne, temos que:<\/p>\n<blockquote style=\"border-left: solid 4px #bbb; padding-left: 15px; color: #888;\"><p>\n    <cite style=\"font-size:1.3em;\">O her\u00f3i \u00e9 uma pessoa que \u00e9 capaz de varar noites, trabalhar de fim de semana e fazer plant\u00f5es enquanto ningu\u00e9m mais se prontifica.<\/cite>\n<\/p>\n<\/blockquote>\n<p>Ent\u00e3o, qual o problema com her\u00f3is? N\u00f3s dividimos o problema em duas partes: sa\u00fade f\u00edsica e sa\u00fade do trabalho.<\/p>\n<h2>Sa\u00fade F\u00edsica<\/h2>\n<p>Bom, n\u00f3s n\u00e3o somos m\u00e9dicos, mas nos parece que j\u00e1 h\u00e1 informa\u00e7\u00e3o suficiente por a\u00ed sobre os males que trabalhar em excesso pode trazer ao seu corpo.<\/p>\n<p>O problema de sa\u00fade, nesse caso, \u00e9 relacionado \u00e0s a\u00e7\u00f5es que o her\u00f3i toma para alcan\u00e7ar seus objetivos: geralmente ele(a) dorme pouco e trabalha muito. Existe uma <strong>tonelada<\/strong> de informa\u00e7\u00f5es na internet e at\u00e9 mesmo no meio acad\u00eamico que mostram o que o v\u00edcio no trabalho e a priva\u00e7\u00e3o do sono causam ao nosso corpo. Para listar algumas dessas fontes, aqui vai uma pequena lista (em ingl\u00eas):<\/p>\n<ul>\n<li><a href=\"https:\/\/en.wikipedia.org\/wiki\/Effects_of_sleep_deprivation_on_cognitive_performance\">Effects of sleep deprivation on cognitive performance<\/a><\/li>\n<li><a href=\"http:\/\/onlinelibrary.wiley.com\/doi\/10.1046\/j.1365-2869.2000.00225.x\/full\">Neural basis of alertness and cognitive performance impairments during sleepiness. Effects of 24h of sleep deprivation on waking human regional brain activity<\/a><\/li>\n<li><a href=\"http:\/\/onlinelibrary.wiley.com\/doi\/10.1111\/j.1365-2869.1995.tb00220.x\/abstract\">An overview of sleepiness and accidents<\/a><\/li>\n<li><a href=\"http:\/\/www.huffingtonpost.com\/2014\/11\/07\/workaholic-bad_n_6093658.html\">Why Being A Workaholic Is Awful For You and Everyone Around You<\/a><\/li>\n<\/ul>\n<p>Al\u00e9m desses, o her\u00f3i pode ainda sofrer por n\u00e3o praticar atividades f\u00edsicas regulares e por n\u00e3o se alimentar adequadamente.<\/p>\n<p>E se voc\u00ea est\u00e1 pensando &#8220;Ah, mas eu bebo caf\u00e9&#8230; logo consigo lidar com muitos desses problemas&#8221;, aqui vai um material extra sobre os males do excesso de caf\u00e9 no nosso organismo:<\/p>\n<ul>\n<li><a href=\"http:\/\/www.sciencedirect.com\/science\/article\/pii\/S0025619613005788\">Association of Coffee Consumption With All-Cause and Cardiovascular Disease Mortality<\/a><\/li>\n<li><a href=\"https:\/\/www.researchgate.net\/profile\/Jana_Sawynok\/publication\/47644325_Caffeine_and_pain\/links\/00b49534bd0f8c8d27000000.pdf\">Caffeine and pain<\/a><\/li>\n<\/ul>\n<h2>Sa\u00fade do trabalho<\/h2>\n<p>Ent\u00e3o voc\u00ea faz parte da corrente <a href=\"https:\/\/en.wikipedia.org\/wiki\/YOLO_(aphorism)\">YOLO<\/a> e n\u00e3o liga para sua sa\u00fade f\u00edsica com tanto que valha a pena. Bom, acontece que voc\u00ea n\u00e3o est\u00e1 apenas afetando seu corpo, mas tamb\u00e9m afetando o projeto\/produto\/trabalho no qual age como her\u00f3i.<\/p>\n<p>Primeiramente, <strong>her\u00f3is n\u00e3o s\u00e3o necess\u00e1rios se o planejamento do projeto \u00e9 feito corretamente<\/strong>. O que quero dizer \u00e9 que ningu\u00e9m planeja no \u00ednicio do projeto que um programador trabalhar\u00e1 12 horas por dia, sem descanso. Ent\u00e3o, o que acontece \u00e9 que a proje\u00e7\u00e3o do esfor\u00e7o e do tempo necess\u00e1rios para realizar o projeto n\u00e3o foi bem calculada. N\u00f3s possu\u00edmos alguns blog posts falando sobre nossas m\u00e9tricas e como prever o fim de um projeto:<\/p>\n<ul>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/03\/why-we-love-metrics-cumulative-flow-diagrams\/\">Why we love metrics? Cumulative flow diagrams<\/a><\/li>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/02\/why-we-love-metrics-throughput-and-burnup-charts\/\">Why we love metrics? Throughput and Burnup charts<\/a><\/li>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/02\/why-we-love-metrics-learning-with-lead-time\/\">Why we love metrics? Learning with Lead time<\/a><\/li>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/08\/forecasting-software-projects-completion-date-through-monte-carlo-simulation\/\">Forecasting software project\u2019s completion date through Monte Carlo Simulation<\/a><\/li>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/01\/power-of-the-metrics-dont-use-average-to-forecast-deadlines\/\">Power of the metrics: Don&#8217;t use average to forecast deadlines<\/a><\/li>\n<li><a href=\"http:\/\/blog.plataformatec.com.br\/2016\/03\/looking-at-lead-time-in-a-different-way\/\">Looking at lead time in a different way<\/a><\/li>\n<\/ul>\n<p>Al\u00e9m disso, quando um time cont\u00e9m um her\u00f3i, os outros membros da equipe podem seguir dois comportamentos distintos:<\/p>\n<ul>\n<li>Eles podem achar que o her\u00f3i vai fazer todo o trabalho \u00e1rduo e, portanto, eles podem parar de se engajar tanto quanto antes e apenas realizar as tarefas mais simples.<\/li>\n<li>Eles podem come\u00e7ar a trabalhar como her\u00f3is para tentar se igualar ao primeiro, para que suas imagens n\u00e3o sejam ofuscadas pelo brilho do her\u00f3i.<\/li>\n<\/ul>\n<p>De qualquer maneira, seu time ser\u00e1 afetado de uma maneira negativa. Pode ser que, de in\u00edcio, tudo d\u00ea certo e que o time entregue tudo mais r\u00e1pido. No entanto, ap\u00f3s um tempo, a produtividade e\/ou qualidade da entrega ser\u00e1 afetada e seu time estar\u00e1 pior do que antes pois estar\u00e1 exausto.<\/p>\n<p>Mais ainda, existem outras consequ\u00eancias n\u00e3o comportamentais que podem afetar o seu time:<\/p>\n<ul>\n<li>Um her\u00f3i dentro do time gerar\u00e1 mais trabalho para seus colegas. Existir\u00e1 mais c\u00f3digo para ser revisado, mais tarefas para testar e assim por diante. Para resumir: mais WIP (Work In Progress).\n<ul>\n<li>Pode chegar a um estado insustent\u00e1vel, no qual o sistema esteja sobrecarregado;<\/li>\n<li>Os n\u00e3o-her\u00f3is podem ser considerados pregui\u00e7osos ou n\u00e3o comprometidos, devido \u00e0s compara\u00e7\u00f5es com o her\u00f3i;<\/li>\n<\/ul>\n<\/li>\n<li>Dependendo da arquitetura do sistema, o c\u00f3digo extra pode impactar o c\u00f3digo j\u00e1 existente, ou pull requests ativos.\n<ul>\n<li>Pode demandar mais trabalho para resolver conflitos;<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>Al\u00e9m disso, um estudo da London School of Economics juntamente com Harvard, &#8220;<a href=\"http:\/\/rstb.royalsocietypublishing.org\/content\/371\/1690\/20150192\">Innovation in the collective brain<\/a>&#8220;, fala sobre a import\u00e2ncia do trabalho coletivo nas grandes ideias inovadoras. Nem pessoas mundialmente reconhecidas como her\u00f3is, como Einstein, Steve Jobs e Darwin, trabalharam sozinhas. Um resumo do estudo pode ser encontrado nesse post da Inc: <a href=\"http:\/\/www.inc.com\/jessica-stillman\/social-beats-smart-when-it-comes-to-creativity-new-study-says.html\">The Heroic Inventor Is a Myth: Great Ideas Are Group Efforts<\/a>.<\/p>\n<h2>Lidando com her\u00f3is<\/h2>\n<p>Primeiramente, vamos dizer que voc\u00ea j\u00e1 notou que uma pessoa em seu time age como um her\u00f3i. O que fazer sobre isso? Bom, a primeira coisa a fazer \u00e9 conversar com seu gestor, ou a pessoa que reconhece os esfor\u00e7os do time, e mostrar a ele(a) o problema. Explicar como isso afeta seu time e tentar encoraj\u00e1-lo a parar de recompensar tais atos her\u00f3icos, e at\u00e9 mesmo proibir horas extras desnecess\u00e1rias.<\/p>\n<p>Se voc\u00ea n\u00e3o trabalhar com um her\u00f3i ainda, fa\u00e7a o melhor poss\u00edvel para evitar o surgimento de um e planeje muito bem seu projeto. Fa\u00e7a proje\u00e7\u00f5es conscientes, com prazos fact\u00edveis. Baseie sua proje\u00e7\u00e3o n\u00e3o somente em estimativas cegas, mas em n\u00fameros, simula\u00e7\u00f5es e hist\u00f3rico. Se voc\u00ea observar, durante o projeto, que cometeu um erro na sua previs\u00e3o, pare e adapte seu trabalho ou seu prazo. Nem todos os prazos s\u00e3o imut\u00e1veis, e nem todas as demandas s\u00e3o sempre necess\u00e1rias. Ent\u00e3o trabalhe arduamente para garantir que seu time est\u00e1 confort\u00e1vel com o tempo que tem.<\/p>\n<p>O que achou do texto? Voc\u00ea j\u00e1 viu ou foi um her\u00f3i em um time? Deixe seu coment\u00e1rio abaixo!<\/p>\n<hr>\n<div style=\"margin:20px 0 60px;\">\n<a href=\"http:\/\/pages.plataformatec.com.br\/spreadsheet-forecasting-software-project-completion-date?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=monte-carlo-spreadsheet&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\"><img decoding=\"async\" class=\"aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/08\/forecasting-software-project-cta.png\" alt=\"Download: Forecasting software project through Monte Carlo simulation (FREE spreadsheet)\"\/><\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Em 2010, Alex Payne escreveu um post sobre a s\u00edndrome do her\u00f3i para seu blog. No entanto, mesmo algumas pessoas j\u00e1 estando cientes de que esse problema existe, n\u00f3s ainda vemos muitos her\u00f3is em projetos, e eles acabam afetando o processo de desenvolvimento. Portanto, decidimos falar um pouco mais sobre tal problema para tentar convenc\u00ea-lo &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/02\/a-sindrome-do-heroi-e-como-lidar-com-ela\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[158,254],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6062"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6062"}],"version-history":[{"count":10,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6062\/revisions"}],"predecessor-version":[{"id":6084,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6062\/revisions\/6084"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6062"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6062"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6062"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}