{"id":784,"date":"2010-02-12T17:05:19","date_gmt":"2010-02-12T19:05:19","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=784"},"modified":"2010-02-12T17:05:19","modified_gmt":"2010-02-12T19:05:19","slug":"feliz-aniversario-devise","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2010\/02\/feliz-aniversario-devise\/","title":{"rendered":"Feliz Anivers\u00e1rio Devise"},"content":{"rendered":"<p>Hoje estamos comemorando o anivers\u00e1rio do <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>. Mas espere um pouco, se voc\u00ea est\u00e1 seguindo o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> desde o in\u00edcio pode estar se perguntando: &#8220;O <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> j\u00e1 completou um ano de vida?&#8221;. N\u00e3o. Hoje estamos completando exatamente 4 meses desde que o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> foi <a href=\"http:\/\/blog.plataformatec.com.br\/2009\/10\/thor-e-devise-no-rails-summit-latin-america-2009\/\">lan\u00e7ado no Rails Summit Latin America 2009<\/a>. E estamos muito orgulhosos e felizes em dizer que alcan\u00e7amos a <a href=\"http:\/\/github.com\/plataformatec\/devise\/commit\/4bfbeea7e6e6f78503abf5b59571a316a7a72158\">vers\u00e3o 1.0<\/a>! Yeah! Vamos comemorar e falar um pouquinho sobre a hist\u00f3ria do projeto.<\/p>\n<h3>O in\u00edcio<\/h3>\n<p>Decidimos criar o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> com base em alguns requisitos de um projeto que tivemos no ano passado. A grande maioria de nossos projetos normalmente precisam de uma interface de administra\u00e7\u00e3o para configurar a aplica\u00e7\u00e3o e alguma informa\u00e7\u00e3o com CRUD. E neste projeto em espec\u00edfico, precis\u00e1vamos de dois pap\u00e9is diferentes na mesma aplica\u00e7\u00e3o: o administrador com todos os poderes para gerenciar a aplica\u00e7\u00e3o, e os usu\u00e1rios finais que deveriam estar devidamente logados para executarem algumas coisas na aplica\u00e7\u00e3o. Normalmente essa situa\u00e7\u00e3o requer um modelo, com alguma coluna de &#8220;tipo&#8221; ou flag para determinar se o usu\u00e1rio \u00e9 admin ou n\u00e3o, certo? Ok, mas n\u00e3o gost\u00e1vamos muito deste m\u00e9todo. Ent\u00e3o come\u00e7amos a analisar as possibilidades:<\/p>\n<ul>\n<li><strong><a href=\"http:\/\/github.com\/binarylogic\/authlogic\">Authlogic<\/a><\/strong>: um c\u00f3digo \u00f3timo e cheio de funcionalidade, mas um pouco estranho gerenciando a sess\u00e3o atrav\u00e9s de um modelo. Al\u00e9m disso, ele gerenciava apenas a parte do modelo.<\/li>\n<li><strong><a href=\"http:\/\/github.com\/thoughtbot\/clearance\">Clearance<\/a><\/strong>: completo, funciona como Engine do Rails, m\u00f3dulos adicionais, tudo que precis\u00e1vamos. Entretanto, ele nos obriga a usar o modelo User, sem possibilidade de customizar isto.<\/li>\n<\/ul>\n<p>Certo, poder\u00edamos escolher um deles e com um pouco de trabalho extra alcan\u00e7ar\u00edamos nossos requisitos. Mas n\u00f3s precisar\u00edamos fazer isto toda vez que uma situa\u00e7\u00e3o dessas acontecesse? N\u00f3s respondemos n\u00e3o. N\u00e3o era DRY o suficiente. E n\u00f3s gostamos de ser DRY. Ent\u00e3o nasceu o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>.<\/p>\n<p>O principal objetivo da primeira vers\u00e3o do <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> era proporcionar o processo de login completo, incluindo recupera\u00e7\u00e3o de senha e confirma\u00e7\u00e3o de conta. E tudo deveria funcionar com pap\u00e9is diferentes, o que significa que voc\u00ea poderia facilmente adicionar em sua aplica\u00e7\u00e3o um papel de Admin, User, Account, ou qualquer outro que precisasse, sem muito trabalho. Tamb\u00e9m t\u00ednhamos um prazo: o <a href=\"http:\/\/www.railssummit.com.br\">Rails Summit<\/a>. Levou quase 1 m\u00eas de trabalho antes do <a href=\"http:\/\/www.railssummit.com.br\">Rails Summit<\/a>. Ainda me lembro os dias que antecederam o evento, n\u00f3s trabalhando quase como loucos para deixar o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> redondo, e tamb\u00e9m o <a href=\"http:\/\/github.com\/plataformatec\/devise\/blob\/master\/README.rdoc\">README<\/a> que foi escrito durante o evento. Ent\u00e3o, est\u00e1vamos prontos e apresentando o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> para o mundo.<\/p>\n<h3>Como ele funciona<\/h3>\n<p>O <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> nasceu com o intuito de gerenciar pap\u00e9is diferentes sem esfor\u00e7o, automaticamente, e isso \u00e9 conseguido atrav\u00e9s das Engines do Rails. Al\u00e9m disso, o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> \u00e9 constru\u00eddo sobre o <a href=\"http:\/\/github.com\/hassox\/warden\">Warden<\/a>, um \u00f3timo framework de autentica\u00e7\u00e3o para o Rack. Isso nos permitiu ser bastante flex\u00edveis e adicionar estrat\u00e9gias diferentes, hooks, a m\u00f3dulos facilmente. Em resumo, o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>:<\/p>\n<ul>\n<li>\u00c9 baseado no Rack;<\/li>\n<li>\u00c9 uma solu\u00e7\u00e3o MVC completa com base em Rails Engines;<\/li>\n<li>Permite que voc\u00ea tenha m\u00faltiplos pap\u00e9is (modelos\/escopos) logados ao mesmo tempo;<\/li>\n<li>\u00c9 totalmente baseado no conceito de modularidade: use somente o que voc\u00ea realmente precisa.<\/li>\n<\/ul>\n<h3>A estrada at\u00e9 agora<\/h3>\n<p><a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> foi lan\u00e7ado com os m\u00f3dulos b\u00e1sicos necess\u00e1rios para aquela aplica\u00e7\u00e3o espec\u00edfica: <\/p>\n<ul>\n<li><strong>Authenticatable<\/strong>: respons\u00e1vel por logar usu\u00e1rios atr\u00e1ves de formul\u00e1rios, gerenciando valida\u00e7\u00e3o de senha e autentica\u00e7\u00e3o.<\/li>\n<li><strong>Confirmable<\/strong>: controla a confirma\u00e7\u00e3o de conta de usu\u00e1rios.<\/li>\n<li><strong>Recoverable<\/strong>: gerencia a recupera\u00e7\u00e3o de senhas.<\/li>\n<li><strong>Validatable<\/strong>: valida\u00e7\u00e3o b\u00e1sica de email e senha.<\/li>\n<\/ul>\n<p>Certo, t\u00ednhamos tudo que precis\u00e1vamos at\u00e9 ent\u00e3o. O restante estava em uma wishlist, a qual chamamos de TODO. E decidimos desde o princ\u00edpio n\u00e3o adicionar funcionalidades ao <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> at\u00e9 que n\u00f3s ou outra pessoa realmente precisasse. Mas as pessoas pediram, as pessoas precisavam de novas funcionalidades. E elas sempre estiveram l\u00e1 para ajudar, para criar um fork e corrigir um bug, para comentar. Ent\u00e3o logo come\u00e7amos a adicionar novas funcionalidades, a primeira era:<\/p>\n<ul>\n<li><strong>Rememberable<\/strong>: gerencia o login autom\u00e1tico de usu\u00e1rios a partir de cookies.<\/li>\n<\/ul>\n<p>Depois as pessoas pediram por maneiras mais f\u00e1ceis de criar as migratios, ent\u00e3o introduzimos um novo m\u00f3dulo com o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> 0.2:<\/p>\n<ul>\n<li><strong>Migratable<\/strong>: cria hooks nas <a href=\"http:\/\/ar.rubyonrails.org\/classes\/ActiveRecord\/Migration.html\">migrations<\/a> do <a href=\"http:\/\/ar.rubyonrails.org\/\">ActiveRecord<\/a> adicionando alguns m\u00e9todos para criar os campos para o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>. Assim voc\u00ea pode fazer coisas como <code>t.authenticatable<\/code>, <code>t.confirmable<\/code> e assim por diante.<\/li>\n<\/ul>\n<p>Para ajudar as pessoas a iniciarem mais rapidamente, criamos ent\u00e3o alguns geradores. Atualmente s\u00e3o eles:<\/p>\n<ul>\n<li><code>script\/generate <strong>devise_install<\/code><\/strong>: cria um arquivo de inicializa\u00e7\u00e3o para habilitar algumas configura\u00e7\u00f5es e tamb\u00e9m copia o arquivo padr\u00e3o de locale.<\/li>\n<li><code>script\/generate <strong>devise<\/strong> MyModel<\/code>: cria um modelo j\u00e1 configurado para o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>, adiciona rotas e uma migration.<\/li>\n<li><code>script\/generate <strong>devise_views<\/strong><\/code>: copia todas as views do <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> para seu diret\u00f3rio app\/views, permitindo que voc\u00ea altere como achar necess\u00e1rio.<\/li>\n<\/ul>\n<p>As vers\u00f5es 0.3 e 0.4 do <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> vieram logo em seguida, com v\u00e1rios bugs corrigidos nos geradores, I18n, inicializa\u00e7\u00e3o, alguns m\u00e9todos deprecados e uma por\u00e7\u00e3o de c\u00f3digo refatorado.<\/p>\n<p>As contribui\u00e7\u00f5es da comunidade estavam aparecendo cada vez mais. A primeira grande contribui\u00e7\u00e3o veio com a adi\u00e7\u00e3o dos encryptors. Atualmente o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> suporta a criptografia de senhas com SHA1, SHA512 e Bcrypt. Ele tamb\u00e9m possui suporte \u00e0s mesmas rotinas de criptografia do <a href=\"http:\/\/github.com\/binarylogic\/authlogic\">Authlogic<\/a>, <a href=\"http:\/\/github.com\/thoughtbot\/clearance\">Clearance<\/a> e <a href=\"http:\/\/github.com\/technoweenie\/restful-authentication\">Restful Authentication<\/a>, para auxili\u00e1-lo a migrar dessas solu\u00e7\u00f5es.<\/p>\n<p>Neste ponto pensamos: certo, j\u00e1 deve ser o bastante. N\u00e3o era. As pessoas precisavam de ORMs diferentes do <a href=\"http:\/\/ar.rubyonrails.org\/\">ActiveRecord<\/a>. Ent\u00e3o adicionamos suporte ao <a href=\"http:\/\/mongomapper.com\/\">MongoMapper<\/a> e est\u00e1vamos alcan\u00e7ando o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> 0.5.<\/p>\n<p>Est\u00e1vamos recebendo muito feedback sobre problemas com testes funcionais, ent\u00e3o constru\u00edmos o Devise::TestHelper, que cont\u00e9m m\u00e9todos para auxiliar as pessoas com o processo de sign in\/out nestes testes.<\/p>\n<p>Conforme as aplica\u00e7\u00f5es crescem, mais pap\u00e9is podem ser necess\u00e1rios. Ent\u00e3o adicionamos a possibilidade de criar views espec\u00edficas para cada papel\/escopo de sua aplica\u00e7\u00e3o. Assim seu usu\u00e1rio poderia ter uma view para logar diferente do administrador, por exemplo. Chegando na vers\u00e3o 0.6, v\u00e1rias melhorias foram feitas na gera\u00e7\u00e3o de rotas e o suporte ao <a href=\"http:\/\/datamapper.org\/\">DataMapper<\/a> foi adicionado.<\/p>\n<p>Est\u00e1vamos cheio de id\u00e9ias legais para adicionar novas funcionalidades, e nosso TODO estava maior do que gostamos. Ent\u00e3o surgimos com:<\/p>\n<ul>\n<li><strong>Timeoutable<\/strong>: faz uma checagem em cada request para destruir a sess\u00e3o do usu\u00e1rio ap\u00f3s um certo per\u00edodo de inatividade, pedindo por credenciais novamente.<\/li>\n<li><strong>Trackable<\/strong>: registra o n\u00famero de logins do usu\u00e1rio, \u00faltima data\/hora e ip usados para acessar.<\/li>\n<\/ul>\n<p>Tamb\u00e9m o processo de carregamento e o suporte a diferentes ORMs receberam uma boa aten\u00e7\u00e3o com o lan\u00e7amento do <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> 0.7.<\/p>\n<p>Para a vers\u00e3o 0.8 do <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> melhoramos os testes para o <a href=\"http:\/\/mongomapper.com\/\">MongoMapper<\/a> e fizemos uma grande revis\u00e3o no c\u00f3digo. Algum esfor\u00e7o tamb\u00e9m foi feito para ter o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> rodando com a \u00faltima vers\u00e3o do <a href=\"http:\/\/github.com\/hassox\/warden\">Warden<\/a> e as novas features, tais como os serializers.  Outro m\u00f3dulo base foi extra\u00eddo do Confirmable:<\/p>\n<ul>\n<li><strong>Activatable<\/strong>: permite configurar m\u00e9todos adicionais para ativa\u00e7\u00e3o de um modelo.<\/li>\n<\/ul>\n<p>Com muito feedback vindo da comunidade, fizemos merge de uma nova funcionalidade bacana:<\/p>\n<ul>\n<li><strong>Lockable<\/strong>: bloqueia contas com base no n\u00famero de tentativas de login inv\u00e1lidas.<\/li>\n<\/ul>\n<p>Seguindo o mesmo padr\u00e3o do Rails <a href=\"http:\/\/github.com\/rails\/rails\/commit\/fa575973\">neste commit<\/a> alteramos as mensagens flash para <code>:notice<\/code> e <code>:alert<\/code>, e lan\u00e7amos o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> 0.9. Passo a passo a vers\u00e3o 1.0 estava chegando.<\/p>\n<h3>O que h\u00e1 de novo<\/h3>\n<p>O <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> 1.0 traz uma grande variedade de funcionalidades legais. A comunidade parece estar realmente apreciando o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>, e recebemos outra grande contribui\u00e7\u00e3o:<\/p>\n<ul>\n<li><strong>Token Authenticatable<\/strong>: valida a autenticidade de um usu\u00e1rio atr\u00e1ves do login com um token de autentica\u00e7\u00e3o (tamb\u00e9m conhecido como &#8220;token de acesso \u00fanico&#8221;).<\/li>\n<\/ul>\n<p>Al\u00e9m disso, criamos as duas funcionalidades mais pedidas para o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>:<\/p>\n<ul>\n<li><strong>Registerable<\/strong>: controla o registro de usu\u00e1rios (sign up), e tamb\u00e9m edi\u00e7\u00e3o\/atualiza\u00e7\u00e3o das informa\u00e7\u00f5es do usu\u00e1rio e cancelamento de conta.<\/li>\n<li><strong>HTTP Authenticatable<\/strong>: autentica\u00e7\u00e3o http basic.<\/li>\n<\/ul>\n<p>Tamb\u00e9m adicionamos a possibilidade de usar o Migratable ao editar uma tabela, usando <code>change_table<\/code>, dentre outras corre\u00e7\u00f5es.<\/p>\n<h3>O que vem agora<\/h3>\n<p>Estamos preparando um novo release do <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> totalmente compat\u00edvel com o Rails 3. Isso significa que a partir de agora o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> est\u00e1 fechado para desenvolvimento de novas funcionalidades no Rails 2.x. Vamos manter um branch da vers\u00e3o 1.0 no github para corre\u00e7\u00e3o de bugs mantendo tudo funcionando.<\/p>\n<h3>Para terminar<\/h3>\n<p>Gostar\u00edamos de dizer muito obrigado a todos que nos ajudaram a chegar a vers\u00e3o 1.0 e a quem est\u00e1 utilizando o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>, testando, criando issues e nos dando todo este feedback.<\/p>\n<p>Tamb\u00e9m, para aqueles que estavam no <a href=\"http:\/\/www.railssummit.com.br\">Rails Summit<\/a> do ano passado, n\u00f3s propusemos algo: alcan\u00e7ar o maior n\u00famero de seguidores no github t\u00e3o r\u00e1pido quanto poss\u00edvel! Quando apresentamos o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>, haviam 7 seguidores, e se estou correto n\u00f3s eramos 4 deles. No momento da reda\u00e7\u00e3o deste post n\u00f3s temos 762 seguidores. Yeah! Acho que posso assumir o risco e dizer que n\u00f3s conseguimos. Obrigado!<\/p>\n<p>Vamos comemorar o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> 1.0, e aguardar ansiosos para ver o <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a> com o Rails 3. Aproveite!<\/p>\n<p>Feliz anivers\u00e1rio <a href=\"http:\/\/github.com\/plataformatec\/devise\">Devise<\/a>! <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hoje estamos comemorando o anivers\u00e1rio do Devise. Mas espere um pouco, se voc\u00ea est\u00e1 seguindo o Devise desde o in\u00edcio pode estar se perguntando: &#8220;O Devise j\u00e1 completou um ano de vida?&#8221;. N\u00e3o. Hoje estamos completando exatamente 4 meses desde que o Devise foi lan\u00e7ado no Rails Summit Latin America 2009. E estamos muito orgulhosos &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2010\/02\/feliz-aniversario-devise\/\">\u00bb<\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/784"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=784"}],"version-history":[{"count":12,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/784\/revisions"}],"predecessor-version":[{"id":801,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/784\/revisions\/801"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=784"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=784"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=784"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}