{"id":9244,"date":"2019-08-28T16:22:44","date_gmt":"2019-08-28T19:22:44","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9244"},"modified":"2019-08-28T16:18:18","modified_gmt":"2019-08-28T19:18:18","slug":"pare-de-medir-sua-equipe-meca-o-fluxo","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/08\/pare-de-medir-sua-equipe-meca-o-fluxo\/","title":{"rendered":"Pare de medir sua equipe! Me\u00e7a o fluxo."},"content":{"rendered":"\n<p>Muitas pessoas gestoras gostam de falar de produtividade e assertividade. \u201cQuando minha demanda estar\u00e1 pronta?\u201d, \u201cComo ajudar meu time a entregar mais?\u201d, s\u00e3o perguntas recorrentes em algumas organiza\u00e7\u00f5es.<\/p>\n\n\n\n<p>Um dos significados de produtividade diz respeito \u00e0 capacidade de gerar resultados. Em muitos casos, acredita-se que para aument\u00e1-la \u00e9 necess\u00e1rio maximizar a utiliza\u00e7\u00e3o de recursos de um sistema para eliminar ou reduzir os desperd\u00edcios. E qual o problema disso? Essa \u00e9 a defini\u00e7\u00e3o do que \u00e9 efici\u00eancia e otimiz\u00e1-la \u00e9 sempre positivo, n\u00e3o \u00e9 mesmo?<\/p>\n\n\n\n<p>Bom, depende. Quando falamos sobre melhorar a efici\u00eancia de um sistema, esquecemos que ela existe em diferentes tipos. As mais conhecidas s\u00e3o a efici\u00eancia de recursos e efici\u00eancia de fluxo.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"paradoxo-da-utiliza\u00e7\u00e3o-de-recursos\">Paradoxo da utiliza\u00e7\u00e3o de recursos<\/h2>\n\n\n\n<p>A efici\u00eancia de recursos contempla a vis\u00e3o anal\u00edtica do seu sistema. Nela o foco \u00e9 manter a ocupa\u00e7\u00e3o m\u00e1xima e, por isso, as demandas s\u00e3o alocadas por recursos. Pensar numa utiliza\u00e7\u00e3o pr\u00f3xima dos 100% at\u00e9 faz sentido se voc\u00ea estiver num contexto em que os recursos do trabalho s\u00e3o m\u00e1quinas, ferramentas e dispositivos, por exemplo.<\/p>\n\n\n\n<p>Mas e quando consideramos pessoas entregando valor atrav\u00e9s de software? Com certeza, o impacto da variabilidade humana \u00e9 mais vis\u00edvel no resultado. Um exemplo que pode ser comparado a esse cen\u00e1rio \u00e9 o do fluxo do tr\u00e2nsito.<\/p>\n\n\n\n<p>Vamos considerar que a m\u00e9trica de efici\u00eancia do sistema seja a vaz\u00e3o de carros por hora. Um congestionamento implica em menor vaz\u00e3o de carros e mais tempo de perman\u00eancia deles na via. O que acontece, ent\u00e3o, quando um motorista mexe no celular e perde o tempo do sem\u00e1foro? Ou quando um carro que falha na hora da partida? Nessa situa\u00e7\u00e3o, a influ\u00eancia da variabilidade humena \u00e9 muito maior. Quando maximizamos a utiliza\u00e7\u00e3o das pistas, n\u00e3o h\u00e1 espa\u00e7o de manobra e esse efeito fica ainda pior.<\/p>\n\n\n\n<p>Ao permanecer em um congestionamento o desperd\u00edcio de tempo e combust\u00edvel aumenta, e a vaz\u00e3o de carros normalmente diminui. A partir do exemplo utilizado para o contexto de transporte, ser\u00e1 que estamos sendo realmente eficientes utilizando o m\u00e1ximo da capacidade do fluxo para a entrega de software?<\/p>\n\n\n\n<p>Por mais que seja uma ideia contraintuitiva, otimizar o fluxo pode envolver a limita\u00e7\u00e3o do uso de recursos e a gera\u00e7\u00e3o de uma folga sist\u00eamica para margem de manobra. Ficou confuso? Vou explicar melhor.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"otimiza\u00e7\u00e3o-de-fluxo\">Otimiza\u00e7\u00e3o de fluxo<\/h3>\n\n\n\n<p>Ao pensar em efici\u00eancia de fluxo, no exemplo do tr\u00e1fego, o objetivo n\u00e3o \u00e9 manter todas as vias ocupadas, mas sim garantir que haja uma fluidez saud\u00e1vel, constante e que a vaz\u00e3o de carros seja maior. Por mais que a nossa primeira ideia seja pensar que ocupar 100% do espa\u00e7o ajudaria, com o impacto do fator humano, ter\u00edamos mais congestionamento e menos vaz\u00e3o.<\/p>\n\n\n\n<p>Olhando para o cen\u00e1rio de entrega de software, temos o impacto da variabilidade da demanda, da complexidade do trabalho e do fator humano. Utilizar o m\u00e1ximo da capacidade, ent\u00e3o, n\u00e3o significa maior vaz\u00e3o e nem maior entrega de valor. Ao contr\u00e1rio disso, implica diretamente no tempo que as demandas levam para percorrer o fluxo todo.<\/p>\n\n\n\n<p>Caso tenha ficado curioso(a) sobre o assunto, indico esse artigo do&nbsp;<a href=\"https:\/\/observablehq.com\/@troymagennis\/how-does-utilization-impact-lead-time-of-work\">Troy Magennis<\/a>&nbsp;sobre o impacto da utiliza\u00e7\u00e3o m\u00e1xima da capacidade na m\u00e9trica de lead time.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"efici\u00eancia-de-fluxo-por-que-medir\">Efici\u00eancia de fluxo: por que medir?<\/h2>\n\n\n\n<p>Quando focamos em efici\u00eancia de recursos estamos atuando em um n\u00edvel individual. Se o objetivo for realizar o m\u00e1ximo de tarefas poss\u00edvel por pessoa, a chance de haver um ac\u00famulo de demandas incompletas sendo empurradas de um lado para o outro \u00e9 grande.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/camo.githubusercontent.com\/174c75750b0293e9047841cf97cdbfb2e11965e6\/68747470733a2f2f692e696d6775722e636f6d2f6f39714a46745a2e706e67\"><img decoding=\"async\" src=\"https:\/\/camo.githubusercontent.com\/174c75750b0293e9047841cf97cdbfb2e11965e6\/68747470733a2f2f692e696d6775722e636f6d2f6f39714a46745a2e706e67\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>Alguns problemas que podem ocorrer s\u00e3o:<\/p>\n\n\n\n<ul><li>Silos de informa\u00e7\u00e3o;<\/li><li>Diminui\u00e7\u00e3o da colabora\u00e7\u00e3o;<\/li><li>V\u00e1rias demandas parcialmente completas e pouco valor entregue ao cliente.<\/li><\/ul>\n\n\n\n<p>Levando em considera\u00e7\u00e3o o aspecto dos times, trazer a medi\u00e7\u00e3o baseada na otimiza\u00e7\u00e3o do fluxo pode ajudar as pessoas a terem um objetivo compartilhado e concentrarem-se na melhoria dos processos, al\u00e9m de entregarem as atividades que est\u00e3o executando o mais r\u00e1pido poss\u00edvel. A vis\u00e3o sist\u00eamica \u00e9 uma parte fundamental disso tudo e ajuda a equipe a ter embasamento e autonomia para tomar suas decis\u00f5es.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"como-fazer\">Como fazer?<\/h2>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"visualize-seu-fluxo-de-trabalho\">Visualize seu fluxo de trabalho<\/h3>\n\n\n\n<p>Esse primeiro passo \u00e9 muito importante para proporcionar uma vis\u00e3o sist\u00eamica para o seu time. Sem isso, tendemos a otimizar os lugares \u201cerrados\u201d e n\u00e3o enxergar a causa raiz dos problemas recorrentes.<\/p>\n\n\n\n<p>A visualiza\u00e7\u00e3o vai proporcionar \u00e0s pessoas a an\u00e1lise de como as demandas caminham no fluxo e quais as poss\u00edveis decis\u00f5es para aumentar a vaz\u00e3o de entregas de valor.<\/p>\n\n\n\n<p>Depois de trazer essa visibilidade, analise se seu fluxo funciona assim:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/camo.githubusercontent.com\/91b1c42f94f7bf63ec27eeb20f705c7e3e1fa182\/68747470733a2f2f692e696d6775722e636f6d2f346a794f4634342e706e67\"><img decoding=\"async\" src=\"https:\/\/camo.githubusercontent.com\/91b1c42f94f7bf63ec27eeb20f705c7e3e1fa182\/68747470733a2f2f692e696d6775722e636f6d2f346a794f4634342e706e67\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>Uma demanda entra, passa por algumas etapas de processamento e depois de algum tempo \u00e9 entregue para o seu usu\u00e1rio. O problema \u00e9 que muitas vezes n\u00e3o temos visibilidade do tempo e etapa em que as demandas est\u00e3o esperando para serem trabalhadas. Nesse caso, faz sentido criar etapas de filas que mapeiem melhor os itens que est\u00e3o aguardando. Isso vai ajudar a identificar quais etapas est\u00e3o tendo mais ac\u00famulo de trabalho e quanto tempo as demandas est\u00e3o passando nessas filas.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/camo.githubusercontent.com\/5b634961a8771f882177b4c5c28e70f59c04fb9b\/68747470733a2f2f692e696d6775722e636f6d2f655243546239332e706e67\"><img decoding=\"async\" src=\"https:\/\/camo.githubusercontent.com\/5b634961a8771f882177b4c5c28e70f59c04fb9b\/68747470733a2f2f692e696d6775722e636f6d2f655243546239332e706e67\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>Como j\u00e1 falamos, o tempo de espera pode ser causado por diversas raz\u00f5es, incluindo mudan\u00e7as de prioridade, depend\u00eancias, requisitos com alta incerteza, entre outros. Alguns desses aspectos podemos controlar e outros n\u00e3o.<\/p>\n\n\n\n<p>Em alguns momentos, nem temos consci\u00eancia de que essas esperas est\u00e3o acontecendo. O Guilherme Fr\u00e9 abordou alguns bons exemplos sobre estoques no desenvolvimento de software&nbsp;<a href=\"http:\/\/blog.plataformatec.com.br\/2017\/12\/estoques-no-desenvolvimento-de-software\/\">nesse texto<\/a>&nbsp;e, em resumo, eu trouxe os cen\u00e1rios que voc\u00ea pode encontrar por a\u00ed:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/camo.githubusercontent.com\/a353af0071c2cfb089ce2487a23f31c7646f5753\/68747470733a2f2f692e696d6775722e636f6d2f496741457534392e706e67\"><img decoding=\"async\" src=\"https:\/\/camo.githubusercontent.com\/a353af0071c2cfb089ce2487a23f31c7646f5753\/68747470733a2f2f692e696d6775722e636f6d2f496741457534392e706e67\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>Outro cen\u00e1rio muito comum que configura uma espera s\u00e3o os bloqueios que encontramos durante o desenvolvimento. Por\u00e9m, muitas vezes, isso ocorre nas pr\u00f3prias etapas de trabalho e fica complicado medir quanto tempo a demanda ficou bloqueada e quanto tempo houve trabalho aplicado.<\/p>\n\n\n\n<p>Tendo esse custo de coordena\u00e7\u00e3o em vista, eu n\u00e3o recomendo que esse c\u00e1lculo entre na efici\u00eancia de fluxo. Nesse caso, faz-se muito mais importante a visibilidade de uma m\u00e9trica que mostre quantas demandas est\u00e3o ficando bloqueadas por etapa e se existe alguma coluna em que isso acontece mais frequentemente. Assim, vai ser poss\u00edvel mapear as poss\u00edveis causas raiz desses problemas.<\/p>\n\n\n\n<p>E vale lembrar que, haja o que houver,&nbsp;<strong>n\u00e3o crie uma coluna de \u201cbloqueado\u201d<\/strong>&nbsp;no seu fluxo. \ud83d\ude42 Leia mais&nbsp;<a href=\"https:\/\/www.valueglide.com\/blog\/why-blocked-is-not-a-state\">aqui<\/a>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"calcule-a-efici\u00eancia-de-fluxo\">Calcule a efici\u00eancia de fluxo<\/h3>\n\n\n\n<p>Para calcular a efici\u00eancia de fluxo atual vamos usar o lead time como m\u00e9trica base. J\u00e1 falamos bastante aqui no blog sobre&nbsp;<a href=\"http:\/\/blog.plataformatec.com.br\/?s=lead+time\">lead time<\/a>. Para os itens terminados, levaremos em considera\u00e7\u00e3o a quantidade de trabalho aplicado e quantidade de espera no fluxo. Mais ou menos assim:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/camo.githubusercontent.com\/44ef6ddff602996ddf0c8114927fa57c6abc8ef8\/68747470733a2f2f692e696d6775722e636f6d2f505139753753712e706e67\"><img decoding=\"async\" src=\"https:\/\/camo.githubusercontent.com\/44ef6ddff602996ddf0c8114927fa57c6abc8ef8\/68747470733a2f2f692e696d6775722e636f6d2f505139753753712e706e67\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p>No exemplo acima, \u00e9 poss\u00edvel observar uma efici\u00eancia de fluxo de 37,5%. Isso nos diz que 62,5% do tempo em que nossas demandas est\u00e3o em progresso, elas est\u00e3o em etapas de espera. Mas como otimizar isso?<\/p>\n\n\n\n<p>Tempos de espera ou em filas, muitas vezes, s\u00e3o inevit\u00e1veis em nosso sistema. Acontece de n\u00e3o podermos controlar algumas vari\u00e1veis. \u00c9 a vida. \ud83d\ude42 Mas e quanto ao que podemos administrar?<\/p>\n\n\n\n<p>A ideia \u00e9 que consigamos visualizar nossas etapas de espera e otimizar as que temos possibilidade de manejo. Uma das formas de agir ativamente no que temos controle \u00e9 come\u00e7ar a limitar o trabalho em progresso.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"limite-o-trabalho-em-progresso\">Limite o trabalho em progresso<\/h3>\n\n\n\n<p>Por mais contraintuitivo que pare\u00e7a ser, controlar o seu trabalho em progresso (WIP) pode ajudar a trazer um equil\u00edbrio saud\u00e1vel entre efici\u00eancia de fluxo e de recursos. Como? Limitar o WIP consolida a ideia de que as demandas sejam puxadas de acordo com a capacidade para sua execu\u00e7\u00e3o e n\u00e3o simplesmente sejam empurradas de uma etapa para outra.<\/p>\n\n\n\n<p>De acordo com David J. Anderson, em seu famoso&nbsp;<a href=\"https:\/\/www.amazon.com.br\/Kanban-English-David-J-Anderson-ebook\/dp\/B0057H2M70\/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;keywords=kanban&amp;qid=1566318051&amp;s=gateway&amp;sr=8-1\">livro azul<\/a>, \u201cexiste causalidade entre a quantidade de trabalho em progresso e o tempo m\u00e9dio de espera, e essa rela\u00e7\u00e3o \u00e9 linear.\u201d Ou seja, quanto mais ac\u00famulo de demandas n\u00e3o terminadas, maior o tempo em filas, por exemplo. Esse \u00e9 um estudo tamb\u00e9m corroborado pela Lei de Little ,que j\u00e1 conversamos&nbsp;<a href=\"https:\/\/contagil.simplecast.com\/episodes\/parte-12-a-relacao-entre-lead-time-wip-e\">aqui<\/a>&nbsp;no&nbsp;<a href=\"https:\/\/contagil.simplecast.com\/\">Cont\u00e1gil podcast<\/a>, e pode ser melhor compreendida nesse&nbsp;<a href=\"http:\/\/blog.kudoos.com.br\/gestao-agil\/entendendo-lei-de-little\/\">artigo<\/a>.<\/p>\n\n\n\n<p>Olhando pela perspectiva da colabora\u00e7\u00e3o, o controle do trabalho em progresso ajuda as pessoas a se dividirem melhor entre o que precisa ser feito. Afinal, quando o limite \u00e9 atingido a equipe n\u00e3o pode come\u00e7ar nada novo, mas sim ajudar nas demandas no sistema que est\u00e3o mais pr\u00f3ximas de sair do fluxo.<\/p>\n\n\n\n<p>Para iniciar o limite de WIP, minha dica \u00e9 come\u00e7ar com o fluxo como est\u00e1 hoje e ir definindo os limites aos poucos. Al\u00e9m disso, colha feedback com a equipe para entender como eles tem visto a mudan\u00e7a.<a href=\"http:\/\/blog.plataformatec.com.br\/2016\/09\/case-study-of-a-wip-limit-implementation-why-when-and-how-to-use-wip-limits\/\">Aqui<\/a>&nbsp;no blog tamb\u00e9m temos diversos artigos que v\u00e3o te ajudar a come\u00e7ar.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"recapitulando\">Recapitulando<\/h2>\n\n\n\n<ul><li>Tente n\u00e3o cair na tenta\u00e7\u00e3o de focar suas energias em otimizar apenas os elementos de um sistema, ter uma vis\u00e3o mais ampla pode te ajudar a chegar \u00e0 raiz dos problemas.<\/li><li>Visualize seu fluxo de trabalho como ele \u00e9 hoje (n\u00e3o como voc\u00ea desejaria que fosse) e me\u00e7a sua efici\u00eancia de fluxo.<\/li><li>Tente limitar seu trabalho em progresso e avalie como est\u00e1 sendo o comportamento durante algumas semanas.<\/li><\/ul>\n\n\n\n<p>E voc\u00eas, j\u00e1 possuem a pr\u00e1tica de medir o fluxo? Caso sim, como tem sido a experi\u00eancia? Vou deixar abaixo algumas refer\u00eancias e, caso tenha se interessado pelo assunto, compartilhe conosco nos coment\u00e1rios ou nos encaminhe por email:&nbsp;<a href=\"mailto:contagil@plataformatec.com.br\">contagil@plataformatec.com.br<\/a>. At\u00e9 breve! \ud83d\ude00<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"refer\u00eancias\">Refer\u00eancias<\/h4>\n\n\n\n<ul><li>Actionable Agile Metrics for Predictability: An Introduction by Daniel S. Vacanti . Page 34.<\/li><li><a href=\"https:\/\/mysoftwarequality.wordpress.com\/2014\/12\/03\/the-resource-utilisation-paradox-on-why-less-is-more\/\">The resources utilization paradox<\/a>;<\/li><li><a href=\"https:\/\/www.youtube.com\/watch?v=CostXs2p6r0\">The resources utilization trap<\/a>;<\/li><li><a href=\"https:\/\/leankanban.com\/flow-efficiency-a-great-metric-you-probably-arent-using\/\">Flow efficiency &#8211; A great metric you probably aren\u2019t using.<\/a><\/li><\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Muitas pessoas gestoras gostam de falar de produtividade e assertividade. \u201cQuando minha demanda estar\u00e1 pronta?\u201d, \u201cComo ajudar meu time a entregar mais?\u201d, s\u00e3o perguntas recorrentes em algumas organiza\u00e7\u00f5es. Um dos significados de produtividade diz respeito \u00e0 capacidade de gerar resultados. Em muitos casos, acredita-se que para aument\u00e1-la \u00e9 necess\u00e1rio maximizar a utiliza\u00e7\u00e3o de recursos de &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/08\/pare-de-medir-sua-equipe-meca-o-fluxo\/\">\u00bb<\/a><\/p>\n","protected":false},"author":80,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9244"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/80"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9244"}],"version-history":[{"count":6,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9244\/revisions"}],"predecessor-version":[{"id":9254,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9244\/revisions\/9254"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9244"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9244"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9244"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}