{"id":9476,"date":"2019-10-30T12:21:48","date_gmt":"2019-10-30T15:21:48","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9476"},"modified":"2019-10-30T14:17:56","modified_gmt":"2019-10-30T17:17:56","slug":"extraindo-previsibilidade-a-partir-do-story-mapping","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/10\/extraindo-previsibilidade-a-partir-do-story-mapping\/","title":{"rendered":"Extraindo previsibilidade \u00e0 partir do Story Mapping"},"content":{"rendered":"\n<p>Anteriormente, vimos neste&nbsp;<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/08\/vamos-falar-sobre-story-mapping\/\" target=\"_blank\">blogpost do Felipe Gimenes<\/a>, o passo a passo de como criar um <em>Story Mapping<\/em> desde o levantamento ou cria\u00e7\u00e3o do seu fluxo de valor at\u00e9 o fatiamento dos itens de trabalho identificados em entregas objetivas, as chamadas Releases. Parece que o trabalho acabou n\u00e3o \u00e9? Ser\u00e1 mesmo? E se ainda assim te perguntassem: \u201cBonito, mas afinal, quando voc\u00eas entregam?\u201d<\/p>\n\n\n\n<p>Neste blogpost vou mostrar a voc\u00eas como gerar previsibilidade para o <em>Story Mapping<\/em> a partir das m\u00e9tricas. Bora l\u00e1?<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"recapitulando-o-burnup\">Recapitulando o Burnup<\/h2>\n\n\n\n<p>Primeiro, vamos falar brevemente sobre o gr\u00e1fico de <em>Burnup<\/em>, a m\u00e9trica que iremos utilizar como ferramenta.<br>O <em>Burnup<\/em> permite acompanhar o progresso e o montante de trabalho conclu\u00eddo versus o tamanho total de um escopo de trabalho, fazendo uma proje\u00e7\u00e3o linear baseada no hist\u00f3rico de produtividade do time. Atrav\u00e9s dele, podemos ter uma no\u00e7\u00e3o do qu\u00e3o pr\u00f3ximo ou distante estamos de atingir um objetivo, ou seja, o popular \u201cquanto falta para terminar o projeto\u201d.<\/p>\n\n\n\n<p>A leitura deste gr\u00e1fico \u00e9 feita da seguinte forma:<\/p>\n\n\n\n<ul><li>No eixo vertical temos duas representa\u00e7\u00f5es gr\u00e1ficas, sendo a primeira a quantidade de novos itens inseridos no <em>backlog<\/em> do projeto\/produto, representado pela \u00e1rea colorida (neste caso, em amarelo), e a segunda a quantidade de itens deste <em>backlog<\/em> que foram finalizadas pelo time, representado pelas barras verticais sequenciais;<\/li><li>E no eixo horizontal temos uma escala de tempo para visualizar o crescimento dos valores descritos no eixo vertical (neste caso medido em semanas).<\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/i.imgur.com\/dRTxVxP.png\" alt=\"Burnup-plataformatec\"\/><\/figure>\n\n\n\n<p>Ou seja, conseguimos aqui acompanhar tanto o crescimento do <em>backlog<\/em> semana a semana quanto o valor de&nbsp;<em>throughputs<\/em>&nbsp;acumulados que o time vem entregando.<\/p>\n\n\n\n<p>Dados estes valores, podemos projetar tr\u00eas diferentes cen\u00e1rios:<\/p>\n\n\n\n<ul><li><strong>O Pessimista<\/strong>: projetar a performance futura da equipe com base no menor <em>Throughput<\/em> hist\u00f3rico;<\/li><li><strong>O Mais prov\u00e1vel<\/strong>: considerar que a equipe ter\u00e1 no futuro um comportamento semelhante ao <em>Throughput<\/em> \u201cm\u00e9dio\u201d performado;<\/li><li><strong>O Otimista<\/strong>: considerar que a equipe performar\u00e1 nas pr\u00f3ximas semanas igual ao valor de maior <em>Throughput<\/em> hist\u00f3rico ja registrado pelo time.<\/li><\/ul>\n\n\n\n<p>Caso queira se aprofundar um pouco mais sobre Throughput e Burnup, recomendo a leitura&nbsp;<a href=\"http:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-throughput-e-graficos-burnup\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">deste blogpost do Raphael Albino<\/a>. Agora vamos unir os assuntos!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"e-o-que-o-story-mapping-tem-a-ver-com-isso\">E o que o story mapping tem a ver com isso?<\/h2>\n\n\n\n<p>Uma das etapas finais do <em>story mapping<\/em>, \u00e9 fatiar o <em>backlog<\/em> levantado em objetivos menores e que em um curto prazo j\u00e1 podem entregar valor ao usu\u00e1rio final ou persona cujo problema estamos tentando resolver. Segue um exemplo onde foram definidos os tr\u00eas primeiros objetivos e abaixo o <em>backlog<\/em> n\u00e3o priorizado (imagem desfocada para preservar a confidencialidade dos dados).<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/i.imgur.com\/l1AzuaG.jpg\" alt=\"\"\/><\/figure>\n\n\n\n<p>Dado que n\u00f3s j\u00e1 temos as fatias de entregas mapeadas, e se ao inv\u00e9s de incluirmos o <em>backlog<\/em> levantado como uma \u00fanica <em>stack<\/em> dentro do nosso <em>Burnup<\/em>, utilizarmos do mesmo artif\u00edcio de fatiamento e criarmos as vis\u00f5es de entrega de cada release?<br>Basicamente n\u00f3s temos a seguinte vis\u00e3o:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/i.imgur.com\/MwctlVF.png\" alt=\"\"\/><\/figure>\n\n\n\n<p>Cada fatia entra individualmente como uma por\u00e7\u00e3o de <em>backlog<\/em> isolada. Como a leitura deste gr\u00e1fico \u00e9 feita de baixo para cima, logo, a primeira fatia do <em>Story Mapping<\/em> (a que est\u00e1 no topo e representa o primeiro objetivo de entrega), vir\u00e1 acima do objetivo atual do time (representado pela por\u00e7\u00e3o azul do <em>Burnup<\/em>), e assim sucessivamente, conforme a indica\u00e7\u00e3o das setas.<br>Podemos observar que \u00e9 poss\u00edvel obter hip\u00f3teses de data de entrega, pessimista, prov\u00e1vel e otimista, para cada uma das fatias do nosso <em>Burnup<\/em>, esteja o time j\u00e1 trabalhando nelas ou n\u00e3o. Com isso, torna-se poss\u00edvel setar ou controlar expectativas com pessoas que t\u00eam interesse no projeto ou em uma entrega, tanto de forma interna (para o pr\u00f3prio time) como externa (ex: Um patrocinador do projeto).<\/p>\n\n\n\n<p>Munindo o time com estas informa\u00e7\u00f5es, a equipe ser\u00e1 capaz de assumir estrat\u00e9gias melhor direcionadas de acordo com a necessidade. Ex: Negociar escopo caso seja necess\u00e1rio cumprir uma data de entrega espec\u00edfica ou alinhar estrat\u00e9gias de lan\u00e7amento de um produto dadas as perspectivas de finaliza\u00e7\u00e3o do trabalho que est\u00e1 em vista.<br>Por\u00e9m, existem alguns pontos que devemos ter aten\u00e7\u00e3o quando utilizamos o <em>burnup<\/em> como ferramenta de previsibilidade, vamos ver a seguir.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"premissas-que-impactam-diretamente-as-estimativasprevisibilidade\">Premissas que impactam diretamente as estimativas\/previsibilidade<\/h2>\n\n\n\n<ul><li>As datas de proje\u00e7\u00e3o consideram o tamanho atual do <em>backlog<\/em> e a vaz\u00e3o do time dentro de uma linearidade. \u00c0 medida que estes valores avan\u00e7am, estas datas tamb\u00e9m sofrer\u00e3o altera\u00e7\u00e3o (Ex: um crescimento no <em>backlog<\/em> ou uma mudan\u00e7a dr\u00e1stica no padr\u00e3o de entregas do time);<\/li><li>Mantenha os valores de <em>throughput<\/em> utilizados para a proje\u00e7\u00e3o sempre atualizados. \u00c9 sempre importante considerar a realidade do time em rela\u00e7\u00e3o \u00e0 cad\u00eancia de entregas para se ter previsibilidade. Afinal, n\u00e3o faz muito sentido eu projetar estimativas de entrega considerando um padr\u00e3o de comportamento que n\u00e3o condiz mais com a realidade do time, certo?<\/li><li>Se o time ainda n\u00e3o possuir um hist\u00f3rico de <em>throughput<\/em> relacionado ao projeto, o ideal seria coletar esta m\u00e9trica durante algumas semanas para utilizar estes dados como insumo antes de criar-se a expectativa com datas e prazos. Caso seja de fato necess\u00e1rio ter esta ideia de prazo para pelo menos se ter uma perspectiva do quando a entrega seria feita, pode-se utilizar do hist\u00f3rico de outros projetos que o time ja trabalhou. Por\u00e9m, \u00e9 preciso levar em considera\u00e7\u00e3o diversas vari\u00e1veis que impactam diretamente na assertividade em utilizar estes valores passados (tais como tamanho da equipe, se a composi\u00e7\u00e3o do time \u00e9 a mesma, tecnologias utilizadas, experi\u00eancias que o time tem neste tipo de projeto, etc.<\/li><li>Sinalize corretamente a qual releases cada tarefa pertence. \u00c9 muito importante que cada uma das tarefas do <em>backlog<\/em> esteja enquadrada dentro do objetivo ao qual ela pertence, n\u00e3o s\u00f3 para as tarefas que foram originadas no <em>story mapping<\/em> mas tamb\u00e9m para todas as demais que podem surgir ao longo do caminho devido a processos como o <em>Refining<\/em> ou <em>task splitting<\/em>;<\/li><\/ul>\n\n\n\n<p>Como as datas de proje\u00e7\u00e3o\/previsibilidade de entrega s\u00e3o extremamente sens\u00edveis, conforme vimos nas premissas acima, minha dica final \u00e9&nbsp;<strong>fuja de utilizar estas datas como prazos determinantes<\/strong>&nbsp;e utilize como probabilidades de cen\u00e1rios (Ex: Se tudo der certo e nada diferente do habitual acontecer, temos boas chances de entregar por volta do dia DD\/MM, mas \u00e9 esperado que seja perto de DD\/MM (de acordo com as linhas de proje\u00e7\u00e3o).<br>Desta forma, caso algo inesperado ou emergencial aconte\u00e7a, o time consegue responder de forma adequada sem comprometer fortemente as expectativas geradas sobre as entregas.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"resumindo\">Resumindo<\/h2>\n\n\n\n<p>Utilizando estas duas ferramentas em conjunto, conseguimos ter de forma mais concreta um cen\u00e1rio de previsibilidade que pode ajudar o time a setar expectativas com quaisquer <em>stakeholders<\/em> que estejam dependentes destas entregas ou possuem algum tipo de interesse sobre elas. Al\u00e9m disso, as pr\u00f3prias pessoas do time ter\u00e3o uma maior sensa\u00e7\u00e3o de progresso em rela\u00e7\u00e3o aos objetivos que elas mesmas mapearam e isso os ajudar\u00e1 a tomar melhores decis\u00f5es ao longo do tempo.<br>Esta \u00e9 apenas uma das formas de obtermos melhor previsibilidade das entregas do time. Existem diversas outras ferramentas que podem ajudar tamb\u00e9m, como o&nbsp;<em><a href=\"http:\/\/blog.plataformatec.com.br\/2019\/09\/how-to-manage-deadlines-in-agile-environments-get-to-know-the-reality-check-tool\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Reality Check<\/a><\/em>&nbsp;\ud83d\ude42<\/p>\n\n\n\n<p>O que achou desta abordagem? Deixe aqui seu coment\u00e1rio sobre como voc\u00ea trata previsibilidade de entregas dentro do seu time ou nos escreva enviando para&nbsp;<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"mailto:contagil@plataformatec.com.br\" target=\"_blank\">contagil@plataformatec.com.br<\/a>. Caso queira come\u00e7ar a utilizar o <em>Burnup<\/em>, n\u00f3s disponibilizamos uma vers\u00e3o gratuitamente atrav\u00e9s da&nbsp;<a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"http:\/\/pages.plataformatec.com.br\/planilha-metricas-com-treinamento\" target=\"_blank\">Planilha de m\u00e9tricas da Plataformatec.<\/a>&nbsp;\ud83d\ude42<\/p>\n\n\n\n<p>Abra\u00e7os e at\u00e9 a pr\u00f3xima!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Anteriormente, vimos neste&nbsp;blogpost do Felipe Gimenes, o passo a passo de como criar um Story Mapping desde o levantamento ou cria\u00e7\u00e3o do seu fluxo de valor at\u00e9 o fatiamento dos itens de trabalho identificados em entregas objetivas, as chamadas Releases. Parece que o trabalho acabou n\u00e3o \u00e9? Ser\u00e1 mesmo? E se ainda assim te perguntassem: &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/10\/extraindo-previsibilidade-a-partir-do-story-mapping\/\">\u00bb<\/a><\/p>\n","protected":false},"author":76,"featured_media":9479,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/10\/extraindo-previsibilidade-a-partir-do-story-mapping.jpg","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9476"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/76"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9476"}],"version-history":[{"count":8,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9476\/revisions"}],"predecessor-version":[{"id":9486,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9476\/revisions\/9486"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media\/9479"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9476"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9476"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9476"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}