{"id":6285,"date":"2017-05-04T11:35:44","date_gmt":"2017-05-04T14:35:44","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6285"},"modified":"2017-05-04T17:07:58","modified_gmt":"2017-05-04T20:07:58","slug":"user-story-em-desenvolvimento-foi-despriorizada","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/05\/user-story-em-desenvolvimento-foi-despriorizada\/","title":{"rendered":"A user story em desenvolvimento foi despriorizada, e agora?"},"content":{"rendered":"<p>Digamos que voc\u00ea tenha um quadro kanban como o seguinte:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/05\/card-flow-e1493907975371.png\" alt=\"Kanban\" width=\"400\" height=\"268\" class=\"aligncenter size-full wp-image-6286\" style=\"border:none;\" \/><\/p>\n<p>Ent\u00e3o, no meio do seu sprint, o P.O. descobre que as features D e E foram lan\u00e7adas por um concorrente e que voc\u00eas est\u00e3o perdendo usu\u00e1rios por isso. Pensando nisso, a P.O. decide despriorizar a hist\u00f3ria C. Isso seria apenas um exemplo de como um card pode ser despriorizado no meio do seu desenvolvimento. Mas, e agora, o que acontece com a hist\u00f3ria C?<\/p>\n<p>Para responder isso, deixe-me fazer um paralelo com uma companhia de perfumes a base de \u00e1lcool.<\/p>\n<p>Na coluna de backlog, a companhia tem a garrafa pronta mas sem flu\u00eddo algum. Quando a garrafa come\u00e7a a ser enchida, o card \u00e9 passado para &#8220;in progress&#8221;. Ap\u00f3s a garrafa estar cheia, ela \u00e9 lacrada e o card vai para &#8220;done&#8221;.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/05\/perfume-flow-e1493908094223.png\" alt=\"Perfume flow\" width=\"400\" height=\"275\" class=\"aligncenter size-full wp-image-6287\" style=\"border:none;\" \/><\/p>\n<p>O que acontece ent\u00e3o se outro perfume tem sua prioridade elevada a um n\u00edvel maior do que o que est\u00e1 sendo abastecido? Bom, como sabemos, flu\u00eddos com base em \u00e1lcool s\u00e3o vol\u00e1teis e, com o tempo, evamporam totalmente, sendo necess\u00e1rio que se reabaste\u00e7a o recipiente.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/05\/perfume-flow-volatile-e1493908131534.png\" alt=\"Perfume flow volatile\" width=\"400\" height=\"567\" class=\"aligncenter size-full wp-image-6288\" style=\"border:none;\" \/><\/p>\n<p>O mesmo acontece com uma hist\u00f3ria e seu c\u00f3digo. Com o tempo, o c\u00f3digo que comp\u00f5e tal hist\u00f3ria se torna obsoleto e desnecess\u00e1rio, perdendo o valor que tinha outrora. Neste caso, o que fazer com a hist\u00f3ria despriorizada depende dos seguintes pontos:<\/p>\n<ul>\n<li><strong>Quanto tempo a hist\u00f3ria C continuar\u00e1 no mesmo est\u00e1gio?<\/strong>\n<ul>\n<li>Se a hist\u00f3ria permanece muito tempo no mesmo est\u00e1gio, alguma parte do trabalho j\u00e1 feito pode se tornar desnecess\u00e1rio, portanto, voc\u00ea poderia apenas remov\u00ea-la da coluna e coloc\u00e1-la de volta ao backlog, j\u00e1 que algum refinamento pode ser necess\u00e1rio para que essa hist\u00f3ria seja desenvolvida novamente.<\/li>\n<li>Se a hist\u00f3ria vai ficar por um curto per\u00edodo de tempo em tal coluna, voc\u00ea pode optar por deix\u00e1-la l\u00e1 e, quando sua hora chegar, pode continuar aproveitando o que j\u00e1 havia sido desenvolvido.<\/li>\n<\/ul>\n<\/li>\n<li><strong>Qual o valor que a hist\u00f3ria C vai gerar quando pronta?<\/strong><br \/>\nDigamos que o retorno gerado pelo desenvolvimento de tal feature seja pequeno. Ser\u00e1 que vale a pena pausar seu desenvolvimento e ter o risco de investir ainda mais dinheiro no seu desenvolvimento em outro momento? O retorno gerado ser\u00e1 maior do que o tempo total de desenvolvimento gasto?<\/p>\n<\/li>\n<\/ul>\n<p>Para que isso seja verdade, o seguinte precisa acontecer (observado na imagem abaixo):<\/p>\n<ul>\n<li>$ gasto com o desenvolvimento inicial + $ gasto com o resto do desenvolvimento &lt; retorno da hist\u00f3ria C\n<ul>\n<li>A quantia gasta com o resto do desenvolvimento aumentar\u00e1 com o tempo, j\u00e1 que o desenvolvimento feito anteriormente vai perdendo valor.<\/li>\n<\/ul>\n<\/li>\n<li>Caso o retorno seja menor do que o gasto, \u00e9 melhor ignorar a funcionalidade. No entanto estes c\u00e1lculos n\u00e3o s\u00e3o t\u00e3o simples como parecem&#8230; Voc\u00ea precisa levar em conta riscos, aumento na receita, aumento no n\u00famero de usu\u00e1rios, etc&#8230; Ent\u00e3o tenha cuidado com essa a\u00e7\u00e3o.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/05\/chart-1024x768.png\" alt=\"Gr\u00e1ficos\" width=\"1024\" height=\"768\" class=\"aligncenter size-large wp-image-6289\" style=\"border:none;max-width: 99%;\" \/><\/p>\n<p>Portanto, baseado no que j\u00e1 foi dito, voc\u00ea pode ter as seguintes a\u00e7\u00f5es a respeito do card C:<\/p>\n<ul>\n<li><strong>Mantenha-o na coluna &#8220;in progress&#8221; e recomece o trabalho quando sua prioridade for retomada<\/strong><br \/>\nEssa pausa ser\u00e1 r\u00e1pida e n\u00e3o afetar\u00e1 o desenvolvimento da feature. Neste caso \u00e9 importante deixar vis\u00edvel de alguma forma no quadro que essa hist\u00f3ria est\u00e1 &#8220;bloqueada&#8221; por motivos de prioriza\u00e7\u00e3o.<\/p>\n<\/li>\n<li>\n<p><strong>Ponha-o na coluna de backlog novamente, e recomece quando necess\u00e1rio<\/strong><br \/>\nA pausa ser\u00e1 longa e o card precisar\u00e1 de um novo refinamento.<\/p>\n<\/li>\n<li>\n<p><strong>Termine-o primeiro, antes de come\u00e7ar outra hist\u00f3ria<\/strong><br \/>\nO card est\u00e1 quase pronto e, caso voc\u00ea pare seu desenvolvimento, quando pronto, seu valor ser\u00e1 menor do que o gasto no seu desenvolvimento.<\/p>\n<\/li>\n<li>\n<p><strong>Cancele o seu desenvolvimento<\/strong><br \/>\nA hist\u00f3ria est\u00e1 muito longe de ser terminada, e seu valor final \u00e9 muito pequeno para pagar o tempo que ela ficar\u00e1 pausada.<\/p>\n<\/li>\n<\/ul>\n<p>\u00c9 importante tamb\u00e9m notar que isso N\u00c3O deve ser algo comum em seu processo. Se coisas como essa est\u00e3o acontecendo frequentemente, voc\u00ea pode precisar melhorar suas prioriza\u00e7\u00f5es!<\/p>\n<p>O que acha do que foi discutido aqui? Deixe seus coment\u00e1rios abaixo! \ud83d\ude42<\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/ebook-como-lidar-com-prazos-em-projetos-de-software?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=ebook-como-lidar-com-prazos&#038;utm_content=cta-blog-post-bottom\" target=_blank\"\"><br \/>\n<img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos.jpg\" alt=\"Como lidar com prazo em projetos de software [e-book gratuito]\" width=\"831\" height=\"147\" class=\"aligncenter size-full wp-image-6158\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos.jpg 831w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos-300x53.jpg 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/03\/CTA-blog-ebook-como-lidar-com-prazos-768x136.jpg 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><br \/>\n<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Digamos que voc\u00ea tenha um quadro kanban como o seguinte: Ent\u00e3o, no meio do seu sprint, o P.O. descobre que as features D e E foram lan\u00e7adas por um concorrente e que voc\u00eas est\u00e3o perdendo usu\u00e1rios por isso. Pensando nisso, a P.O. decide despriorizar a hist\u00f3ria C. Isso seria apenas um exemplo de como um &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/05\/user-story-em-desenvolvimento-foi-despriorizada\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[261,166,260,15],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6285"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6285"}],"version-history":[{"count":16,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6285\/revisions"}],"predecessor-version":[{"id":6307,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6285\/revisions\/6307"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6285"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6285"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6285"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}