{"id":7330,"date":"2018-03-19T14:08:55","date_gmt":"2018-03-19T17:08:55","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7330"},"modified":"2018-03-19T14:32:54","modified_gmt":"2018-03-19T17:32:54","slug":"o-desafio-de-analisar-a-maturidade-agil-de-uma-empresa","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/03\/o-desafio-de-analisar-a-maturidade-agil-de-uma-empresa\/","title":{"rendered":"O desafio de analisar a maturidade \u00e1gil de uma empresa"},"content":{"rendered":"<p>Ao participar de eventos, rodas de discuss\u00e3o e reuni\u00f5es com os clientes da Plataformatec, tenho observado que as empresas est\u00e3o buscando saber o qu\u00e3o \u00e1gil elas s\u00e3o. Investimentos em capacita\u00e7\u00f5es, consultorias e contrata\u00e7\u00f5es est\u00e3o sendo feitos, por\u00e9m, as empresas est\u00e3o com dificuldade em ter visibilidade dos impactos que a cultura \u00e1gil tem trazido para o neg\u00f3cio (em outras palavras, resultado).<\/p>\n<p>O discurso de que a agilidade torna o neg\u00f3cio eficaz (saber priorizar as iniciativas corretamente) e eficiente (ter um fluxo de trabalho e um ferramental que permitam entregas constantes e com qualidade) faz sentido desde que acompanhe uma perspectiva econ\u00f4mica (utilizar da maneira mais otimizada os recursos escassos da organiza\u00e7\u00e3o). A combina\u00e7\u00e3o dessas tr\u00eas perspectivas \u00e9 o que chamo de uma &#8220;gest\u00e3o efetiva&#8221; que habilita a forma\u00e7\u00e3o de um ambiente de excel\u00eancia.<\/p>\n<p>N\u00e3o existe um consenso sobre o qu\u00e3o agilmente madura uma organiza\u00e7\u00e3o est\u00e1. Algumas pessoas s\u00e3o contra medir o n\u00edvel de maturidade de uma equipe ou empresa, pois creem que o \u00e1gil \u00e9 um tipo de disciplina dif\u00edcil de sintetizar em uma m\u00e9trica. A comunidade Kanban tem divulgado um modelo de maturidade chamado\u00a0<a href=\"https:\/\/www.fincalabs.com\/wp-content\/uploads\/2017\/12\/KMM_CommunityRelease_2.pdf\" rel=\"nofollow\">Kanban Maturity Model<\/a>, que tem como premissa desenvolver nas organiza\u00e7\u00f5es a capacidade de:<\/p>\n<ul>\n<li>Criar um ambiente que promova a agilidade organizacional;<\/li>\n<li>Aliviar a sobrecarga de trabalho;<\/li>\n<li>Atender as expectativas dos clientes;<\/li>\n<li>Gerar resultados econ\u00f4micos previs\u00edveis e uma robustez financeira;<\/li>\n<li>Desenvolver uma capacidade de sobreviv\u00eancia.<\/li>\n<\/ul>\n<p>A seguir, gostaria de compartilhar um modelo que tenho utilizado para analisar o n\u00edvel de compet\u00eancia, capacidade e maestria em \u00e1gil nas empresas.<\/p>\n<h2><a id=\"user-content-afinal-de-contas-o-que-significa-ser-\u00e1gil\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-03-o-desafio-de-analisar-a-maturidade-agil.md#afinal-de-contas-o-que-significa-ser-%C3%A1gil\" aria-hidden=\"true\"><\/a><strong>Afinal de contas, o que significa ser \u00e1gil?<\/strong><\/h2>\n<p>Em uma frase, resumiria agilidade como:\u00a0<em>&#8220;entregar pequenos lotes, em curtos espa\u00e7os de tempo a fim de validar hip\u00f3teses de neg\u00f3cio, reduzir riscos e responder com rapidez \u00e0s mudan\u00e7as de mercado&#8221;<\/em>.<\/p>\n<p>Elaborando um pouco mais a defini\u00e7\u00e3o, ser \u00e1gil constitui desenvolver capacidades que ofere\u00e7am agilidade ao neg\u00f3cio. Considerando empresas digitais, \u00e9 como se a tecnologia e os processos de trabalho criassem um ambiente no qual fosse poss\u00edvel entregar pequenos experimentos dentro de um curto espa\u00e7o de tempo, a fim de provar hip\u00f3teses que gerem efici\u00eancia operacional, aumentem a capacidade de gera\u00e7\u00e3o nas receitas atuais, e propiciem inova\u00e7\u00f5es nos produtos e nos processos organizacionais.<\/p>\n<p>Tal defini\u00e7\u00e3o exige que a empresa seja agn\u00f3stica a metodologias, frameworks, cren\u00e7as e pr\u00e1ticas milagrosas. Se voc\u00ea acredita que a partir de um ferramental encantador seu ambiente se tornar\u00e1 \u00e1gil, sinto lhe dizer que isso n\u00e3o vai acontecer. Sobre esse assunto, recomendo fortemente a leitura do texto do meu amigo Lucas sobre o\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2016\/12\/nos-nao-somos-necessariamente-ageis-mas-com-certeza-somos-ageis\/\" rel=\"nofollow\">porqu\u00ea n\u00f3s n\u00e3o somos necessariamente \u00c1geis, mas com certeza somos \u00e1geis<\/a>.<\/p>\n<p>Considero que uma cultura \u00e1gil \u00e9 constru\u00edda dentro de uma empresa a partir da combina\u00e7\u00e3o de um alto alinhamento e um alto empoderamento.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-7331\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/empoderamento_alinhamento_blog_post.png\" alt=\"\" width=\"943\" height=\"562\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/empoderamento_alinhamento_blog_post.png 967w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/empoderamento_alinhamento_blog_post-300x179.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/empoderamento_alinhamento_blog_post-768x457.png 768w\" sizes=\"(max-width: 943px) 100vw, 943px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Alinhamento quer dizer que a empresa e seus l\u00edderes est\u00e3o plenamente conscientes de onde desejam chegar e conseguem comunicar tal vis\u00e3o de forma clara, objetiva e que engaje a todos. Uma lideran\u00e7a participativa e ferramentas como os\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\/\" rel=\"nofollow\">OKRs<\/a>\u00a0s\u00e3o excelentes alavancas para desenvolver um ecossistema onde as pessoas estejam\u00a0<strong>alinhadas<\/strong>.<\/p>\n<p>O empoderamento \u00e9 a soma da\u00a0<strong>habilidade<\/strong>\u00a0(que nada mais \u00e9 do que a capacidade das pessoas conseguirem executar a estrat\u00e9gia da organiza\u00e7\u00e3o a partir de ferramentas, t\u00e9cnicas e pr\u00e1ticas) com\u00a0<strong>autonomia<\/strong>\u00a0(que \u00e9 a capacidade das pessoas se adaptarem e se auto organizarem).<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-7332\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/visa_sistemica_blog_post-1024x152.png\" alt=\"\" width=\"1024\" height=\"152\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/visa_sistemica_blog_post-1024x152.png 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/visa_sistemica_blog_post-300x44.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/visa_sistemica_blog_post-768x114.png 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/visa_sistemica_blog_post.png 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Para que a empresa usufrua dos benef\u00edcios da agilidade \u00e9 fundamental que ela desenvolva uma vis\u00e3o sist\u00eamica do neg\u00f3cio a partir de 4 macro etapas. Partindo do pressuposto que os recursos s\u00e3o limitados, torna-se necess\u00e1ria uma an\u00e1lise da viabilidade financeira das iniciativas nas quais a empresa trabalhar\u00e1, a fim de tomar melhores decis\u00f5es a partir das oportunidades que podem ser perdidas pela manuten\u00e7\u00e3o do status quo.<\/p>\n<p>Ap\u00f3s filtrar as iniciativas com a lente estrat\u00e9gica, a empresa precisa compreender se ela possui capacidade operacional para executar o que foi definido como prioridade. Neste momento, a empresa pode cogitar a contrata\u00e7\u00e3o de terceiros, a capacita\u00e7\u00e3o da sua equipe interna ou at\u00e9 mesmo um redesenho da sua estrutura com o prop\u00f3sito de criar c\u00e9lulas capazes de construir solu\u00e7\u00f5es que comprovem as hip\u00f3teses de neg\u00f3cio.<\/p>\n<p>Os dois \u00faltimos est\u00e1gios seriam a execu\u00e7\u00e3o e a entrega. Saber executar com\u00a0<a href=\"http:\/\/blog.plataformatec.com.br\/2017\/08\/metricas-ageis-o-que-lead-time-fala-sobre-seu-projeto\/\" rel=\"nofollow\">lead times<\/a>\u00a0curtos far\u00e1 com que a empresa valide rapidamente suas suposi\u00e7\u00f5es e tenha aptid\u00e3o para mudar de rota quando necess\u00e1rio. Por fim, entregar bem representa disponibilizar o que o cliente precisa com qualidade e rapidez (ex: deploys automatizados, integra\u00e7\u00f5es cont\u00ednuas, testes de integra\u00e7\u00e3o etc.) e com o m\u00ednimo de ru\u00eddo interno (comunicando os stakeholders da empresa impactados pela entrega da iniciativa) e externo (garantindo que as informa\u00e7\u00f5es cheguem de forma clara aos clientes e usu\u00e1rios).<\/p>\n<h2><a id=\"user-content-um-modelo-para-analisar-a-maturidade-\u00e1gil-de-uma-organiza\u00e7\u00e3o\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-03-o-desafio-de-analisar-a-maturidade-agil.md#um-modelo-para-analisar-a-maturidade-%C3%A1gil-de-uma-organiza%C3%A7%C3%A3o\" aria-hidden=\"true\"><\/a><strong>Um modelo para analisar a maturidade \u00e1gil de uma organiza\u00e7\u00e3o<\/strong><\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-7333\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/maturidade_blog_post.png\" alt=\"\" width=\"633\" height=\"553\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/maturidade_blog_post.png 633w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/03\/maturidade_blog_post-300x262.png 300w\" sizes=\"(max-width: 633px) 100vw, 633px\" \/><\/p>\n<p>O modelo que venho utilizando para analisar a profici\u00eancia em \u00e1gil das organiza\u00e7\u00f5es leva em considera\u00e7\u00e3o 4 perspectivas:<\/p>\n<h3><a id=\"user-content-pr\u00e1ticas-e-pap\u00e9is\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-03-o-desafio-de-analisar-a-maturidade-agil.md#pr%C3%A1ticas-e-pap%C3%A9is\" aria-hidden=\"true\"><\/a><strong>Pr\u00e1ticas e pap\u00e9is<\/strong><\/h3>\n<p>Esta dimens\u00e3o tem como objetivo compreender se a empresa tem utilizado de forma eficiente os processos e se h\u00e1 clareza dos pap\u00e9is e das respectivas responsabilidades. Geralmente utilizo as seguintes perguntas para analisar esta dimens\u00e3o:<\/p>\n<ul>\n<li>Existe clareza de quais s\u00e3o as responsabilidades dos pap\u00e9is dispon\u00edveis na empresa atualmente?<\/li>\n<li>O fluxo de trabalho das equipes est\u00e1 vis\u00edvel?<\/li>\n<li>As equipes possuem pol\u00edticas expl\u00edcitas (ex: defini\u00e7\u00e3o de pronto para ser trabalhado, defini\u00e7\u00e3o de pronto etc.)?<\/li>\n<li>Gargalos e filas est\u00e3o vis\u00edveis no fluxo de trabalho das equipes?<\/li>\n<li>As equipes possuem clareza das principais fontes de retrabalho?<\/li>\n<li>Pr\u00e1ticas de engenharia de software est\u00e3o sendo utilizadas para manter o c\u00f3digo saud\u00e1vel?<\/li>\n<li>O processo de publica\u00e7\u00e3o est\u00e1 automatizado?<\/li>\n<li>Existem testes automatizados?<\/li>\n<\/ul>\n<h3><a id=\"user-content-m\u00e9tricas\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-03-o-desafio-de-analisar-a-maturidade-agil.md#m%C3%A9tricas\" aria-hidden=\"true\"><\/a>M\u00e9tricas<\/h3>\n<p>Este aspecto visa compreender em qual n\u00edvel a empresa tem utilizado as m\u00e9tricas de neg\u00f3cio e de processo. A ess\u00eancia dessa perspectiva \u00e9 ir contra a ideia de que m\u00e9tricas moldam comportamento, mas sim refor\u00e7ar a import\u00e2ncia de se desenvolver uma refer\u00eancia comum que promova melhoria e a\u00e7\u00f5es para o neg\u00f3cio. As perguntas que uso para esta dimens\u00e3o s\u00e3o:<\/p>\n<ul>\n<li>As m\u00e9tricas de neg\u00f3cio est\u00e3o sendo utilizadas no processo de tomada de decis\u00e3o?<\/li>\n<li>As m\u00e9tricas de neg\u00f3cio est\u00e3o vis\u00edveis para todas as pessoas da empresa analisarem?<\/li>\n<li>As m\u00e9tricas de neg\u00f3cio s\u00e3o utilizadas como refer\u00eancia no processo de defini\u00e7\u00e3o de uma iniciativa (ex: quais indicadores de neg\u00f3cio ser\u00e3o alavancados pelo projeto X)?<\/li>\n<li>As equipes utilizam m\u00e9tricas de processo para projetar prazos de entrega?<\/li>\n<li>As equipes utilizam m\u00e9tricas de processo para analisarem a sa\u00fade do processo?<\/li>\n<\/ul>\n<h3><a id=\"user-content-prioriza\u00e7\u00e3o-orientada-ao-neg\u00f3cio\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-03-o-desafio-de-analisar-a-maturidade-agil.md#prioriza%C3%A7%C3%A3o-orientada-ao-neg%C3%B3cio\" aria-hidden=\"true\"><\/a>Prioriza\u00e7\u00e3o orientada ao neg\u00f3cio<\/h3>\n<p>Quando tudo \u00e9 prioridade nada \u00e9 prioridade. Essa \u00e9 uma frase que tenho utilizado com equipes que t\u00eam o desafio de gerenciar o portf\u00f3lio de iniciativas de uma empresa. Esta dimens\u00e3o serve como guia para entender se de fato h\u00e1 um processo estruturado de prioriza\u00e7\u00e3o e para isso levanto as seguintes informa\u00e7\u00f5es:<\/p>\n<ul>\n<li>Existem crit\u00e9rios claros de prioriza\u00e7\u00e3o?<\/li>\n<li>A prioriza\u00e7\u00e3o tem levado em considera\u00e7\u00e3o as necessidades dos clientes?<\/li>\n<li>As m\u00e9tricas de neg\u00f3cio s\u00e3o utilizadas no processo de prioriza\u00e7\u00e3o das iniciativas?<\/li>\n<li>\u00c9 realizada uma an\u00e1lise das depend\u00eancias entre as iniciativas antes da finaliza\u00e7\u00e3o do processo de prioriza\u00e7\u00e3o?<\/li>\n<\/ul>\n<h3><a id=\"user-content-resultado-financeiro\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-03-o-desafio-de-analisar-a-maturidade-agil.md#resultado-financeiro\" aria-hidden=\"true\"><\/a>Resultado financeiro<\/h3>\n<p>esta dimens\u00e3o tem por objetivo compreender em qual n\u00edvel a empresa tem mensurado os resultados financeiros das suas iniciativas. Levanto as seguintes informa\u00e7\u00f5es para analisar este aspecto nas empresas:<\/p>\n<ul>\n<li>A lideran\u00e7a da organiza\u00e7\u00e3o tem clareza dos objetivos de neg\u00f3cio de cada iniciativa?<\/li>\n<li>As equipes est\u00e3o metrificando o resultado financeiro das entregas?<\/li>\n<li>A organiza\u00e7\u00e3o consegue classificar as iniciativas quanto ao resultado esperado (ex: essa iniciativa gerar\u00e1 maior efici\u00eancia no neg\u00f3cio, ajudar\u00e1 a conquistar market share, ser\u00e1 uma inova\u00e7\u00e3o, antecipar\u00e1 o custo do atraso?)<\/li>\n<\/ul>\n<p>O modelo acima ajudar\u00e1 voc\u00ea a diagnosticar em cada uma das dimens\u00f5es qual \u00e9 a situa\u00e7\u00e3o atual e se existem problemas que precisam ser tratados.<\/p>\n<p>Tenho observado que uma empresa madura em \u00e1gil \u00e9 aquela que consegue ter:<\/p>\n<ol>\n<li>Uma gest\u00e3o de fluxo eficiente, isto \u00e9, que tenha dom\u00ednio das pr\u00e1ticas e dos processos;<\/li>\n<li>Saiba priorizar a partir de crit\u00e9rios quantitativos (m\u00e9tricas);<\/li>\n<li>Tenha consci\u00eancia dos riscos e utilize um ferramental para reduzi-los;<\/li>\n<li>Entenda as necessidades do cliente e as transformem em oportunidades vi\u00e1veis;<\/li>\n<li>Disponha de uma estrutura flex\u00edvel e orientada por prop\u00f3sitos;<\/li>\n<li>Respeite as individualidades das pessoas e saiba comunicar de forma clara suas responsabilidades (alinhamento de expectativas).<\/li>\n<\/ol>\n<h2><a id=\"user-content-conclus\u00e3o\" class=\"anchor\" href=\"https:\/\/github.com\/plataformatec\/blog-posts\/blob\/master\/2018-03-o-desafio-de-analisar-a-maturidade-agil.md#conclus%C3%A3o\" aria-hidden=\"true\"><\/a>Conclus\u00e3o<\/h2>\n<p>Tentei compartilhar um pouco como n\u00f3s da Plataformatec temos levado agilidade para os nossos clientes. A proposta do modelo \u00e9 ser algo evolucion\u00e1rio e que respeite o contexto de cada empresa. Buscamos identificar alavancas que permitir\u00e3o gerar um ambiente onde haja agilidade no neg\u00f3cio. E voc\u00ea, como tem analisado a maturidade em \u00e1gil no seu contexto? Deixe sua opini\u00e3o nos coment\u00e1rios abaixo.<\/p>\n<div style=\"background-color: #fffdf9; border: 1px solid #e9af35; margin: 32px 0; padding: 22px 24px; font-family: sans-serif;\">\n<h3 style=\"font-size: 1.5em; line-height: 1.5em; margin-top: 0em !important;\">Curso: M\u00e9tricas para Projetos Agile<\/h3>\n<p style=\"margin-top: 0.5em !important;\">Um <strong>curso gratuito<\/strong>, em 7 e-mails, em que Raphael Albino, autor do livro &#8220;M\u00e9tricas \u00c1geis&#8221;, ensina o que medir e como interpretar os dados.<\/p>\n<p><a style=\"background: #e9af35; border: none; color: #fff; font-size: 12px; line-height: 1.5; margin-top: 5px; padding: 8px 16px; text-align: center; text-decoration: none; letter-spacing: 0.1em;\" href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=curso-metricas-agile&amp;utm_content=cta-blog-post-bottom\" target=\"_blank\" rel=\"noopener\">INSCREVA-SE GRATUITAMENTE<\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Ao participar de eventos, rodas de discuss\u00e3o e reuni\u00f5es com os clientes da Plataformatec, tenho observado que as empresas est\u00e3o buscando saber o qu\u00e3o \u00e1gil elas s\u00e3o. Investimentos em capacita\u00e7\u00f5es, consultorias e contrata\u00e7\u00f5es est\u00e3o sendo feitos, por\u00e9m, as empresas est\u00e3o com dificuldade em ter visibilidade dos impactos que a cultura \u00e1gil tem trazido para o &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/03\/o-desafio-de-analisar-a-maturidade-agil-de-uma-empresa\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,263],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7330"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7330"}],"version-history":[{"count":3,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7330\/revisions"}],"predecessor-version":[{"id":7336,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7330\/revisions\/7336"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7330"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7330"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7330"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}