{"id":7964,"date":"2018-11-12T15:37:01","date_gmt":"2018-11-12T17:37:01","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7964"},"modified":"2018-11-13T16:00:30","modified_gmt":"2018-11-13T18:00:30","slug":"conquistando-melhoria-continua-atraves-de-retrospectivas-ludicas","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/11\/conquistando-melhoria-continua-atraves-de-retrospectivas-ludicas\/","title":{"rendered":"Conquistando Melhoria Cont\u00ednua Atrav\u00e9s de Retrospectivas L\u00fadicas"},"content":{"rendered":"<p>H\u00e1 alguns anos atr\u00e1s, quando tive os meus primeiros contatos pr\u00e1ticos com os m\u00e9todos \u00e1geis, conheci e participei pela primeira vez (como ouvinte) de um famoso evento do universo \u00e1gil: <strong>Retrospectivas<\/strong>. Ap\u00f3s duas horas de reuni\u00e3o, entendi (equivocadamente, por sinal) que essa reuni\u00e3o tinha dois grandes objetivos: escutar as pessoas elogiando algumas caracter\u00edsticas da \u00faltima entrega do projeto e &#8220;lavar roupa suja&#8221; (reclama\u00e7\u00f5es).<\/p>\n<p>Ao sair da reuni\u00e3o, comentei com um amigo mais experiente sobre o formato deste encontro e, at\u00e9 hoje, lembro o que eu conclu\u00ed do que ele me disse: <strong>Retrospectiva s\u00f3 funciona bem quando \u00e9 conduzida adequadamente, e isso dificilmente acontece<\/strong>.<\/p>\n<p>Mas ser\u00e1 que boas Retrospectivas realmente s\u00e3o dif\u00edceis de acontecer?<\/p>\n<h2>A ideia original<\/h2>\n<p>No <a href=\"https:\/\/www.scrumguides.org\/docs\/scrumguide\/v2017\/2017-Scrum-Guide-Portuguese-Brazilian.pdf\" target=\"_blank\" rel=\"noopener\">Guia do Scrum<\/a>\u00a0(vers\u00e3o de Novembro de 2017), mantido e desenvolvido por Ken Schwaber e Jeff Sutherland, h\u00e1 as <strong>explica\u00e7\u00f5es de como a Retrospectiva da Sprint deve acontecer<\/strong>. Segundo os autores, este evento serve como uma oportunidade para o Time Scrum inspecionar a si pr\u00f3prio, bem como para a cria\u00e7\u00e3o de um plano de melhorias a serem aplicadas durante a Sprint seguinte. Al\u00e9m disso, eles afirmam que o Scrum Master deve garantir que este evento aconte\u00e7a de forma positiva e produtiva.<\/p>\n<p>Eu concordo 100% com eles! E hoje, com mais experi\u00eancia em m\u00e9todos \u00e1geis, tive oportunidades de participar deste evento de maneiras mais adequadas. Por\u00e9m, no in\u00edcio da minha viv\u00eancia com a agilidade, nem todas as Retrospectivas eram interessantes e atingiam os objetivos propostos no <a href=\"https:\/\/www.scrumguides.org\/docs\/scrumguide\/v2017\/2017-Scrum-Guide-Portuguese-Brazilian.pdf\" target=\"_blank\" rel=\"noopener\">Guia do Scrum<\/a>.<\/p>\n<h2>A viv\u00eancia me presenteou com novos formatos de Retrospectivas<\/h2>\n<p>Aqui na <a href=\"http:\/\/www.plataformatec.com.br\" target=\"_blank\" rel=\"noopener\">Plataformatec<\/a>\u00a0costumamos trabalhar com diversos m\u00e9todos, frameworks e modelos de trabalho relacionados com agilidade. E, durante essa minha jornada, tive a oportunidade de conduzir v\u00e1rias reuni\u00f5es de Retrospectiva (n\u00e3o necessariamente por Sprint, mas tamb\u00e9m em outras escalas de tempo que faziam sentido para o projeto). Entre as mais diversas maneiras e formatos (algumas at\u00e9 com times alocados em outro pa\u00eds), gostei muito de uma em especial, da qual tenho chamado de <strong>Retrospectiva L\u00fadica<\/strong>.<\/p>\n<p>Essa proposta de Retrospectiva envolve uma caracter\u00edstica que facilita muito a condu\u00e7\u00e3o deste tipo de evento: <strong>desenhos!<\/strong> Sim: cen\u00e1rios, monstros, obst\u00e1culos, personagens, etc. <strong>O que a sua criatividade permitir representar de situa\u00e7\u00f5es do time e do projeto<\/strong>.<\/p>\n<p>Veja um <strong>exemplo real<\/strong> (algumas informa\u00e7\u00f5es da imagem foram ofuscadas por quest\u00f5es de confidencialidade):<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7968 \" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/11\/PtecBlog_Post-Exemplo-Retrospectiva_Lu\u0301dica-1024x810.jpg\" alt=\"\" width=\"646\" height=\"511\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/11\/PtecBlog_Post-Exemplo-Retrospectiva_Lu\u0301dica-1024x810.jpg 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/11\/PtecBlog_Post-Exemplo-Retrospectiva_Lu\u0301dica-300x237.jpg 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/11\/PtecBlog_Post-Exemplo-Retrospectiva_Lu\u0301dica-768x607.jpg 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/11\/PtecBlog_Post-Exemplo-Retrospectiva_Lu\u0301dica.jpg 2018w\" sizes=\"(max-width: 646px) 100vw, 646px\" \/><\/p>\n<p>Na proposta acima, h\u00e1 alguns pontos que visam atingir um objetivo espec\u00edfico. No caso deste projeto, est\u00e1vamos trabalhando no desenvolvimento de um novo produto e acredit\u00e1vamos na necessidade de avaliar um per\u00edodo maior do projeto. Logo, a proposta foi avaliar todo o per\u00edodo, desde o in\u00edcio dos trabalhos, a atualidade e, obviamente, as melhorias para o futuro.Cada membro do time p\u00f4de colocar <strong>somente 1 post-it por se\u00e7\u00e3o<\/strong> (exceto na parte 7). Naquele momento est\u00e1vamos em 9 pessoas no projeto e, como eu estava facilitando a din\u00e2mica, n\u00e3o participei inserindo post-its. A ideia de limitar em 1 cart\u00e3o por pessoa se sustenta em quatro fatores:<\/p>\n<ul>\n<li><strong>1:<\/strong> Trabalhar com o time a quest\u00e3o de <strong>priorizar<\/strong>, de forma individual, o coment\u00e1rio mais importante;<\/p>\n<\/li>\n<li>\n<p><strong>2:<\/strong> Conceder o mesmo &#8220;peso&#8221; de <strong>import\u00e2ncia<\/strong> para cada membro do time;<\/p>\n<\/li>\n<li>\n<p><strong>3:<\/strong> Por quest\u00f5es de <strong>organiza\u00e7\u00e3o estrutural<\/strong> da din\u00e2mica;<\/p>\n<\/li>\n<li>\n<p><strong>4:<\/strong> Para n\u00e3o ultrapassar o <em>time box<\/em> proposto para o time (combinamos realizar a Retrospectiva em, no m\u00e1ximo, 02 horas &#8211; e fizemos em 1:45).<\/p>\n<\/li>\n<\/ul>\n<p>Tamb\u00e9m \u00e9 poss\u00edvel perceber que o desenho deste exemplo <strong>apresenta um trajeto<\/strong>, que come\u00e7a em Maio de 2017 (m\u00eas de in\u00edcio do desenvolvimento t\u00e9cnico do produto) e termina em algum momento do futuro (quando a equipe atingiria o objetivo atual do projeto). No caso, a gente realizou essa Retrospectiva L\u00fadica em algum dia do m\u00eas de Novembro de 2017. A inspira\u00e7\u00e3o para este formato surgiu da minha paix\u00e3o por jogos e videogames (um caminho com obst\u00e1culos e, no final, um &#8220;chef\u00e3o&#8221; para vencer). A proposta era simular o modelo cl\u00e1ssico de jogos de aventura para toda a equipe. Dependendo do projeto que voc\u00ea estiver, ele pode realmente ser uma aventura, n\u00e3o?<\/p>\n<p>Agora vamos para os detalhes deste exemplo de Retrospectiva L\u00fadica (seguindo as numera\u00e7\u00f5es colocadas na imagem):<\/p>\n<ul>\n<li><strong>1:<\/strong> A Retrospectiva come\u00e7ou com cada membro do time respondendo \u00e0 seguinte pergunta: <strong>Qual a principal caracter\u00edstica que define este time?<\/strong>. O objetivo era entender como os membros do time se enxergavam na empresa e, de certa forma, compreender o motivo de todos n\u00f3s estarmos desenvolvendo aquele produto em especial. Na sequ\u00eancia, a gente <strong>debateu o conte\u00fado de cada cart\u00e3o fixado na lousa<\/strong>;<\/li>\n<\/ul>\n<p><strong>Obs.:<\/strong> n\u00e3o era necess\u00e1rio identificar nominalmente quem havia escrito cada cart\u00e3o. Por\u00e9m, na minha opini\u00e3o, a identifica\u00e7\u00e3o n\u00e3o criaria nenhum problema para a din\u00e2mica. Essa observa\u00e7\u00e3o vale para todas as partes desta Retrospectiva.<\/p>\n<ul>\n<li><strong>2:<\/strong> Na segunda parte, cada membro do time respondeu: <strong>Qual foi o maior desafio que a gente enfrentou at\u00e9 este momento do projeto?<\/strong> Ou, em outras palavras: <strong>Qual o maior obst\u00e1culo que o time superou?<\/strong>. No caso, esta parte foi representada por um muro quebrado. Depois de cada membro registrar seu coment\u00e1rio, n\u00f3s debatemos novamente cada item apresentado na lousa. O objetivo desta etapa era <strong>encontrar alguma li\u00e7\u00e3o aprendida para o time<\/strong>, bem como lembrar os principais desafios j\u00e1 superados pela equipe (agregando na percep\u00e7\u00e3o de progresso do projeto);<\/p>\n<\/li>\n<li>\n<p><strong>3<\/strong>: A seguir, trabalhamos com o seguinte questionamento: <strong>Qual foi nossa principal conquista desde o in\u00edcio do projeto?<\/strong>. O principal objetivo deste momento \u00e9 lembrar os objetivos atingidos, tudo aquilo que conseguimos conquistar at\u00e9 este momento do projeto. \u00c9 muito comum, inclusive, que as conquistas estejam relativamente atreladas com os desafios (se\u00e7\u00e3o 2). Por fim, debatemos e celebramos cada conquista registrada nos post-its;<\/p>\n<\/li>\n<li>\n<p><strong>4<\/strong>: A quarta parte desta din\u00e2mica \u00e9 parecida com a primeira, por\u00e9m, com um contexto mais individual. Uma auto-cr\u00edtica positiva, de certa forma. A pergunta deste momento foi: <strong>N\u00f3s ainda teremos mais desafios para vencer no projeto. Qual o seu &#8220;super poder&#8221; que ajudar\u00e1 o time a ultrapassar novas barreiras?&#8221;<\/strong>. Ou, se preferir, tamb\u00e9m pode ser: <strong>Qual a sua caracter\u00edstica mais marcante (aquela que todos lembram quando falam de voc\u00ea)<\/strong>?<\/p>\n<\/li>\n<\/ul>\n<p>O objetivo deste momento \u00e9 lembrar como <strong>nossos talentos conseguem influenciar diretamente nos resultados do projeto<\/strong>. Interessante que, neste dia, alguns membros do time simplesmente passaram um risco no post-it, ou seja, n\u00e3o quiseram realizar uma auto-cr\u00edtica. Percebendo isso, outros membros da equipe se posicionaram e ajudaram essas pessoas a escolherem um talento de destaque, o que acabou causando um clima muito agrad\u00e1vel de elogios e reconhecimentos (mas confesso que isso n\u00e3o foi planejado).<\/p>\n<p><strong>Obs.:<\/strong> em qualquer momento desta Retrospectiva, os membros do time podiam marcar um risco no post-it e, com isso, n\u00e3o declararem nenhuma informa\u00e7\u00e3o para a respectiva parte. No caso, essa situa\u00e7\u00e3o ocorreu muito pouco conosco.<\/p>\n<ul>\n<li><strong>5<\/strong>: Logo a seguir, a gente focou na seguinte situa\u00e7\u00e3o: <strong>Qual ser\u00e1 nosso maior desafio para conseguir entregar os objetivos do projeto?<\/strong> Ou: <strong>Qual o &#8220;monstro&#8221; que a gente precisar\u00e1 vencer?<\/strong>. Um resultado interessante que obtivemos foi a repeti\u00e7\u00e3o de uma mesma situa\u00e7\u00e3o, o que refor\u00e7ou a necessidade de atuarmos naquele assunto. Eles(as) poderiam colocar, por exemplo, um desafio t\u00e9cnico, um medo, uma incerteza, enfim, algo que poderia ser \u201cassustador\u201d para o projeto. Isso nos ajudou muito a planejar nossos pr\u00f3ximos passos como uma equipe;<\/p>\n<\/li>\n<li>\n<p><strong>6<\/strong>: Esta parte focou no seguinte ponto: nossos super poderes (parte 4) e nossas caracter\u00edsticas (parte 1) <strong>s\u00e3o o suficiente para conseguirmos vencer esse monstro (parte 5)?<\/strong> Partindo desta pergunta, cada membro p\u00f4de <strong>colocar um plano de a\u00e7\u00e3o<\/strong>, um item a ser feito para que a equipe consiga derrotar o monstro identificado, bem como para superar os potenciais futuros desafios do projeto. Para facilitar, voc\u00ea tamb\u00e9m pode aproveitar este momento da Retrospectiva e realizar duas perguntas b\u00e1sicas: &#8220;Temos algo para fazer?&#8221; &#8220;O que podemos melhorar?&#8221;<\/p>\n<\/li>\n<\/ul>\n<p>Essas seis partes deste exemplo de Retrospectiva L\u00fadica fecham a proposta e o formato da din\u00e2mica. No contexto de organiza\u00e7\u00e3o e l\u00f3gica estrutural, \u00e9 poss\u00edvel perceber que as partes:<br \/>\n&#8211; <strong>2 e 3<\/strong> trataram do <strong>passado<\/strong> do projeto;<br \/>\n&#8211; <strong>1 e 4<\/strong> observaram caracter\u00edsticas <strong>atuais<\/strong> (presente) da equipe;<br \/>\n&#8211; <strong>5 e 6<\/strong> apresentaram potenciais situa\u00e7\u00f5es do <strong>futuro<\/strong> do projeto.<\/p>\n<p>Por\u00e9m, os t\u00f3picos apresentados podem n\u00e3o cobrir todos os temas necess\u00e1rios para serem debatidos naquele momento do projeto. Portanto, h\u00e1 a \u00faltima parte (n\u00famero <strong>7<\/strong>) da din\u00e2mica, representada pelos bal\u00f5ezinhos de pensamento acima do desenho da equipe (ao lado da parte 1). Nesse momento, os membros do time <strong>podiam escrever o que desejassem<\/strong> (fora do contexto da Retrospectiva L\u00fadica, e tanto pontos positivos quanto situa\u00e7\u00f5es que precisavam ser melhoradas). Alguns exemplos: problemas na comunica\u00e7\u00e3o, quest\u00f5es envolvendo a prioriza\u00e7\u00e3o das demandas, bom desempenho da equipe, entre outros.<\/p>\n<p>Por fim, ap\u00f3s <strong>debatermos os pontos encontrados na parte 7<\/strong>, n\u00f3s conclu\u00edmos a din\u00e2mica.<\/p>\n<h2>Mas este formato de Retrospectiva sempre funciona?<\/h2>\n<p>N\u00e3o posso afirmar que sempre ir\u00e1 funcionar, pois depende de v\u00e1rios contextos relacionados ao projeto. Posso citar algumas caracter\u00edsticas desta equipe que, na minha opini\u00e3o, ajudaram no sucesso deste exemplo de Retrospectiva L\u00fadica:<\/p>\n<ul>\n<li><strong>1:<\/strong> \u00c9ramos uma equipe bem estruturada, com todos os pap\u00e9is definidos e presentes ativamente no time. Logo, t\u00ednhamos v\u00e1rias vis\u00f5es diferentes sobre os problemas, bem como diversos tipos de habilidades. Portanto, apenas 1 post-it por pessoa (em cada se\u00e7\u00e3o) ajudou a englobar muitos pontos de vista;<\/li>\n<li><strong>2:<\/strong> Tivemos, ao longo dos 6 meses avaliados na Retrospectiva, apenas duas mudan\u00e7as de pessoas, o que facilitou muito para o time atingir uma maturidade de trabalho em equipe e auto-organiza\u00e7\u00e3o. \u00c9 prov\u00e1vel que avaliar um per\u00edodo extenso de tempo n\u00e3o seja muito interessante para equipes que tiveram muitas mudan\u00e7as de pessoas alocadas;<\/li>\n<li><strong>3:<\/strong> N\u00f3s tamb\u00e9m t\u00ednhamos outra estrutura de Retrospectivas, uma que segu\u00edamos com periodicidade definida. Logo, essa proposta surgiu para agregar e <strong>sair um pouco da rotina<\/strong>, e n\u00e3o para substituir ou se tornar o formato padr\u00e3o;<\/li>\n<li><strong>4:<\/strong> Est\u00e1vamos em um momento muito bacana do projeto, no sentido de integra\u00e7\u00e3o, companheirismo e parceria. Isso provavelmente facilita a realiza\u00e7\u00e3o deste tipo de din\u00e2mica (talvez n\u00e3o funcionasse em alguma equipe com caracter\u00edsticas diferentes das quais eu mencionei).<\/li>\n<\/ul>\n<p>De qualquer maneira, acredito que voc\u00ea possa testar este modelo de Retrospectiva em seus projetos tamb\u00e9m. O principal objetivo desta proposta \u00e9 <strong>estruturar a extra\u00e7\u00e3o de informa\u00e7\u00f5es de uma forma l\u00fadica<\/strong>, onde, atrav\u00e9s de analogias (os desenhos), seja poss\u00edvel estimular o pensamento cr\u00edtico, bem como garantir a aten\u00e7\u00e3o dos membros do time durante toda a din\u00e2mica.<\/p>\n<p>O que achou desta proposta? Caso queira trocar experi\u00eancias, por favor, deixe seu coment\u00e1rio logo abaixo ou, se preferir, podemos iniciar um bate-papo por e-mail, atrav\u00e9s do endere\u00e7o henrique.oliveira@plataformatec.com.br.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>H\u00e1 alguns anos atr\u00e1s, quando tive os meus primeiros contatos pr\u00e1ticos com os m\u00e9todos \u00e1geis, conheci e participei pela primeira vez (como ouvinte) de um famoso evento do universo \u00e1gil: Retrospectivas. Ap\u00f3s duas horas de reuni\u00e3o, entendi (equivocadamente, por sinal) que essa reuni\u00e3o tinha dois grandes objetivos: escutar as pessoas elogiando algumas caracter\u00edsticas da \u00faltima &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/11\/conquistando-melhoria-continua-atraves-de-retrospectivas-ludicas\/\">\u00bb<\/a><\/p>\n","protected":false},"author":61,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7964"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7964"}],"version-history":[{"count":40,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7964\/revisions"}],"predecessor-version":[{"id":8006,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7964\/revisions\/8006"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7964"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7964"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7964"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}