{"id":7228,"date":"2018-02-28T10:38:50","date_gmt":"2018-02-28T13:38:50","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7228"},"modified":"2018-03-01T15:33:21","modified_gmt":"2018-03-01T18:33:21","slug":"ha-algo-de-errado-com-as-tecnicas-tradicionais-de-gestao-de-projetos","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/02\/ha-algo-de-errado-com-as-tecnicas-tradicionais-de-gestao-de-projetos\/","title":{"rendered":"H\u00e1 algo de errado com as t\u00e9cnicas &#8220;tradicionais&#8221; de gest\u00e3o de projetos?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Sem nenhuma enrola\u00e7\u00e3o, respondo com certa convic\u00e7\u00e3o: n\u00e3o! Mas fique tranquilo, caro leitor, n\u00e3o pretendo cair na armadilha de defender a t\u00e9cnica &#8220;tradicional&#8221; X ou a \u00e1gil Y neste texto, muito pelo contr\u00e1rio. Gostaria de incentiv\u00e1-lo a refletir sobre diversos julgamentos que podemos ter feito sobre t\u00e9cnicas que, em contextos n\u00e3o apropriados, podem parecer equivocadas e inapropriadas, mas que podem ser muito bem utilizadas quando mudamos uma outra vari\u00e1vel nos complexos ambientes corporativos: a estrutura organizacional dos projetos.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Eu sou, de certa forma, c\u00e9tico quanto aos resultados positivos que podemos alcan\u00e7ar quando afirmamos que tal ferramenta \u00e9 ruim, ou que ela n\u00e3o serve para projetos de software, ou at\u00e9 mesmo que est\u00e1 obsoleta. Talvez algumas estejam, de fato, desenquadradas, mas vamos avaliar com calma este tema.<\/span><\/p>\n<h2><b>Como sua empresa encara a responsabilidade nos projetos?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Quando comecei a trabalhar com gest\u00e3o de projetos em 2010, tive a oportunidade de conhecer e utilizar muitas t\u00e9cnicas consideradas, no meu ponto de vista, mais &#8220;tradicionais&#8221; (a presen\u00e7a das aspas nesta palavra n\u00e3o \u00e9 mero detalhe). Exemplos: cronogramas detalhados, gr\u00e1ficos de Gantt, planos extensos e complexos para diversas coisas, etc. Essas ferramentas s\u00e3o ruins? Prejudicam o projeto? Causam efeitos negativos? \u00c9 claro que as respostas para essas perguntas dependem de outros fatores, mas, em suma, a resposta \u00e9 simplesmente n\u00e3o. S\u00e3o t\u00e9cnicas que podem ser utilizadas quando necess\u00e1rias e, se foram documentadas como boas refer\u00eancias, \u00e9 porque causaram efeitos positivos em outras situa\u00e7\u00f5es. O detalhe \u00e9 que, atualmente, as empresas est\u00e3o se organizando de forma diferente do que est\u00e1vamos acostumados a observar tempos atr\u00e1s. Uma mudan\u00e7a significativa \u00e9 a aparente tend\u00eancia em horizontalizar os cargos e fun\u00e7\u00f5es, removendo toda aquela pesada estrutura hier\u00e1rquica.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Junto com a horizontaliza\u00e7\u00e3o, o que n\u00e3o significa, necessariamente, que n\u00e3o possa existir alguma hierarquia, encontramos a busca pelo empoderamento das pessoas e de suas respectivas participa\u00e7\u00f5es em processos de decis\u00e3o, principalmente no \u00e2mbito dos neg\u00f3cios. Logo, aquelas t\u00e9cnicas de gest\u00e3o de projetos que estavam presentes no antigo modelo de estrutura organizacional n\u00e3o servem para mais nada, certo? Errado! O problema estava em atrelar muita responsabilidade em um \u00fanico ator em toda essa hist\u00f3ria: o gerente de projetos, que muitas vezes estava atrelado com alguma hierarquia na estrutura organizacional. Talvez este papel n\u00e3o tivesse autoridade hier\u00e1rquica formal, mas, como geralmente estava respons\u00e1vel pelo projeto, algum tipo de poder era reconhecido (pelo menos no \u00e2mbito do projeto).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">N\u00e3o era comum voc\u00ea receber suas tarefas detalhadas, j\u00e1 programadas em que momento iria faz\u00ea-las, juntamente com um prazo e um plano a ser seguido? Pois \u00e9, esta \u00e9 a quest\u00e3o. Se o gerente de projetos era cobrado e responsabilizado por coisas que ele, muitas vezes, n\u00e3o tinha muita no\u00e7\u00e3o e\/ou conhecimento (dependia de outros pap\u00e9is para entender o que estava planejando), \u00e9 natural que ele tivesse vontade de tentar controlar a situa\u00e7\u00e3o. Mas n\u00e3o podemos, na minha opini\u00e3o, usar esse cen\u00e1rio para afirmar que as t\u00e9cnicas utilizadas por ele, para tentar obter algum controle, s\u00e3o inapropriadas.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">E se voc\u00ea tivesse participado da elabora\u00e7\u00e3o do cronograma? E se ele fosse constru\u00eddo de forma mais interativa e incremental? E se os planos que voc\u00ea leu tivessem voc\u00ea como um dos autores, juntamente com toda a equipe que trabalha com voc\u00ea? Ser\u00e1 que isso n\u00e3o teria mudado o final da hist\u00f3ria? Ou seja, ser\u00e1 que o contexto da estrutura organizacional, que refletiu na forma como as t\u00e9cnicas foram utilizadas, n\u00e3o influenciou sua opini\u00e3o sobre as t\u00e9cnicas utilizadas?<\/span><\/p>\n<h2><b>Eu posso comer aquela pizza?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Quando eu tinha oito anos de idade, tive de realizar uma opera\u00e7\u00e3o de remo\u00e7\u00e3o de ap\u00eandice (aquela parte do intestino que n\u00e3o serve para muita coisa). Um dia antes de passar mal e ser internado, eu comi pizza na casa de uma prima e, por isso, durante muitos anos, n\u00e3o tinha coragem de saborear aquelas maravilhas com borda de catupiry. Logo, acabei relacionando a pizza com a necessidade de operar. N\u00e3o estamos, n\u00f3s, associando boas ferramentas com estruturas organizacionais ultrapassadas?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Compare os seguintes modelos de estruturas organizacionais em projetos:<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-7229\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/02\/leadtime_histogram4-1-1024x412.png\" alt=\"\" width=\"1024\" height=\"412\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/02\/leadtime_histogram4-1-1024x412.png 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/02\/leadtime_histogram4-1-300x121.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/02\/leadtime_histogram4-1-768x309.png 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/02\/leadtime_histogram4-1.png 1048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">O desenho da esquerda representa uma estrutura de projetos mais equilibrada, onde a constru\u00e7\u00e3o das ideias \u00e9 conjunta e a responsabilidade sobre os resultados alcan\u00e7ados nos projetos \u00e9 compartilhada. A estrutura da direita envolve algum tipo de hierarquia e, por isso, \u00e9 natural que a responsabilidade sobre os resultados do projeto exer\u00e7a um peso maior sobre papeis com atribui\u00e7\u00f5es de gest\u00e3o e neg\u00f3cios, como um gerente de projetos, por exemplo. Ainda \u00e9 poss\u00edvel que, neste segundo modelo, as ideias sejam constru\u00eddas em conjunto, entretanto, h\u00e1 uma prov\u00e1vel tend\u00eancia para que isso n\u00e3o aconte\u00e7a. A estrutura da esquerda n\u00e3o reflete, necessariamente, uma organiza\u00e7\u00e3o que trabalha com holocracia, mas sim uma vis\u00e3o sobre as responsabilidades dentro de um projeto.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Logo, pe\u00e7o uma gentileza para voc\u00ea, leitor: avalie ambas as estruturas e reflita. Voc\u00ea acredita que uma t\u00e9cnica considerada &#8220;tradicional&#8221;, que ser\u00e1 utilizada na estrutura organizacional horizontalizada, ter\u00e1 o mesmo resultado e efeito quando utilizada na hier\u00e1rquica (onde a constru\u00e7\u00e3o das ideias tende a ser mais centralizada)? O problema da estrutura com hierarquias (formais ou informais) \u00e9 que ela fomenta comportamentos no estilo comando e controle, fazendo com que toda a experi\u00eancia e relev\u00e2ncia da equipe t\u00e9cnica n\u00e3o seja usada de forma apropriada durante a utiliza\u00e7\u00e3o das t\u00e9cnicas. Claro que este tipo de comportamento pode ser mais apropriado em outras esferas, como a militar, por exemplo, mas n\u00e3o acredito que seja adequado para trabalhos do conhecimento (software, produtos, marketing, design, etc.) devido ao dinamismo e \u00e0s constantes mudan\u00e7as que ocorrem em projetos dessas \u00e1reas.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ao utilizarmos t\u00e9cnicas consideradas mais &#8220;tradicionais&#8221; dentro de uma estrutura de projetos horizontalizada, \u00e9 muito prov\u00e1vel que iremos observar outros tipos de resultados. Ou seja, em seu pr\u00f3ximo projeto, arrisque comer aquela pizza de br\u00f3colis. Ela pode at\u00e9 parecer ruim, mas quem sabe voc\u00ea n\u00e3o se surpreende com o sabor dela?<\/span><\/p>\n<p><em>Este texto tamb\u00e9m faz parte da Cont\u00c1gil, nossa newsletter mensal com curadoria de conte\u00fado pela equipe da Plataformatec sobre\u00a0gerenciamento de projetos, metodologias e cultura \u00e1gil. Se voc\u00ea ainda n\u00e3o \u00e9 assinante, assine agora!\u00a0\ud83d\ude42<\/em><\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-6110\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png\" alt=\"\" width=\"831\" height=\"147\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil.png 831w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-300x53.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/02\/blog-cta-assinar-contagil-768x136.png 768w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sem nenhuma enrola\u00e7\u00e3o, respondo com certa convic\u00e7\u00e3o: n\u00e3o! Mas fique tranquilo, caro leitor, n\u00e3o pretendo cair na armadilha de defender a t\u00e9cnica &#8220;tradicional&#8221; X ou a \u00e1gil Y neste texto, muito pelo contr\u00e1rio. Gostaria de incentiv\u00e1-lo a refletir sobre diversos julgamentos que podemos ter feito sobre t\u00e9cnicas que, em contextos n\u00e3o apropriados, podem parecer equivocadas &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/02\/ha-algo-de-errado-com-as-tecnicas-tradicionais-de-gestao-de-projetos\/\">\u00bb<\/a><\/p>\n","protected":false},"author":61,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[1],"tags":[123,284],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7228"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7228"}],"version-history":[{"count":6,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7228\/revisions"}],"predecessor-version":[{"id":7245,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7228\/revisions\/7245"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7228"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7228"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7228"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}