{"id":6664,"date":"2017-09-05T18:41:51","date_gmt":"2017-09-05T21:41:51","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6664"},"modified":"2017-09-25T19:07:04","modified_gmt":"2017-09-25T22:07:04","slug":"dilemas-de-po-como-definir-okrs-em-equipes-ageis","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\/","title":{"rendered":"Dilemas de PO: como definir OKRs em equipes \u00e1geis"},"content":{"rendered":"<p>Continuando a <a href=\"http:\/\/blog.plataformatec.com.br\/?s=dilemas+de+po\">s\u00e9rie de posts referente aos dilemas da vida de gerentes de produto<\/a>, gostaria de compartilhar uma t\u00e9cnica para que voc\u00ea e a sua equipe possam se planejar melhor.<\/p>\n<p>\u00c9 comum no ambiente de equipes que trabalham com a constru\u00e7\u00e3o ou evolu\u00e7\u00e3o de produtos a necessidade da defini\u00e7\u00e3o de objetivos, a proje\u00e7\u00e3o de resultados esperados e o planejamento de entregas. Se voc\u00ea convive com tais desafios, confira a seguir uma din\u00e2mica na qual obtive \u00f3timos resultados no processo de concep\u00e7\u00e3o de OKRs.<\/p>\n<h2>O que \u00e9 OKR e para o que serve<\/h2>\n<p>Bom, antes de escrever sobre o assunto, vale a pena definir o <strong>termo OKR<\/strong>.<\/p>\n<p>Segundo defini\u00e7\u00e3o do pessoal da <a href=\"http:\/\/leanperformance.com\/pt-br\/okr\/o-que-e-okr\/\">Lean Performance<\/a>, OKR &#8212; do ingl\u00eas <em>Objectives and Key Results<\/em> &#8211;, utilizado no Silicon Valley por empresas como Google, Facebook, Linkedin, Intel etc, <strong>\u00e9 um <em>framework<\/em> para definir metas<\/strong>. Trata-se de um <strong>sistema simples para criar alinhamento e engajamento em torno de metas mensur\u00e1veis e din\u00e2micas<\/strong>, tipicamente definidas trimestralmente.<\/p>\n<p>OKRs s\u00e3o uma \u00f3tima forma das organiza\u00e7\u00f5es criarem e comunicarem objetivos e resultados. <strong>Seu maior prop\u00f3sito \u00e9 promover conex\u00e3o entre os objetivos da empresa, do time e dos indiv\u00edduos a partir de resultados mensur\u00e1veis, fazendo com que todos se movam na mesma dire\u00e7\u00e3o<\/strong>.<\/p>\n<p>Em resumo, utilizar OKRs adequadamente auxilia no aumento do alinhamento e do engajamento entre as pessoas, e torna o processo de planejamento estrat\u00e9gico mais \u00e1gil, com maior cad\u00eancia de revis\u00e3o, adapta\u00e7\u00e3o e participa\u00e7\u00e3o de toda a equipe.<\/p>\n<p>O alinhamento e engajamento entre as pessoas aumentam, pois o time passa a fazer parte do direcionamento do produto, gerando maior senso de pertencimento em cada um.<\/p>\n<p>Certa vez, no projeto de um dos nossos clientes, ap\u00f3s a equipe definir os OKRs, fui informado pelo QA que o bug que estava ocorrendo no ambiente de produ\u00e7\u00e3o iria impactar diretamente um dos OKRs, se n\u00e3o fosse corrigido imediatamente. Esse fato me deixou realmente surpreso, pois jamais veria uma a\u00e7\u00e3o assim se n\u00e3o compartilhassemos a responsabilidade com todo o time.<\/p>\n<p>Com a aplica\u00e7\u00e3o de OKRs, ganhamos mais uma ferramenta na prioriza\u00e7\u00e3o do backlog e, mais importante, temos o escopo direcionado para um objetivo comum.<\/p>\n<p>Ao aplicar din\u00e2micas de OKRs, espera-se que a empresa, equipe ou pessoa tenha em m\u00e3os:<\/p>\n<ol>\n<li><strong>Objetivos:<\/strong> Possuem, por ess\u00eancia, caracter\u00edstica qualitativa, inspiracional, com prazo definido e apontem para metas, ou seja, dizem para onde se deve ir.<\/li>\n<li><strong>Key results:<\/strong> Quantificam toda a ideia inspiracional. Devem ser ating\u00edveis, mensur\u00e1veis e realistas. Em outras palavras, indicam como ser\u00e1 poss\u00edvel atingir os objetivos.<\/li>\n<\/ol>\n<p><em>Beleza Raphael, entendi os conceitos e percebi que isso pode ser \u00fatil, mas voc\u00ea pode dar um exemplo?<\/em><\/p>\n<blockquote><p>\n  <strong>Objetivo:<\/strong> Aumentar o n\u00famero de clientes a partir de melhor experi\u00eancia de uso do aplicativo.<\/p>\n<p>  <strong>Per\u00edodo:<\/strong> Primeiro trimestre de 2017.<\/p>\n<p>  <strong>Key results:<\/strong><\/p>\n<ul>\n<li>Aumentar a taxa de convers\u00e3o mobile global de 5% (\u00faltimo trimestre de 2016) para 10%.<\/li>\n<li>Aumentar o volume de sess\u00f5es entrantes de 161 mil (\u00faltimo trimestre de 2016) para 240 mil.<\/li>\n<li>Vender 10.000 mil licen\u00e7as b\u00e1sicas.<\/li>\n<li>Vender 500 licen\u00e7as <em>premium<\/em>.<\/li>\n<\/ul>\n<\/blockquote>\n<p>De onde vamos tirar esses indicadores?<\/p>\n<p>Aqui vai um ponto importante: para definir bons <em>key results<\/em>, que sejam mensur\u00e1veis e reflitam a situa\u00e7\u00e3o real, <strong>\u00e9 essencial que a organiza\u00e7\u00e3o seja orientada a dados e indicadores<\/strong>. Basicamente, a empresa deve possuir m\u00e9tricas de produto que assegurem uma tomada de decis\u00e3o assertiva, dando a real no\u00e7\u00e3o de dire\u00e7\u00e3o e esfor\u00e7o; e n\u00e3o somente baseada em intui\u00e7\u00f5es e experi\u00eancias. Esses dados ajudam a definir as estrat\u00e9gias do pr\u00f3ximo per\u00edodo com maior seguran\u00e7a e a otimizar os recursos empreendidos.<\/p>\n<p>Os dados devem direcionar as seguintes quest\u00f5es:<\/p>\n<ul>\n<li>Quais desafios temos \u00e0 frente? Quais indicadores est\u00e3o ruins? O que devemos fazer para melhorar tal indicador? Ex: Diminuir o churn, aumentar prospects e leads, melhorar os processos operacionais etc.<\/li>\n<li>Qual frente do produto precisamos melhorar para atingir o objetivo X da organiza\u00e7\u00e3o?<\/li>\n<li>Quais riscos esses dados evidenciam e onde devemos manter a aten\u00e7\u00e3o?<\/li>\n<\/ul>\n<p>Feita essa introdu\u00e7\u00e3o, vamos para a din\u00e2mica de defini\u00e7\u00e3o dos OKRs para que voc\u00ea possa aplic\u00e1-la e aprimor\u00e1-la.<\/p>\n<h2>Parte 1 &#8211; Compreendendo o neg\u00f3cio<\/h2>\n<p>O primeiro t\u00f3pico a ser discutido diz respeito a revis\u00e3o ou cria\u00e7\u00e3o do modelo de neg\u00f3cios do produto.<\/p>\n<p>Baseado nas personas, a equipe poder\u00e1 analisar os canais, formatos de relacionamento com o cliente, fontes de receita, atividades chave, recursos chave, parceiros chave e estrutura de custo.<\/p>\n<p>Para levantar tais informa\u00e7\u00f5es, sugiro que voc\u00ea leve as seguintes perguntas:<\/p>\n<ul>\n<li>Personas: qual o perfil de clientes que utilizam o produto?<\/li>\n<li>Canais: como os clientes chegam ao produto, geralmente?<\/li>\n<li>Formatos de relacionamento: como ocorre o relacionamento dos usu\u00e1rios com o produto atualmente?<\/li>\n<li>Fontes de receita: quais s\u00e3o as fontes de receita atuais?<\/li>\n<li>Atividades chave: quais as principais atividades que precisam ser realizadas no dia a dia da opera\u00e7\u00e3o para que o produto possa entregar o valor que se prop\u00f5e?<\/li>\n<li>Recursos chave: o que o produto possui de diferencial competitivo?<\/li>\n<li>Parceiros chave: quais parceiros ajudam a empresa a viabilizar\/alavancar o produto?<\/li>\n<li>Custos: qual a estrutura necess\u00e1ria para tornar a opera\u00e7\u00e3o do produto vi\u00e1vel?<\/li>\n<\/ul>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-full wp-image-6668\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/business-model-canvas.png\" alt=\"Business model canvas\" width=\"763\" height=\"489\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/business-model-canvas.png 763w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/business-model-canvas-300x192.png 300w\" sizes=\"(max-width: 763px) 100vw, 763px\" \/><\/p>\n<p>Assim, a equipe ter\u00e1 maior clareza sobre o est\u00e1gio atual do produto. Caso o produto n\u00e3o possua um modelo de neg\u00f3cios, n\u00e3o deixe de desenvolver um. Uma dica de leitura para que voc\u00ea possa construir um \u00e9 o livro <a href=\"https:\/\/www.goodreads.com\/book\/show\/7723797-business-model-generation\">Business Model Generation<\/a>.<\/p>\n<p>Ap\u00f3s a revis\u00e3o do modelo de neg\u00f3cio, o pr\u00f3ximo passo ser\u00e1 analisar as principais m\u00e9tricas do produto. Cada pessoa da equipe poder\u00e1 explorar o produto a partir de:<\/p>\n<ul>\n<li>Informa\u00e7\u00f5es financeiras: churn, ticket m\u00e9dio, custo de aquisi\u00e7\u00e3o do cliente etc;<\/li>\n<li>Comportamento de acesso: n\u00famero de acessos, taxa de sa\u00edda, tempo despendido nas p\u00e1ginas do fluxo de venda, origem do tr\u00e1fego, dispositivo utilizado para acessar o fluxo de venda etc;<\/li>\n<li>Perfil do cliente: dados demogr\u00e1ficos, n\u00edvel de servi\u00e7o contratado, faixa et\u00e1ria etc.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-full wp-image-6669\" style=\"margin-right: 15px !important\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/dashboard_metricas.jpg\" alt=\"Exemplo de dashboard de produto\" width=\"300\" height=\"225\" align=\"left\" \/> A partir das m\u00e9tricas de produto, cada membro da equipe dever\u00e1 identificar pontos de melhoria e pontos onde o produto aparenta estar bem.<\/p>\n<div style=\"clear: both\"><\/div>\n<h2>Parte 2 &#8211; Definindo os OKRs<\/h2>\n<p>Feita a an\u00e1lise das m\u00e9tricas de neg\u00f3cio e do modelo de neg\u00f3cio, levante com a equipe os potenciais objetivos que ser\u00e3o trabalhados no per\u00edodo de tempo (exemplo: pr\u00f3ximo trimestre).<\/p>\n<p>Se voc\u00ea estiver facilitando a discuss\u00e3o, tenha em m\u00e3os as seguintes dicas antes da equipe determinar os objetivos:<\/p>\n<ul>\n<li>Tenha poucos objetivos (de 3 a 4). Motivo? O trimestre, por exemplo, \u00e9 curto para se assumir muitos objetivos.<\/li>\n<li>Relacione os objetivos do produto com os objetivos da empresa.<\/li>\n<li>Relacione os objetivos com problemas e necessidades reais.<\/li>\n<li>Utilize as m\u00e9tricas de neg\u00f3cio para definir os objetivos.<\/li>\n<\/ul>\n<p>Caso os objetivos levantados sejam complexos ou grandes, vale a pena fomentar discuss\u00f5es para que a equipe simplifique. O mantra que deve ser pensado aqui \u00e9: <strong>pequenos incrementos que geram valor econ\u00f4mico para o neg\u00f3cio.<\/strong><\/p>\n<p>Para medir os objetivos, a equipe dever\u00e1 elencar quais ser\u00e3o os <em>key results<\/em> que ser\u00e3o acompanhados ao longo do per\u00edodo. Para que a equipe tenha um norte:<\/p>\n<ul>\n<li>Defina poucos <em>key results<\/em> (de 3 \u00e0 4). Motivo? Se o objetivo precisa de muitos itens para ser medido \u00e9 prov\u00e1vel que ele seja complexo demais.<\/li>\n<li>Os <em>key results<\/em> devem ser expressos atrav\u00e9s de n\u00fameros.<\/li>\n<li>Quais resultados garantir\u00e3o que alcancemos nossos objetivos?<\/li>\n<\/ul>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-6670\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/okr_todos.png\" alt=\"Exemplo de OKRs definidos\" width=\"400\" height=\"300\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/okr_todos.png 400w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2017\/09\/okr_todos-300x225.png 300w\" sizes=\"(max-width: 400px) 100vw, 400px\" \/><\/p>\n<h2>Parte 3 &#8211; Definindo um roadmap<\/h2>\n<p>Dado que os objetivos e os <em>key results<\/em> est\u00e3o definidos, a equipe pode se questionar: <em>bom, e agora, o que vamos fazer para atingir nossos OKRs?<\/em><\/p>\n<p>Sugiro como \u00faltima parte da din\u00e2mica o desenvolvimento de um roadmap, a fim de identificar entreg\u00e1veis macro e quando eles dever\u00e3o ser entregues ao longo do per\u00edodo (ex: trimestre).<\/p>\n<p>T\u00e9cnicas de <em>brainstorming<\/em> e <em>story mapping<\/em> ajudam a ter uma ideia de cronologia e depend\u00eancia entre as poss\u00edveis funcionalidades que ser\u00e3o constru\u00eddas para alcan\u00e7ar os OKRs.<\/p>\n<p>Antes que algu\u00e9m me crucifique dizendo que n\u00e3o estou sendo <em>lean<\/em>, gostaria de deixar algo claro. O roadmap criado ser\u00e1 uma refer\u00eancia que COM CERTEZA (repita, <strong>C-O-M C-E-R-T-E-Z-A<\/strong>) sofrer\u00e1 altera\u00e7\u00f5es ao longo do tempo por conta das mudan\u00e7as e experimenta\u00e7\u00f5es que acontecer\u00e3o para atingir os objetivos e <em>key results<\/em> definidos.<\/p>\n<h2>Conclus\u00e3o<\/h2>\n<p>A estrutura de OKR pode ser replicada no n\u00edvel empresa, equipe e, at\u00e9 mesmo, indiv\u00edduo. Uma dica que sempre compartilho \u00e9: comece com poucos objetivos e trace em torno de 3 \u00e0 4 <em>key results<\/em>. O motivo? Foco. Quanto mais direcionado, mensur\u00e1vel e acion\u00e1vel for a sua estrutura de OKR, maiores ser\u00e3o as chances de alcan\u00e7ar o planejamento desenvolvido.<\/p>\n<p>Lembre-se que os OKRs devem ser revistos com frequ\u00eancia para que o time possa t\u00ea-los sempre em mente e, juntos, decidirem onde despender esfor\u00e7os para caminharem na dire\u00e7\u00e3o correta.<\/p>\n<p>\u00c9 essencial que a empresa possua uma cultura questionadora, desapegada de ferramentas e solu\u00e7\u00f5es revolucion\u00e1rias e tenha um ambiente que promova aprendizado com as falhas, pois certamente haver\u00e3o erros no in\u00edcio.<\/p>\n<p>A din\u00e2mica que apresentei teve como objetivo conectar neg\u00f3cio, resultados atuais e futuro (OKRs + funcionalidades).<\/p>\n<p>E voc\u00ea, como tem aplicado din\u00e2micas de OKR? Compartilhe os resultados e desafios.<\/p>\n<p>At\u00e9 pr\u00f3ximo dilema \ud83d\ude09<\/p>\n<p>Algumas refer\u00eancias: \ud83d\ude42<\/p>\n<ul>\n<li><a href=\"https:\/\/www.infoq.com\/br\/articles\/agile-goals-okr\">Metas \u00c1geis com OKR<\/a><\/li>\n<li><a href=\"http:\/\/eleganthack.com\/the-art-of-the-okr\/\">The Art of the OKR<\/a><\/li>\n<li><a href=\"https:\/\/medium.com\/startup-tools\/okrs-5afdc298bc28\">OKRs<\/a><\/li>\n<li><a href=\"https:\/\/www.slideshare.net\/HenrikJanVanderPol\/how-to-outperform-anyone-else-introduction-to-okr\">The Basics of OKR &#8211; Google&#8217;s Secret Sauce<\/a><\/li>\n<\/ul>\n<div style=\"background-color: #fffdf9;border: 1px solid #e9af35;margin: 32px 0;padding: 22px 24px;font-family: sans-serif\">\n<h3 style=\"font-size: 1.4em;line-height: 1.3em;margin-top: 0 !important\">M\u00e9tricas para Projetos Agile<\/h3>\n<p style=\"margin-top: 0.7em !important\"><strong>Curso gratuito em 7 e-mails<\/strong>, elaborado pelo autor do livro \u201cM\u00e9tricas \u00c1geis\u201d, Raphael Albino.<br \/>\n<small>Indicado para Agile Coach, Gerente de Produtos, Gerente de Projetos, Product Owner, Scrum Master e CTO\/CIO.<\/small><\/p>\n<p><a style=\"background: #e9af35;border: none;color: #fff;font-size: 12px;line-height: 1.5;margin-top: 5px;padding: 8px 16px;text-align: center;text-decoration: none;letter-spacing: 0.1em\" href=\"http:\/\/pages.plataformatec.com.br\/curso-metricas-para-projetos-agile?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=curso-metricas-agile&amp;utm_content=cta-blog-post-bottom\" target=\"_blank\" rel=\"noopener\">INSCREVA-SE GR\u00c1TIS<\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Continuando a s\u00e9rie de posts referente aos dilemas da vida de gerentes de produto, gostaria de compartilhar uma t\u00e9cnica para que voc\u00ea e a sua equipe possam se planejar melhor. \u00c9 comum no ambiente de equipes que trabalham com a constru\u00e7\u00e3o ou evolu\u00e7\u00e3o de produtos a necessidade da defini\u00e7\u00e3o de objetivos, a proje\u00e7\u00e3o de resultados &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2017\/09\/dilemas-de-po-como-definir-okrs-em-equipes-ageis\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,276,254,275,166,260],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6664"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6664"}],"version-history":[{"count":14,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6664\/revisions"}],"predecessor-version":[{"id":6767,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6664\/revisions\/6767"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6664"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6664"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6664"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}