{"id":9177,"date":"2019-07-31T15:29:25","date_gmt":"2019-07-31T18:29:25","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9177"},"modified":"2019-07-31T18:03:13","modified_gmt":"2019-07-31T21:03:13","slug":"estilos-de-lideranca-para-gestao-agil","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/07\/estilos-de-lideranca-para-gestao-agil\/","title":{"rendered":"Estilos de lideran\u00e7a para gest\u00e3o \u00e1gil"},"content":{"rendered":"<p>Para come\u00e7ar a pensar nisso, talvez a pergunta inicial seja: qual o papel de um agilista? Para mim o nosso papel \u00e9 servir o time, lider\u00e1-los, motiv\u00e1-los e influenci\u00e1-los para que eles possam desenvolver ao m\u00e1ximo suas capacidades.<\/p>\n<p>O <em>Scrum<\/em> possui o papel do <em>Scrum Master<\/em> para resolver bloqueios e ajudar o time a conduzir as cerim\u00f4nias. O guia \u00e1gil do PMI tem um cap\u00edtulo inteiro falando sobre lideran\u00e7a servidora. No Kanban, apesar de n\u00e3o termos explicitamente em seus princ\u00edpios o papel de um l\u00edder do processo, algu\u00e9m deve ajudar o time a organizar o fluxo e pensar nas melhorias.<\/p>\n<p>Na Plataformatec temos o papel do GPA (gerente de projetos \u00e1geis). Al\u00e9m do nosso foco em oferecer an\u00e1lise de m\u00e9tricas, facilitamos cerim\u00f4nias e pensamos na melhoria cont\u00ednua do sistema. Para isso, saber lidar com pessoas \u00e9 parte fundamental do trabalho.<\/p>\n<h3>Tipos de lideran\u00e7a<\/h3>\n<p>Existem algumas maneiras de pensar em lideran\u00e7a. Podemos ser ditadores ou democratas, podemos ter um poder oficial do nosso cargo ou um poder pelo fato do time nos reconhecer genuinamente como um l\u00edder.<\/p>\n<p>Pensando em ditadores ou democratas&nbsp;<a href=\"https:\/\/hbr.org\/1973\/05\/how-to-choose-a-leadership-pattern\" target=\"_blank\" rel=\"noopener noreferrer\">Robert Tannenbaum<\/a> prop\u00f5e uma escala de sete degraus entre um extremo e outro.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9181 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/68747470733a2f2f692e696d6775722e636f6d2f615276485471672e706e67.png\" alt=\"\" width=\"1242\" height=\"518\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/68747470733a2f2f692e696d6775722e636f6d2f615276485471672e706e67.png 1242w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/68747470733a2f2f692e696d6775722e636f6d2f615276485471672e706e67-300x125.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/68747470733a2f2f692e696d6775722e636f6d2f615276485471672e706e67-768x320.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/68747470733a2f2f692e696d6775722e636f6d2f615276485471672e706e67-1024x427.png 1024w\" sizes=\"(max-width: 1242px) 100vw, 1242px\" \/><\/p>\n<p>Eu particularmente acredito que o modelo democr\u00e1tico funciona melhor, por\u00e9m, entendo que adotar um comportamento de delegar totalmente pode n\u00e3o ser o ideal logo de in\u00edcio. Precisamos entender a maturidade do nosso time, talvez antes desses profissionais trabalharem conosco podem ter passado por locais e l\u00edderes que nunca lhes deram autonomia ou talvez o time ainda esteja no in\u00edcio de seu caminho para a autogest\u00e3o.<\/p>\n<p>Sugiro que comece no n\u00edvel 4 ou 5. Nosso papel \u00e9 ajudar o time a evoluir nessa escala, permita que gradualmente entendam a sua autonomia para cada situa\u00e7\u00e3o, o n\u00edvel de responsabilidade e permitindo que tomem suas pr\u00f3prias decis\u00f5es.<\/p>\n<p>Existe um outro vi\u00e9s de estudo que aborda como um l\u00edder se importa com a rela\u00e7\u00e3o pessoas X produtividade. \u00c9 um assunto relevante mas como nesse texto estamos focados em l\u00edderes servidores, vamos abordar isso em um pr\u00f3ximo post.<\/p>\n<h3>Como se empoderar para servir o seu time.<\/h3>\n<p>Como consultores, normalmente o nosso poder oficial \u00e9 fraco: n\u00e3o podemos contratar, demitir, punir, recompensar ou interferir nos sal\u00e1rios e benef\u00edcios das pessoas. Mas isso tamb\u00e9m pode ser a realidade do agilista \u201cda casa\u201d. Hoje em dia \u00e9 cada vez mais comum que sejamos um par do time.<\/p>\n<p>O cl\u00e1ssico \u201cfaz, porque eu t\u00f4 mandando\u201d, que j\u00e1 n\u00e3o se aplica mais a times auto-organiz\u00e1veis, \u00e9 impens\u00e1vel quando queremos ser l\u00edderes servidores. Assim, fica n\u00edtido que precisamos liderar conquistando a confian\u00e7a do time, mostrar que estamos buscando mudan\u00e7as para melhoria de todos e que nos importamos com os nossos pares.<\/p>\n<p>Para ser sucinto, vou falar dos cinco tipo de poderes que um l\u00edder deve desenvolver para servir seu time:<\/p>\n<p><strong>Conex\u00f5es<\/strong>: Esse \u00e9 baseado no seu relacionamento com outras pessoas. Conhe\u00e7a a empresa que voc\u00ea est\u00e1 trabalhando, saiba quem costuma se relacionar com seu time, quem pode ajudar a retirar bloqueios, quem s\u00e3o outros l\u00edderes e analistas que podem facilitar a conversa com outros times, quem pode fornecer os recursos que o seu time precisa. Al\u00e9m de se relacionar muito bem com essas pessoas, use essa rede de conex\u00f5es \u00e0 favor do seu time (e pelo bem da empresa) sempre que ele precisar.<\/p>\n<p><strong>Informa\u00e7\u00e3o<\/strong>: Procure saber o que pode afetar o seu time e facilite a propaga\u00e7\u00e3o dessas informa\u00e7\u00f5es. \u00c0s vezes outros times est\u00e3o trabalhando em tarefas que podem exigir algo nosso, \u00e0s vezes precisamos lembrar o time sobre os objetivos do que fazemos. Aqui \u00e9 importante ressaltar: saiba lidar com as informa\u00e7\u00f5es delicadas e sigilosas de forma \u00e9tica. Nunca minta ou distor\u00e7a informa\u00e7\u00f5es para manipular seu time ou a confian\u00e7a ser\u00e1 perdida completamente.<\/p>\n<p><em><strong>Expertise<\/strong><\/em>: \u00c9 habilidade e conhecimento. Estude, estude e estude um pouco mais! Tenha conhecimento sobre &nbsp;gest\u00e3o \u00e1gil, sobre pr\u00e1ticas, aprenda a organizar e facilitar cerim\u00f4nias, aprenda din\u00e2micas novas e quando utiliz\u00e1-las, saiba ler e interpretar m\u00e9tricas e use todo esse conhecimento para servir o seu time. As pessoas reconhecem e respeitam as opini\u00f5es de um <em>expert<\/em>. Fa\u00e7a cursos, treinamentos, <em>workshops<\/em>, participe de <em>meetups<\/em> e leia muito.<\/p>\n<p><strong>Refer\u00eancia<\/strong>: Seja companheiro e leal \u00e0 sua <em>squad<\/em>. \u00c9 importante lembrar que estamos lidando com pessoas e devemos nos importar com elas. Desenvolva carisma, empatia, mostre que voc\u00ea est\u00e1 com eles, aconselhe, ajude, guie! Uma dica que eu dou \u00e9: ao terminar uma retrospectiva pe\u00e7a permiss\u00e3o para ajud\u00e1-los e cobrar que eles sigam o plano de a\u00e7\u00f5es que voc\u00eas acordaram. Essa permiss\u00e3o fortalece a imagem de par e preocupa\u00e7\u00e3o com a equipe.<\/p>\n<p><strong>Recompensa<\/strong>: Esse \u00e9 um poder que normalmente n\u00e3o temos diretamente, mas eu gostaria de falar um pouco sobre duas coisas que podemos fazer: Primeiro, elogie! Quando algu\u00e9m fizer algo bom para o time ou empresa, reconhe\u00e7a. Segundo, procure usar a sua posi\u00e7\u00e3o para garantir que o bom trabalho do seu time e dos indiv\u00edduos seja reconhecido. E claro, nunca se aproprie do m\u00e9rito de algu\u00e9m.<\/p>\n<p>Para quem tiver interesse em saber, a literatura fala de outros dois tipo de poderes: Coercitivo e Leg\u00edtimo. Preferi n\u00e3o falar deles por acreditar que n\u00e3o se encaixam com o papel do l\u00edder servidor.<\/p>\n<p>Espero que esse texto lhe ajude a refletir sobre como liderar e servir os seus times. Fique \u00e0 vontade para deixar seus coment\u00e1rios, estamos sempre abertos para um bom bate-papo.<\/p>\n<p>Em breve vamos falar mais sobre motiva\u00e7\u00e3o, produtividade e <em>soft-skills<\/em>. Siga o blog da Plataformatec para saber quando novas publica\u00e7\u00f5es forem ao ar.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Para come\u00e7ar a pensar nisso, talvez a pergunta inicial seja: qual o papel de um agilista? Para mim o nosso papel \u00e9 servir o time, lider\u00e1-los, motiv\u00e1-los e influenci\u00e1-los para que eles possam desenvolver ao m\u00e1ximo suas capacidades. O Scrum possui o papel do Scrum Master para resolver bloqueios e ajudar o time a conduzir &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/07\/estilos-de-lideranca-para-gestao-agil\/\">\u00bb<\/a><\/p>\n","protected":false},"author":79,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9177"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/79"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9177"}],"version-history":[{"count":9,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9177\/revisions"}],"predecessor-version":[{"id":9190,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9177\/revisions\/9190"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9177"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9177"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9177"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}