{"id":7777,"date":"2018-08-30T11:00:17","date_gmt":"2018-08-30T14:00:17","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7777"},"modified":"2018-08-30T10:48:40","modified_gmt":"2018-08-30T13:48:40","slug":"vamos-falar-sobre-story-mapping","status":"publish","type":"post","link":"https:\/\/blog.plataformatec.com.br\/2018\/08\/vamos-falar-sobre-story-mapping\/","title":{"rendered":"Vamos falar sobre Story Mapping"},"content":{"rendered":"<p><b>Dificuldade na prioriza\u00e7\u00e3o do backlog e defini\u00e7\u00e3o de releases? <\/b><\/p>\n<p><b>Vamos falar sobre Story Mapping!<\/b><\/p>\n<p>Voc\u00ea que j\u00e1 participou de uma equipe de desenvolvimento de software, provavelmente j\u00e1 se deparou com as dificuldades enfrentadas por profissionais de produto para priorizar o backlog e definir releases. Essas tarefas podem se tornar ainda mais dif\u00edceis sem as ferramentas e t\u00e9cnicas ideais, distanciando os releases dos principais objetivos do projeto e criando features desnecess\u00e1rias para o produto.<\/p>\n<p>Para ajudar a resolver esses problemas, vamos detalhar neste blog post o uso do Story Mapping, conhecido para alguns e um grande mist\u00e9rio para outros. Essa ferramenta foi criada por Jeff Patton e descrita mais profundamente no livro \u00a0&#8220;User Story Mapping&#8221;, do mesmo autor.<\/p>\n<p>Num primeiro momento, pelo nome, voc\u00ea deve estar pensando que serve apenas para mapear itens de trabalho. E se eu disser que com o uso do Story Mapping voc\u00ea pode ainda potencializar a entrega de valor de cada release, alinhar expectativas de entrega entre stakeholders e despriorizar tudo aquilo que n\u00e3o se faz essencial para a entrega? O Story Mapping n\u00e3o vai salvar e resolver todos os problemas do seu projeto, mas vai ser muito \u00fatil especialmente em dois momentos: no in\u00edcio do projeto, quando est\u00e1 se criando um produto e n\u00e3o se tem uma dire\u00e7\u00e3o para seguir, ou ap\u00f3s uma mudan\u00e7a de objetivo que altere todo o escopo planejado.<\/p>\n<p>&nbsp;<\/p>\n<p><b>PASSO 1 &#8211; Montagem do Fluxo de Valor<\/b><\/p>\n<p>&nbsp;<\/p>\n<p>Para iniciarmos o Story Mapping, primeiramente precisamos ter um <b>fluxo<\/b> de uso ou uma <i>Big Story <\/i>que vai narrar a intera\u00e7\u00e3o do usu\u00e1rio com o produto , levando em conta o caminho que o usu\u00e1rio percorre para atingir o objetivo que esse produto se prop\u00f5e a resolver. Essa ser\u00e1 a linha de base para o Story Mapping.<\/p>\n<p>Caso ainda n\u00e3o tenha esse fluxo, ele pode ser montado em uma din\u00e2mica com os donos do produto e o time envolvido na cria\u00e7\u00e3o do mesmo, expondo suas vis\u00f5es do que seria ideal o produto realizar. Geralmente utilizamos o fluxo de valor ou o principal artefato (objeto principal do produto) para nortear a discuss\u00e3o.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-7778 aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/1-1024x447.jpg\" alt=\"\" width=\"1024\" height=\"447\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/1-1024x447.jpg 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/1-300x131.jpg 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/1-768x335.jpg 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/1.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p><b>PASSO 2 &#8211; Mapear hist\u00f3rias<\/b><\/p>\n<p>A segunda etapa \u00e9 o momento de analisar o fluxo, identificando etapas que tenham o mesmo contexto ou que sejam originadas de uma mesma a\u00e7\u00e3o do usu\u00e1rio, gerando assim os principais <b>\u00e9picos<\/b>, que servir\u00e3o de base para o levantamento dos itens de trabalho. Os \u00e9picos servir\u00e3o como um <i>backbone <\/i>(coluna vertebral) do story mapping.<\/p>\n<p>Chegou ent\u00e3o a hora de detalharmos o que precisa ser feito dentro de cada \u00e9pico. Essas ser\u00e3o as <b>hist\u00f3rias de usu\u00e1rio<\/b> (ou itens de trabalho, se preferir chamar assim) que ser\u00e3o desenvolvidas. Deixo claro aqui que essas hist\u00f3rias ainda passar\u00e3o por refinamento, que \u00e9 o momento que, de fato, vamos discutir a fundo os detalhes da tarefa e remover maiores incertezas t\u00e9cnicas e de neg\u00f3cio. O objetivo aqui \u00e9 apenas mapear os itens de trabalho, e n\u00e3o detalhar e escrev\u00ea-los. No exemplo da imagem abaixo ainda temos os temas, sendo este um agrupamento l\u00f3gico de \u00e9picos com o mesmo contexto dentro do sistema.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-7779 aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2-1024x768.jpg\" alt=\"\" width=\"1024\" height=\"768\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2-1024x768.jpg 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2-300x225.jpg 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2-768x576.jpg 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/2.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Antes de falar do pr\u00f3ximo passo, uma dica: tenha <b>objetivos<\/b> claros, priorizados e fact\u00edveis sobre o projeto, para que se possa definir os <b>releases<\/b> com maior entrega de valor. Quando se planeja um produto, geralmente se tem um objetivo a ser atingido e se espera que ele agregue um valor estim\u00e1vel ao neg\u00f3cio. Caso os objetivos estejam gen\u00e9ricos ou amplos demais, recomendo que este objetivo seja fatiado em partes menores que poder\u00e3o se tornar outros <i>milestones<\/i> de entregas do produto. Por exemplo, voc\u00ea pode ter um MVP (<i>Minimum Viable Product<\/i>), do seu produto. Esse primeiro release poder\u00e1 entregar valor para o neg\u00f3cio mais rapidamente e, mesmo que seja feito de forma mais simples, vai permitir a coleta de m\u00e9tricas de produto, validar hip\u00f3teses sobre o que est\u00e1 sendo feito e aumentar a entrega de valor de releases futuros.<\/p>\n<p>&nbsp;<\/p>\n<p><b>PASSO 3 &#8211; Defini\u00e7\u00e3o dos Releases<\/b><\/p>\n<p>O terceiro e \u00faltimo passo \u00e9, ap\u00f3s ter os principais objetivos mapeados e priorizados, fazer a distribui\u00e7\u00e3o dos itens de trabalho da etapa anterior entre esses objetivos. Uma boa maneira de fazer isso \u00e9 tra\u00e7ar raias no seu <i>board<\/i> de Story Mapping, onde cada raia representa um objetivo e, assim, facilitar a distribui\u00e7\u00e3o dos cards. Veja o exemplo abaixo:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-7780 aligncenter\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3-1024x639.png\" alt=\"\" width=\"1024\" height=\"639\" srcset=\"https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3-1024x639.png 1024w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3-300x187.png 300w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3-768x479.png 768w, https:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/08\/3.png 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>Se fatiamos o backlog, nas fatias horizontais teremos os objetivos e as hist\u00f3rias, enquanto na vertical teremos os \u00e9picos com suas respectivas hist\u00f3rias. Durante a distribui\u00e7\u00e3o de hist\u00f3rias e objetivos, ou at\u00e9 mesmo durante o desenvolvimento do produto, certamente ir\u00e3o aparecer outros itens que antes n\u00e3o haviam sido mapeados, mas o escopo estar\u00e1 bem mais detalhado e direcionado para o que precisa ser feito ap\u00f3s as discuss\u00f5es.<\/p>\n<p>Com a participa\u00e7\u00e3o de todos os stakeholders na din\u00e2mica para defini\u00e7\u00f5es de fluxo, \u00e9picos, hist\u00f3rias e releases, ganhamos em alinhamento de expectativas sobre as entregas, defini\u00e7\u00e3o de um MVP que fa\u00e7a sentido para o neg\u00f3cio e um direcionamento das pr\u00f3ximas etapas do projeto.<\/p>\n<p>Para dar continuidade ao tema de prioriza\u00e7\u00e3o de backlog e defini\u00e7\u00e3o de releases valiosos para o neg\u00f3cio, deixo aqui a recomenda\u00e7\u00e3o de um post sobre m\u00e9tricas de produtos, escrito aqui na Plataformatec: <a href=\"http:\/\/blog.plataformatec.com.br\/2018\/01\/o-que-seriam-boas-metricas-para-produtos-digitais\/\">O que seriam boas m\u00e9tricas para produtos digitais?<\/a><\/p>\n<p>E voc\u00ea? J\u00e1 tem a vis\u00e3o do backlog e releases do seu projeto? Deixe seus coment\u00e1rios abaixo sobre sua experi\u00eancia com o Story Mapping!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dificuldade na prioriza\u00e7\u00e3o do backlog e defini\u00e7\u00e3o de releases? Vamos falar sobre Story Mapping! Voc\u00ea que j\u00e1 participou de uma equipe de desenvolvimento de software, provavelmente j\u00e1 se deparou com as dificuldades enfrentadas por profissionais de produto para priorizar o backlog e definir releases. Essas tarefas podem se tornar ainda mais dif\u00edceis sem as ferramentas &#8230; <a class=\"read-more-link\" href=\"https:\/\/blog.plataformatec.com.br\/2018\/08\/vamos-falar-sobre-story-mapping\/\">\u00bb<\/a><\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,284],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7777"}],"collection":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7777"}],"version-history":[{"count":3,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7777\/revisions"}],"predecessor-version":[{"id":8197,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7777\/revisions\/8197"}],"wp:attachment":[{"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7777"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7777"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7777"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}