{"id":9196,"date":"2019-08-22T11:43:36","date_gmt":"2019-08-22T14:43:36","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9196"},"modified":"2019-08-22T13:15:18","modified_gmt":"2019-08-22T16:15:18","slug":"mapeando-stakeholders-em-projetos-digitais","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/08\/mapeando-stakeholders-em-projetos-digitais\/","title":{"rendered":"Mapeando Stakeholders em Projetos Digitais"},"content":{"rendered":"<div class=\"cl-preview-section\">\n<p>Ser\u00e1 que desenvolver produtos digitais envolve apenas compreender as necessidades das pessoas usu\u00e1rias? Como fica a gest\u00e3o das expectativas de quem est\u00e1 dentro da empresa (por exemplo: \u00e1reas de neg\u00f3cio, atendimento etc.)? Faz sentido se preocupar com pessoas que nem demandaram as evolu\u00e7\u00f5es e melhorias do produto? Mesmo a equipe trabalhando de forma t\u00e3o \u00e1gil, existem pessoas que ficam incomodadas por n\u00e3o saberem o que est\u00e1 acontecendo com o produto? Bem, talvez este texto possa lhe ajudar na gest\u00e3o da expectativas de\u00a0<em>Stakeholders<\/em>.<\/p>\n<p>Uma atividade muito importante que deve ser realizada pelo Gerente de Projetos ou pelo Gerente de Produto \u00e9 o mapeamento e a gest\u00e3o dos <em>Stakeholders<\/em>. Embora o usu\u00e1rio final seja sempre o mais impactado, por ser o foco do desenvolvimento do produto, tamb\u00e9m precisamos identificar as outras figuras que englobam esse cen\u00e1rio.<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<p>Essa atividade \u00e9 muito importante para termos visibilidade dos interesses que podem ser divergentes entre os <em>Stakeholders<\/em>\u00a0e, com isso, tra\u00e7ar estrat\u00e9gias para lidar com essas diferen\u00e7as, tentando manter uma vis\u00e3o \u00fanica para o produto. O maior risco em n\u00e3o fazer uma boa gest\u00e3o das expectativas desses\u00a0<em>Stakeholders<\/em>\u00a0\u00e9 produzir um produto que n\u00e3o atende as necessidades corretas ou n\u00e3o conseguir continuar com o desenvolvimento do produto por falta de endossamento dos principais\u00a0<em>Stakeholders<\/em>.<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<p>Definimos por <em>Stakeholder<\/em>\u00a0qualquer pessoa e\/ou comunidade afetada pela cria\u00e7\u00e3o de um produto, seja pelo projeto em si ou pelo resultado esperado. Devemos ter claro quem s\u00e3o os\u00a0<em>Stakeholders<\/em>\u00a0que s\u00e3o impactados ou que podem impactar um projeto. Dessa forma, a primeira a\u00e7\u00e3o a fazer \u00e9 um levantamento dessas pessoas\/comunidades. Algumas dicas de perguntas que voc\u00ea pode se fazer, dependo do seu contexto, para ajudar a identific\u00e1-los s\u00e3o:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<ul>\n<li>Por motivos pol\u00edticos, quem pode ajudar ou atrapalhar esse projeto?<\/li>\n<li>Quem deve ser consultado referente ao escopo do produto?<\/li>\n<li>Quem vai usar o produto?<\/li>\n<li>Quais comunidades podem ser impactadas negativamente ou positivamente pelo produto?<\/li>\n<li>Quem vai dar suporte do produto?<\/li>\n<li>Quem tem contato direto com os clientes\/usu\u00e1rios?<\/li>\n<li>Quem \u00e9 o respons\u00e1vel pela cria\u00e7\u00e3o e gerenciamento da marca?<\/li>\n<li>Quais outros produtos t\u00eam como entrada alguma sa\u00edda do produto que vamos construir?<\/li>\n<li>Quem define como e quando o produto ser\u00e1 entregue?<\/li>\n<li>Quem tem o controle dos custos e dos prazos?<\/li>\n<li>Quem define as metodologias e as ferramentas utilizadas no desenvolvimento?<\/li>\n<\/ul>\n<p>Ap\u00f3s feito o mapeamento e termos claro quem s\u00e3o os <em>Stakeholders<\/em>\u00a0daquele projeto\/produto devemos classific\u00e1-los entre os que s\u00e3o\u00a0<strong>impactados pelo produto<\/strong>\u00a0(chamamos estes de\u00a0<strong><em>Stakeholders<\/em>\u00a0de produto<\/strong>) e os\u00a0<strong>impactados pelo projeto <\/strong>(chamamos estes de\u00a0<strong>Stakeholders de projeto<\/strong>).<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<p>Os <strong>Stakeholders de produto<\/strong> s\u00e3o todos aqueles afetados pelo produto a ser constru\u00eddo, obviamente o principal <em>Stakeholder<\/em>\u00a0dessa classe s\u00e3o os usu\u00e1rios\/clientes. Por\u00e9m, al\u00e9m deles tamb\u00e9m temos todos os que interagem, diretamente ou indiretamente, com o produto, trabalham utilizando os resultados obtidos pelas pessoas que o usam, ou ser\u00e3o impactados pelos deploys e pela opera\u00e7\u00e3o do produto. Alguns exemplos s\u00e3o:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<ul>\n<li>Operadores de Suporte ou Profissionais de\u00a0<em>Help-Desk<\/em>;<\/li>\n<li>Time de Vendas do produto;<\/li>\n<li>Administradores do produto;<\/li>\n<li>Profissionais de Instala\u00e7\u00e3o e Manuten\u00e7\u00e3o;<\/li>\n<li>Outros times de desenvolvimento que usam o produto para alguma integra\u00e7\u00e3o;<\/li>\n<li>Etc.<\/li>\n<\/ul>\n<p>Podemos ainda classificar os <strong>Stakeholders de produto<\/strong>\u00a0em\u00a0<strong>tr\u00eas<\/strong>\u00a0outras categorias, dependendo da sua intera\u00e7\u00e3o com o produto, para termos maior visibilidade do grau de impacto que eles tem com o produto:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<ul>\n<li><strong>Primeiro grau:<\/strong>\u00a0aqueles que usam o produto diretamente;<\/li>\n<li><strong>Segundo Grau:<\/strong>\u00a0aqueles que usam os resultado dos que trabalham diretamente com o produto;<\/li>\n<li><strong>Terceiro Grau:<\/strong> aqueles que d\u00e3o suporte ao produto.<\/li>\n<\/ul>\n<p>Os <strong>Stakeholders de projeto<\/strong>\u00a0s\u00e3o todos aqueles que tem interesse no sucesso do projeto no qual o produto est\u00e1 sendo desenvolvido. \u00c9 responsabilidade deles analisar o cumprimento de prazos, custos determinados e como o produto est\u00e1 sendo constru\u00eddo. Alguns exemplos s\u00e3o:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<ul>\n<li><em>Sponsors<\/em>\u00a0do projeto;<\/li>\n<li>Gerente de Projeto;<\/li>\n<li>Gerente de Portf\u00f3lio;<\/li>\n<li>Executivos\u00a0<em>C-Levels<\/em>;<\/li>\n<li>Governan\u00e7a Financeira;<\/li>\n<li>Desenvolvedores;<\/li>\n<li>Etc.<\/li>\n<\/ul>\n<p>Ap\u00f3s terminada a classifica\u00e7\u00e3o desses <em>Stakeholders<\/em>, devemos identificar um a um qual o n\u00edvel de envolvimento necess\u00e1rio de cada um deles. Existem\u00a0<strong>quatro<\/strong>\u00a0n\u00edveis de envolvimento que podemos utilizar, s\u00e3o eles:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<ul>\n<li><strong>Aqueles que devem ser informados:<\/strong>\u00a0s\u00e3o todos aqueles que precisam ficar sabendo das decis\u00f5es mais importantes e os impactos poss\u00edveis das mesmas. N\u00e3o necessariamente t\u00eam poder de mudar uma decis\u00e3o, mas podem influenciar as pessoas que o t\u00eam. Alguns exemplos s\u00e3o:\n<ul>\n<li>Gerentes de \u00c1reas Impactadas;<\/li>\n<li>Gerente de Portf\u00f3lio;<\/li>\n<li>Administradores do produto.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li><strong>Aqueles que devem ser consultados:<\/strong>\u00a0s\u00e3o todos aqueles que devem ser ouvidos antes da tomada de alguma decis\u00e3o, normalmente s\u00e3o especialistas em alguma \u00e1rea espec\u00edfica do produto. Devem ser envolvidos nas decis\u00f5es tomadas dentro de suas \u00e1reas de especialidade;\n<ul>\n<li>Analistas de Marketing;<\/li>\n<li>Arquitetos de Sistemas;<\/li>\n<li>Especialistas de UX.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li><strong>Aqueles que controlam os entreg\u00e1veis:<\/strong>\u00a0s\u00e3o todos aqueles que tomam a decis\u00e3o final em rela\u00e7\u00e3o a algum assunto.\n<ul>\n<li>Executivos C-Levels;<\/li>\n<li>Gerentes de Releases;<\/li>\n<li>Usu\u00e1rios.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li><strong>Parceiros no desenvolvimento:<\/strong>\u00a0s\u00e3o todos aqueles que est\u00e3o trabalhando no desenvolvimento de outros produtos, que podem ter intera\u00e7\u00e3o com o produto a ser criado;\n<ul>\n<li>Outras equipes de desenvolvimento da empresa;<\/li>\n<li>Provedores de servi\u00e7os que t\u00eam integra\u00e7\u00e3o com o produto.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>Caso tenha dificuldade de saber em qual n\u00edvel de envolvimento o <em>Stakeholder<\/em>\u00a0se situa, podemos utilizar uma matriz de Influ\u00eancia por Interesse, como na figura abaixo:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9205 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Matriz-de-InfluenciaXInteresse.png\" alt=\"\" width=\"1372\" height=\"872\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Matriz-de-InfluenciaXInteresse.png 1372w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Matriz-de-InfluenciaXInteresse-300x191.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Matriz-de-InfluenciaXInteresse-768x488.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Matriz-de-InfluenciaXInteresse-1024x651.png 1024w\" sizes=\"(max-width: 1372px) 100vw, 1372px\" \/><\/p>\n<p>Agora que temos mapeados e classificados os nossos <em>Stakeholders<\/em>, devemos entender quais as necessidades de projeto ou de produto que cada um deles tem. Com isso, podemos criar uma tabela simples com uma linha por <em>Stakeholder<\/em>, como no exemplo abaixo:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-9207\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Tabela-de-Stakeholders-1.png\" alt=\"\" width=\"2400\" height=\"1120\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Tabela-de-Stakeholders-1.png 2400w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Tabela-de-Stakeholders-1-300x140.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Tabela-de-Stakeholders-1-768x358.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/08\/Tabela-de-Stakeholders-1-1024x478.png 1024w\" sizes=\"(max-width: 2400px) 100vw, 2400px\" \/><\/p>\n<p>Bem, dado que mapear <em>Stakeholders<\/em>\u00a0\u00e9 algo muito importante, gostaria de deixar aqui 2 principais dicas para otimizar a aplica\u00e7\u00e3o da pr\u00e1ticas que uso no dia a dia, s\u00e3o elas:<\/p>\n<\/div>\n<div class=\"cl-preview-section\">\n<ul>\n<li>Identificar os\u00a0<em>Stakeholders<\/em>\u00a0o mais cedo poss\u00edvel e manter o mapa atualizado, deixando o canal de comunica\u00e7\u00e3o sempre aberto de forma a sempre ficar atento com as mudan\u00e7as de objetivos que podem ocorrer;<\/li>\n<li>Dividir a responsabilidade de mapear com outros membros da equipe, visto que cada pessoa ter\u00e1 naturalmente contato com diferentes pessoas e isso pode enriquecer o seu entendimento do contexto como um todo.<\/li>\n<\/ul>\n<\/div>\n<div class=\"cl-preview-section\">\n<p>\u200b E voc\u00ea, tem feito mapeamento de\u00a0<em>Stakeholders<\/em>\u00a0em seus projetos ? Qual tem sido o maior ganho desse aumento de visibilidade ? Conte para n\u00f3s nos coment\u00e1rios abaixo ou no Twitter @plataformatecbr.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Ser\u00e1 que desenvolver produtos digitais envolve apenas compreender as necessidades das pessoas usu\u00e1rias? Como fica a gest\u00e3o das expectativas de quem est\u00e1 dentro da empresa (por exemplo: \u00e1reas de neg\u00f3cio, atendimento etc.)? Faz sentido se preocupar com pessoas que nem demandaram as evolu\u00e7\u00f5es e melhorias do produto? Mesmo a equipe trabalhando de forma t\u00e3o \u00e1gil, &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/08\/mapeando-stakeholders-em-projetos-digitais\/\">\u00bb<\/a><\/p>\n","protected":false},"author":69,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9196"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/69"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9196"}],"version-history":[{"count":10,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9196\/revisions"}],"predecessor-version":[{"id":9235,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9196\/revisions\/9235"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9196"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9196"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9196"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}