{"id":9145,"date":"2019-07-01T11:08:52","date_gmt":"2019-07-01T14:08:52","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=9145"},"modified":"2019-07-01T15:13:33","modified_gmt":"2019-07-01T18:13:33","slug":"burndown-para-scrumban-uma-nova-ideia-para-acompanhar-suas-sprints","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/07\/burndown-para-scrumban-uma-nova-ideia-para-acompanhar-suas-sprints\/","title":{"rendered":"Burndown para Scrumban: uma nova ideia para acompanhar suas Sprints"},"content":{"rendered":"<p>Ap\u00f3s um tempo consider\u00e1vel trabalhando focado com o m\u00e9todo Kanban, tive o prazer de voltar a trabalhar usando Scrum. Praticamente acompanhei um time utilizando esse framework em seu formato <em>by the book<\/em>, ou seja, na sua \u00edntegra, sem adapta\u00e7\u00f5es.<\/p>\n<p>Em uma determinada ocasi\u00e3o, percebi que poder\u00edamos aprimorar as m\u00e9tricas que o time estava utilizando. Nesse momento, ainda n\u00e3o est\u00e1vamos utilizando o <em>Burndown<\/em>, um dos gr\u00e1ficos mais famosos para times que utilizam o framework Scrum. Por\u00e9m, quando come\u00e7amos a falar sobre ele, lembrei de algo que me incomodava um pouco nesse gr\u00e1fico: o time s\u00f3 consegue perceber o progresso quando o item de trabalho \u00e9 conclu\u00eddo e, por consequ\u00eancia, seu valor \u00e9 debitado no gr\u00e1fico. Podemos perceber essa situa\u00e7\u00e3o neste exemplo:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9146 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-ClassicBurndown.png\" alt=\"\" width=\"1790\" height=\"760\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-ClassicBurndown.png 1790w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-ClassicBurndown-300x127.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-ClassicBurndown-768x326.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-ClassicBurndown-1024x435.png 1024w\" sizes=\"(max-width: 1790px) 100vw, 1790px\" \/><\/p>\n<p>Na imagem acima, o eixo X representa o tempo da Sprint em dias corridos e, no eixo Y, temos o valor de pontos das hist\u00f3rias que fazem parte da Sprint. A barra azul representa a proje\u00e7\u00e3o que dever\u00edamos entregar na linha do tempo. Por fim, a linha vermelha \u00e9 o que efetivamente entregamos e, sempre que ela decresce, significa que um ou mais itens de trabalho foram entregues naquele respectivo dia. At\u00e9 aqui, nenhuma novidade.<\/p>\n<p><strong>A ideia de criar um novo Burndown<\/strong><\/p>\n<hr>\n<p>Nesta ocasi\u00e3o, entendi que t\u00ednhamos uma oportunidade de aprimorar esse gr\u00e1fico, testando uma nova forma de acompanhar o progresso do time (no exemplo anterior, a linha vermelha). Validei a seguinte ideia com algumas pessoas: e se a gente considerasse o valor proporcional da evolu\u00e7\u00e3o do time, de acordo com a etapa em que o item de trabalho est\u00e1 no quadro kanban? Sim, est\u00e1vamos utilizando o Scrum, mas, por ele ser um <em>framework<\/em>, agregamos algumas outras pr\u00e1ticas, sendo uma delas um quadro para o time gerenciar as etapas de desenvolvimento de todos os itens de trabalho.<\/p>\n<p>A l\u00f3gica \u00e9 simples: imagine um item de trabalho (uma hist\u00f3ria de usu\u00e1rio, por exemplo) de tamanho 8. Essa demanda est\u00e1 dentro de uma Sprint com 29 pontos de hist\u00f3ria no total. O que aconteceria se a gente debitasse uma propor\u00e7\u00e3o deste item de trabalho no <em>Burndown<\/em> quando ele fosse movido de uma etapa para outra? Na pr\u00e1tica, quando come\u00e7amos a fazer isso em todos os itens de trabalho da Sprint, aconteceu algo semelhante a este exemplo hipot\u00e9tico:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9147 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithoutProportions.png\" alt=\"\" width=\"1787\" height=\"755\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithoutProportions.png 1787w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithoutProportions-300x127.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithoutProportions-768x324.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithoutProportions-1024x433.png 1024w\" sizes=\"(max-width: 1787px) 100vw, 1787px\" \/><\/p>\n<p>A linha laranja no exemplo acima representa a ideia do <strong>Burndown para Scrumban<\/strong>&nbsp;(n\u00e3o achei um nome melhor, ent\u00e3o esse ficou autoexplicativo). \u00c9 poss\u00edvel perceber que ela est\u00e1 mais flu\u00edda e decresce de uma forma mais constante se compararmos com a linha vermelha.<\/p>\n<p>Nesta ocasi\u00e3o, nosso quadro kanban era composto por 10 etapas para acompanhar os itens de trabalho, sendo que 7 dessas etapas eram consideradas como <em>WIP<\/em> (Work In Progress, ou trabalho em progresso). Utilizando novamente o exemplo do item de trabalho com tamanho 8, n\u00f3s come\u00e7amos a debitar a propor\u00e7\u00e3o deste valor toda vez que o item passava para a etapa seguinte no quadro. Ou seja, o gr\u00e1fico debitava <strong>1,14<\/strong>&nbsp;pontos sempre que o item se movesse para a etapa seguinte (8\/7, que \u00e9 igual ao tamanho do item [8] dividido pela quantidade de etapas consideradas como <em>WIP<\/em> [7]).<\/p>\n<p>Por exemplo: quando o time levou o item (de tamanho 8) da etapa &#8220;Em Desenvolvimento&#8221; para a etapa &#8220;Revis\u00e3o do C\u00f3digo&#8221;, o gr\u00e1fico (linha laranja) considerou 1,14 pontos entregues. Quando passou de &#8220;Revis\u00e3o do C\u00f3digo&#8221; para &#8220;Pronto para Testar&#8221;, debitou mais 1,14 pontos, e assim sucessivamente at\u00e9 que, quando o item foi levado para &#8220;Conclu\u00eddo&#8221;, o gr\u00e1fico debitou os \u00faltimos 1,14 pontos, totalizando assim 8 pontos de hist\u00f3ria conclu\u00eddos. Esse mesmo racioc\u00edcio aconteceu para todas as outras demandas: <strong>0,42<\/strong> (3\/7) para itens com tamanho 3, <strong>0,71<\/strong>&nbsp;(5\/7) para itens de tamanho 5, e assim por diante.<\/p>\n<p>Inclusive h\u00e1 um detalhe importante na imagem anterior. \u00c9 poss\u00edvel perceber que a linha laranja (a que est\u00e1 abaixo da linha reta, a azul) come\u00e7ou com 24,8 pontos, um pouco a menos dos 29,0 pontos do total da Sprint. Isso ocorreu porque, neste exemplo, o time pode ter herdado itens de trabalho n\u00e3o finalizados de uma Sprint anterior e, neste caso, elas j\u00e1 come\u00e7aram na nova Sprint em uma etapa mais avan\u00e7ada no quadro kanban, como em &#8220;Testando&#8221;, por exemplo. Logo, elas j\u00e1 tiveram seus pontos debitados e, com isso, a equipe come\u00e7ou a Sprint com uma leve vantagem em determinadas demandas (algumas prontas para serem desenvolvidas, outras j\u00e1 em andamento).<\/p>\n<p><strong>Aprimorando a ideia do Burndown para Scrumban<\/strong><\/p>\n<hr>\n<p>Por\u00e9m, havia um problema: considerar a propor\u00e7\u00e3o do item pode trazer mais precis\u00e3o na avalia\u00e7\u00e3o do gr\u00e1fico, como tamb\u00e9m do progresso do time ao longo da Sprint, mas ser\u00e1 que \u00e9 correto entender que cada etapa do quadro kanban tem o mesmo peso? Em outras palavras, \u00e9 correto dizer que o tempo alocado para <strong>desenvolver (c\u00f3digo)<\/strong> um item de trabalho vale o mesmo tanto do que o tempo que ele ficou <strong>aguardando para ser testado<\/strong>, por exemplo?<\/p>\n<p>Conversei com algumas pessoas e fiquei convencido de que essa l\u00f3gica estava equivocada, mesmo trazendo um pouco mais de precis\u00e3o para a avalia\u00e7\u00e3o do gr\u00e1fico. Solu\u00e7\u00e3o: come\u00e7amos a utilizar a propor\u00e7\u00e3o do tempo de desenvolvimento em cada etapa do quadro kanban, e, para conseguir esse valor proporcional, extra\u00ed o hist\u00f3rico de dados do gr\u00e1fico <strong>Lead time Breakdown<\/strong> e obtive a propor\u00e7\u00e3o de tempo em que cada item ficava em cada uma das etapas do quadro kanban. Para obter esse valor, considerei todos os itens de trabalho conclu\u00eddos em Sprints anteriores e calculei a mediana da amostra de dados. Se voc\u00ea ainda n\u00e3o conhece o Lead time Breakdown, sugiro a leitura da segunda se\u00e7\u00e3o do artigo <a href=\"http:\/\/blog.plataformatec.com.br\/2017\/10\/metricas-ageis-cumulative-flow-diagrams-e-lead-time-breakdown\/\" target=\"_blank\" rel=\"noopener noreferrer\">M\u00e9tricas \u00c1geis: Cumulative Flow Diagrams e Lead Time Breakdown<\/a>, escrito por Raphael Albino.<\/p>\n<p>Deixando a explica\u00e7\u00e3o acima menos t\u00e9cnica e mais pr\u00e1tica: de 100% do tempo que eu demoro para entregar um item de trabalho, quanto tempo ele fica em desenvolvimento? E em testes? E em revis\u00e3o do c\u00f3digo? Foi essa propor\u00e7\u00e3o que eu obtive e inseri no gr\u00e1fico, a fim de deix\u00e1-lo mais preciso. O resultado:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9148 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions.png\" alt=\"\" width=\"1790\" height=\"758\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions.png 1790w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-300x127.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-768x325.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-1024x434.png 1024w\" sizes=\"(max-width: 1790px) 100vw, 1790px\" \/><\/p>\n<p>Na extra\u00e7\u00e3o desses dados, por exemplo, descobri que os itens dessa equipe ficavam 48% do tempo em desenvolvimento. Lembra a hist\u00f3ria de usu\u00e1rio de tamanho 8 da explica\u00e7\u00e3o anterior? Ent\u00e3o, ao inv\u00e9s de eu debitar no gr\u00e1fico acima 1,14 pontos quando este item de trabalho passou de &#8220;Em desenvolvimento&#8221; para &#8220;Revis\u00e3o do C\u00f3digo&#8221;, eu debitei 3,84 pontos, pois isso \u00e9 48% de 8 pontos. E esse mesmo racioc\u00ednio foi aplicado para todas as outras etapas do quadro kanban, bem como para todos os outros itens de trabalho.<\/p>\n<p>Para facilitar a visualiza\u00e7\u00e3o da diferen\u00e7a entre cada um, coloquei, no mesmo gr\u00e1fico, as tr\u00eas formas que consideram o progresso da Sprint:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9149 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithAndWithoutProportions.png\" alt=\"\" width=\"2368\" height=\"1024\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithAndWithoutProportions.png 2368w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithAndWithoutProportions-300x130.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithAndWithoutProportions-768x332.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithAndWithoutProportions-1024x443.png 1024w\" sizes=\"(max-width: 2368px) 100vw, 2368px\" \/><\/p>\n<p>Resumindo tudo o que foi falado at\u00e9 aqui atrav\u00e9s da imagem acima:<\/p>\n<ul>\n<li>A linha cont\u00ednua n\u00e3o linear (vermelha) apresenta o que eu estou chamando de Burndown Cl\u00e1ssico, ou seja, os d\u00e9bitos dos pontos de hist\u00f3ria acontecem sempre, e somente quando, um item de trabalho \u00e9 conclu\u00eddo;<\/li>\n<li>A linha tracejada (verde) apresenta os d\u00e9bitos de pontos de hist\u00f3ria por etapa do quadro kanban, considerando que cada etapa teria o mesmo peso (dividindo o total de pontos da hist\u00f3ria pelo n\u00famero de etapas consideradas como trabalho em progresso);<\/li>\n<li>A linha pontilhada (laranja) apresenta o mesmo racioc\u00ednio da anterior, por\u00e9m, ao inv\u00e9s de considerar o mesmo peso para cada etapa no quadro kanban, <strong>a an\u00e1lise considera a propor\u00e7\u00e3o de tempo em que cada item de trabalho fica nas respectivas etapas consideradas como trabalho em progresso<\/strong>. Como comentei anteriormente, essa propor\u00e7\u00e3o de tempo \u00e9 obtida pelo hist\u00f3rico de itens de trabalho conclu\u00eddos em Sprints anteriores.<\/li>\n<\/ul>\n<p>Observa\u00e7\u00e3o: eu escolhi usar a mediana devido \u00e0 impossibilidade de utilizar o desvio padr\u00e3o junto com m\u00e9dia, o que poderia causar algumas distor\u00e7\u00f5es indesejadas (devido a <em>outliers<\/em>, por exemplo).<\/p>\n<p><strong>Usando no dia a dia das Sprints<\/strong><\/p>\n<hr>\n<p>E como usar este Burndown para Scrumban nos seus projetos? Veja esse exemplo:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-9150 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-Going-1.png\" alt=\"\" width=\"1780\" height=\"755\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-Going-1.png 1780w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-Going-1-300x127.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-Going-1-768x326.png 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/07\/Plataformatec-BurndownForScrumban-WithProportions-Going-1-1024x434.png 1024w\" sizes=\"(max-width: 1780px) 100vw, 1780px\" \/><\/p>\n<p>No dia da imagem, uma hipot\u00e9tica equipe &#8220;deveria&#8221; ter entregue 10,4 pontos se a Sprint estivesse caminhando em um ritmo igual ao da proje\u00e7\u00e3o linear decrescente. Por\u00e9m, nesse dia, ainda havia <strong>16 pontos abertos na Sprint<\/strong>&nbsp;(baseado no Burndown Cl\u00e1ssico). Logo, seria poss\u00edvel dizer que a equipe est\u00e1 atrasada, correto?<\/p>\n<p>Por\u00e9m, observando o Burndown para Scrumban com propor\u00e7\u00f5es, a equipe possu\u00eda, neste mesmo dia, apenas <strong>6,2 pontos restantes na Sprint<\/strong>, pois, al\u00e9m dos itens j\u00e1 entregues, ela tamb\u00e9m est\u00e1 com itens de trabalho em andamento, potencialmente a caminho de ficarem prontos. Por essa \u00f3tica, podemos concluir que a equipe est\u00e1, na verdade, adiantada em rela\u00e7\u00e3o \u00e0 Sprint, dado que, neste exemplo, a linha do Burndown para Scrumban est\u00e1 abaixo da proje\u00e7\u00e3o linear decrescente.<\/p>\n<p>Em outras palavras, essa equipe hipot\u00e9tica teria:<\/p>\n<ul>\n<li>Entregue 13 pontos de hist\u00f3ria (29 pontos estimados para a Sprint, menos 16 pontos restantes);<\/li>\n<li>9,8 pontos de hist\u00f3ria entregues parcialmente (16 pontos restantes menos 6,2 pontos restantes &#8211; considerando o Burndown para Scrumban com propor\u00e7\u00f5es). Neste caso, o significado da palavra parcialmente pode ser: itens de trabalho testados, mas ainda n\u00e3o publicados, itens desenvolvidos, mas ainda n\u00e3o testados, etc.;<\/li>\n<li>6,2 pontos de hist\u00f3ria remanescentes para serem desenvolvidos em uma ou mais etapas do quadro kanban.<\/li>\n<\/ul>\n<p>\u00c9 poss\u00edvel notar tamb\u00e9m que, no dia anterior ao do exemplo, a equipe tamb\u00e9m tinha 16 pontos de hist\u00f3ria restantes (Burndown Cl\u00e1ssico), mas, na outra linha (do Burndown para Scrumban com propor\u00e7\u00f5es), ela diminuiu de 9,4 para 6,2 pontos. Logo, \u00e9 poss\u00edvel concluir que o time <strong>est\u00e1 avan\u00e7ando com os trabalhos<\/strong>, pois concluiu <strong>3,2<\/strong>&nbsp;(9,4 menos 6,2) pontos de um dia para o outro, mas ainda n\u00e3o concluiu por completo nenhuma outra demanda.<\/p>\n<p>Ou seja, o time pode usar este gr\u00e1fico durante a <em>Daily Meeting<\/em>, por exemplo, sendo um apoio para inspecionar o progresso e, eventualmente, tomar decis\u00f5es que viabilizem corre\u00e7\u00f5es no rumo da Sprint.<\/p>\n<p><strong>Conclus\u00e3o<\/strong><\/p>\n<hr>\n<p>Voc\u00ea pode entender que considerar itens de trabalho em andamento n\u00e3o seja efetivamente uma entrega de valor, pois cada item tem duas situa\u00e7\u00f5es: ou ele est\u00e1 conclu\u00eddo e incrementado no produto, ou ainda est\u00e1 em andamento. E eu concordo com voc\u00ea! Entretanto, <strong>a ideia do Burndown para Scrumban \u00e9 deixar o acompanhamento do dia a dia mais preciso<\/strong>, visto que ele tamb\u00e9m considera os itens em andamento. O objetivo n\u00e3o \u00e9 substituir o Burndown Cl\u00e1ssico (por isso eu deixei as duas linhas no mesmo gr\u00e1fico, pois cada uma delas oferece uma informa\u00e7\u00e3o distinta e complementar).<\/p>\n<p>E voc\u00ea, o que achou desta proposta de Burndown para Scrumban? Estou totalmente aberto a debater a ideia, bem como ajudar seu time a utilizar esse novo gr\u00e1fico.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ap\u00f3s um tempo consider\u00e1vel trabalhando focado com o m\u00e9todo Kanban, tive o prazer de voltar a trabalhar usando Scrum. Praticamente acompanhei um time utilizando esse framework em seu formato by the book, ou seja, na sua \u00edntegra, sem adapta\u00e7\u00f5es. Em uma determinada ocasi\u00e3o, percebi que poder\u00edamos aprimorar as m\u00e9tricas que o time estava utilizando. Nesse &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/07\/burndown-para-scrumban-uma-nova-ideia-para-acompanhar-suas-sprints\/\">\u00bb<\/a><\/p>\n","protected":false},"author":61,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9145"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=9145"}],"version-history":[{"count":4,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9145\/revisions"}],"predecessor-version":[{"id":9156,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/9145\/revisions\/9156"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=9145"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=9145"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=9145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}