{"id":6472,"date":"2017-06-08T13:29:04","date_gmt":"2017-06-08T16:29:04","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=6472"},"modified":"2017-06-08T17:59:55","modified_gmt":"2017-06-08T20:59:55","slug":"5-acoes-para-melhorar-confianca-entre-membros-da-equipe","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2017\/06\/5-acoes-para-melhorar-confianca-entre-membros-da-equipe\/","title":{"rendered":"5 A\u00e7\u00f5es para melhorar confian\u00e7a entre membros da equipe"},"content":{"rendered":"<p>Voc\u00ea pode estar sofrendo de falta de confian\u00e7a entre os membros do seu time, e ainda nem notou. Na verdade, \u00e9 muito dif\u00edcil perceber, j\u00e1 que confian\u00e7a \u00e9, muitas vezes, inconsciente para n\u00f3s.<\/p>\n<p>Neste post, vou real\u00e7ar a import\u00e2ncia da confian\u00e7a em um time, e ent\u00e3o, listar algumas a\u00e7\u00f5es para melhorar a confian\u00e7a entre seus colegas.<\/p>\n<p style=\"text-align:center;\"><a href=\"http:\/\/pages.plataformatec.com.br\/5-estrategias-para-otimizar-fluxo-de-desenvolvimento-de-software?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=ebook-5-estratgias-para-fluxo&amp;utm_content=cta-blog-post-middle\" target=\"_blank\" style=\"background: #009eaa;border: none;border-radius: 3px;color: #fff;display: inline-block;line-height: 1.5;padding: 8px 10px;text-align: center; text-decoration: none; font-family:sans-serif;\"><span style=\"letter-spacing:0.05em;font-size: 11px;font-weight: bold;\">BAIXAR E-BOOK GR\u00c1TIS<\/span><br \/>5 Estrat\u00e9gias para otimizar o fluxo de desenvolvimento de software<\/a><\/p>\n<h2>Por que voc\u00ea deve se importar?<\/h2>\n<blockquote><p>\n  <em>You may be deceived if you trust too much, but you will live in torment if you don&#8217;t trust enough.<\/em> &#8211; Frank Crane, American minister and author\n<\/p><\/blockquote>\n<p>Times com defici\u00eancia de confian\u00e7a tendem a demorar mais para entregar tarefas, hesitam em pedir ajuda, guardam ressentimentos, evitam conversar com o time, al\u00e9m de outros comportamentos que contribuem para diminui\u00e7\u00e3o da velocidade do time.<\/p>\n<p>Como voc\u00ea pode ver nesta pir\u00e2mide, retirada do livro de Patrick Lencioni, &#8220;The Five Dysfunctions of a Team&#8221;, sem confian\u00e7a, o time n\u00e3o tem alicerce para alta performance.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/11\/Pyramid-The-Five-Dysfunctions-of-a-Team.png\" alt=\"Pyramid - The Five Dysfunctions of a Team\" width=\"507\" height=\"424\" class=\"aligncenter size-full wp-image-5811\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/11\/Pyramid-The-Five-Dysfunctions-of-a-Team.png 507w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2016\/11\/Pyramid-The-Five-Dysfunctions-of-a-Team-300x251.png 300w\" sizes=\"(max-width: 507px) 100vw, 507px\" \/><\/p>\n<p>Existem alguns indicadores de falta de confian\u00e7a e vou explic\u00e1-los em mais detalhes, para que voc\u00ea consiga identificar o problema em seus times. Mais adiante, mostrarei a\u00e7\u00f5es para construir mais confian\u00e7a.<\/p>\n<h2>Indicadores de falta de confian\u00e7a<\/h2>\n<p>As dicas abaixo n\u00e3o s\u00e3o apenas relacionadas \u00e0 falta de confian\u00e7a, mas se voc\u00ea reconhece uma ou mais delas, pode come\u00e7ar a pensar se isso \u00e9 o seu problema ou n\u00e3o.<\/p>\n<h3>Silos de informa\u00e7\u00e3o<\/h3>\n<p>Pessoas escondem informa\u00e7\u00f5es de outras que voc\u00ea confia. Isso \u00e9 natural e muitas vezes impercept\u00edvel. No entanto, como membro do time, voc\u00ea provavelmente ver\u00e1 efeitos desta falta de confian\u00e7a.<\/p>\n<p>A primeira coisa que voc\u00ea perceber\u00e1 \u00e9 que algumas informa\u00e7\u00f5es est\u00e3o restringidas a um grupo de pessoas, ou a uma \u00fanica pessoa. Se tiver algu\u00e9m altamente especialista em tarefas do dia-a-dia, ent\u00e3o essa pessoa provavelmente n\u00e3o est\u00e1 compartilhando conhecimento com outros. Esse comportamento pode ser causado pelo medo de ser substitu\u00eddo por outra pessoa com mesmo conhecimento, ou ser comparada com outros por motivos quaisquer.<\/p>\n<h3>Reuni\u00f5es Indesejadas<\/h3>\n<p>Se voc\u00ea sente que as pessoas nunca est\u00e3o confort\u00e1veis quando recebem o an\u00fancio de uma reuni\u00e3o, elas provavelmente possuem problemas de confian\u00e7a. J\u00e1 que n\u00e3o gostam de compartilhar informa\u00e7\u00f5es, reuni\u00f5es se tornam in\u00fateis e chatas para elas.<\/p>\n<h3>Panelinhas<\/h3>\n<p>Panelinhas s\u00e3o um cl\u00e1ssico exemplo de falta de confian\u00e7a. Se, seu time est\u00e1 dividido em diferentes &#8220;panelas&#8221;, haver\u00e1 prefer\u00eancia por trabalhar dentro delas e evitar pessoas &#8220;de fora&#8221;.<\/p>\n<h3>Prefer\u00eancia em trabalhar individualmente<\/h3>\n<p>O mesmo que acontece com panelinhas, pode ser visto quando os membros do time preferem trabalhar individualmente, sem perguntar ou compartilhar qualquer informa\u00e7\u00e3o. \u00c9 importante n\u00e3o confundir introspec\u00e7\u00e3o com falta de confian\u00e7a. Geralmente, introspectivos tendem a fazer coisas sozinhas, mas quando se deparam com alguma dificuldade que sabem que algu\u00e9m pode ajudar, elas pedem ajuda. Por outro lado, pessoas que n\u00e3o confiam em outras tentam resolver sozinhas os problemas.<\/p>\n<h3>Carga de trabalho diferente<\/h3>\n<p>Isso \u00e9 muito comum. A carga de trabalho dada a uma pessoa \u00e9 muito maior do que a outras. Al\u00e9m disso, geralmente n\u00e3o s\u00f3 a quantidade de trabalho \u00e9 diferente como tamb\u00e9m a import\u00e2ncia e dificuldade t\u00e9cnica do trabalho.<\/p>\n<h2>A\u00e7\u00f5es<\/h2>\n<p>Ok, sabemos como detectar o problema, mas o que fazer? Bom, como todo problema de gerenciamento, depende do contexto. No entanto, h\u00e1 a\u00e7\u00f5es de boas pr\u00e1ticas que voc\u00ea pode aplicar e, dependendo da raiz do problema, pode ajudar voc\u00ea a impulsionar confian\u00e7a entre os membros do time.<\/p>\n<h3>1. Comece com&#8230; confiar!<\/h3>\n<p>A primeira coisa que deve fazer \u00e9 confiar. (<em>Obrigado capit\u00e3o \u00d3bvio<\/em>.) Voc\u00ea pode pensar que isso \u00e9 est\u00fapido ou \u00f3bvio, mas quero dizer que voc\u00ea precisa come\u00e7ar a confiar nas outras pessoas, e tamb\u00e9m disseminar este comportamento. Liderar dando exemplo \u00e9 a chave aqui.<\/p>\n<p>Um jeito de impulsionar seria demonstrar explicitamente sua confian\u00e7a dizendo: &#8220;Concordo com voc\u00ea&#8221;, ou &#8220;Eu sei que voc\u00ea consegue fazer isso&#8221;. Pessoas notar\u00e3o mudan\u00e7as em seu comportamento e come\u00e7ar\u00e3o a imit\u00e1-lo, mesmo que inconscientemente.<\/p>\n<p>De acordo com Dr. Henry Cloud\u2019s no livro, <em>Boundaries for Leaders<\/em>, mudan\u00e7as ficam expl\u00edcitas quando voc\u00ea mostra \u00e0s pessoas que:<\/p>\n<ul>\n<li>as entende: pessoas podem reagir de diferentes maneiras, mostre que voc\u00ea as conhece e pode lidar com diferen\u00e7as;<\/li>\n<li>quer ajud\u00e1-las: esclare\u00e7a que voc\u00ea n\u00e3o est\u00e1 falando para culp\u00e1-las ou algo do g\u00eanero. O que voc\u00ea est\u00e1 falando \u00e9 para <strong>ajud\u00e1-las<\/strong>;<\/li>\n<li>acredita na capacidade e habilidade delas: forne\u00e7a evid\u00eancias de que possuem compet\u00eancia para realizar o que voc\u00ea sugere. Caso falhem, mostre que voc\u00ea entende que erros acontecem, que n\u00e3o perderam credibilidade e continua contando com elas.<\/li>\n<\/ul>\n<h3>2. Incentive transpar\u00eancia<\/h3>\n<p>Algumas vezes paramos de confiar nos outros, pois sabemos muito pouco ou nada sobre eles. Para resolver isso, precisamos melhorar a transpar\u00eancia do nosso trabalho, tendo certeza de que todos sabem o que cada um faz. Isso pode ser alcan\u00e7ado atrav\u00e9s de quadros Kanban, reuni\u00f5es semanais em que todos falem rapidamente que tarefa est\u00e1 em execu\u00e7\u00e3o, ou qualquer outra atividade que mostre explicitamente que todos est\u00e3o trabalhando em coisas diferentes, mas juntos rumo ao mesmo objetivo.<\/p>\n<h3>3. Conecte-se<\/h3>\n<p>Pessoas tem amigos. Elas n\u00e3o precisam fazer amigos na empresa &#8230; certo? Bom, sim&#8230; Mas isso n\u00e3o significa que precisamos agir como estranhos o dia todo.<\/p>\n<p>No come\u00e7o, as pessoas podem evitar compartilhar detalhes das suas vidas, e n\u00e3o h\u00e1 problemas nisso. Voc\u00ea pode melhorar isso ao deix\u00e1-las saber um pouco mais sobre voc\u00ea, o que pode falar sobre t\u00f3picos aleat\u00f3rios como de onde voc\u00ea veio, quais esportes voc\u00ea segue ou porque gastou $300 na cole\u00e7\u00e3o do Crep\u00fasculo. O importante aqui \u00e9 a conversa, n\u00e3o o conte\u00fado.<\/p>\n<h3>4. Crie uma cultura na qual erros s\u00e3o permitidos<\/h3>\n<p>Se voc\u00ea \u00e9 do tipo que grita quando algu\u00e9m faz algo errado, voc\u00ea deveria parar. Cultura de retalia\u00e7\u00e3o e culpa \u00e9 o oposto do que as pessoas precisam para criar confian\u00e7a.<\/p>\n<p>Como W. Edwards Deming fala:<\/p>\n<blockquote><p>\n  <em>Blame the process not the people<\/em>\n<\/p><\/blockquote>\n<p>Isso n\u00e3o apenas melhora a confian\u00e7a entre pessoas, como tamb\u00e9m, garante que voc\u00ea est\u00e1 monitorando o processo e d\u00e1 a import\u00e2ncia que merece.<\/p>\n<h3>5. Envolva pessoas remotas<\/h3>\n<p>Quando trabalhamos com times geograficamente distribu\u00eddos, confian\u00e7a \u00e9 muito mais dif\u00edcil de ser constru\u00edda. Talvez voc\u00ea nunca conhe\u00e7a a outra pessoa cara a cara, sequer ou\u00e7a a voz.  Como  criar confian\u00e7a desse jeito? Bom, do mesmo jeito que a tecnologia nos permitiu trabalhar de lugares diferentes, tamb\u00e9m proporcionou toneladas de novas tecnologias para melhorar a comunica\u00e7\u00e3o.<\/p>\n<p>No post &#8220;<a href=\"http:\/\/blog.plataformatec.com.br\/2016\/01\/how-to-do-remote-meetings-effectively\/\">How to do remote meetings effectively<\/a>&#8220;, h\u00e1 uma breve lista de tecnologias que usamos na Plataformatec para melhorar a qualidade da nossa comunica\u00e7\u00e3o.<\/p>\n<p>Um detalhe extra aqui \u00e9 que \u00e0s vezes as pessoas est\u00e3o em diferentes fuso hor\u00e1rios. Portanto, gerencie a agenda de todos para que reuni\u00f5es importantes sejam feitas em hor\u00e1rios nos quais todos podem estar presentes, fisicamente ou online. Al\u00e9m disso, se est\u00e3o em diferentes pa\u00edses, possuem diferentes culturas. Esteja ciente das diferen\u00e7as para manter um relacionamento de respeito e confian\u00e7a um no outro.<\/p>\n<h2>Conclus\u00e3o<\/h2>\n<p>Falei sobre mudan\u00e7as em julgamentos, ambiente de trabalho, percep\u00e7\u00e3o, encorajamento, etc. H\u00e1 um ponto importante que gostaria de refor\u00e7ar como conclus\u00e7\u00e3o do post: <strong>melhore a comunica\u00e7\u00e3o<\/strong>.<\/p>\n<p>Pode parecer clich\u00ea, mas como voc\u00ea viu, e ver\u00e1 em muitos problemas que tiver ao longo da sua carreira, a solu\u00e7\u00e3o ser\u00e1 melhorar a comunica\u00e7\u00e3o. \u00c9 importante checar com frequ\u00eancia como a comunica\u00e7\u00e3o acontece no seu ambiente de trabalho, e se \u00e9 poss\u00edvel ser melhorada de alguma forma. Pois, no final, melhorar a comunica\u00e7\u00e3o vai <strong>sempre<\/strong> melhorar o processo.<\/p>\n<p>Bill Gates tem uma boa fala:<\/p>\n<blockquote><p>\n  <em>I&#8217;m a great believer that any tool that enhances communication has profound effects in terms of how people can learn from each other, and how they can achieve the kind of freedoms that they&#8217;re interested in.<\/em>\n<\/p><\/blockquote>\n<p>Ou, se voc\u00ea prefere algo mais&#8230; popular, Ashley Tisdale diz:<\/p>\n<blockquote><p>\n  <em>Communication is <strong>so<\/strong> key<\/em>\n<\/p><\/blockquote>\n<p>O que achou do blog post? Voc\u00ea percebeu falta de confian\u00e7a no seu time? Comente abaixo! \ud83d\ude42<\/p>\n<div style=\"border: 1px solid #009eaa;border-radius: 6px;margin: 32px 0;padding: 22px 24px;font-family:sans-serif;\">\nE-book gratuito:<br \/><span style=\"font-size: 1.4em; line-height: 1.3em;\">5 Estrat\u00e9gias para otimizar o fluxo de desenvolvimento de software<\/span><br \/>\n<a href=\"http:\/\/pages.plataformatec.com.br\/5-estrategias-para-otimizar-fluxo-de-desenvolvimento-de-software?utm_source=our-blog&#038;utm_medium=referral&#038;utm_campaign=ebook-5-estratgias-para-fluxo&#038;utm_content=cta-blog-post-bottom\" target=\"_blank\" style=\"background: #009eaa;border: none;border-radius: 3px;color: #fff;display: inline-block;font-size: 12px;line-height: 1.5;margin-top: 18px;padding: 8px 16px;text-align: center; text-decoration: none;font-weight: bold; letter-spacing:0.05em\">BAIXAR E-BOOK<\/a>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Voc\u00ea pode estar sofrendo de falta de confian\u00e7a entre os membros do seu time, e ainda nem notou. Na verdade, \u00e9 muito dif\u00edcil perceber, j\u00e1 que confian\u00e7a \u00e9, muitas vezes, inconsciente para n\u00f3s. Neste post, vou real\u00e7ar a import\u00e2ncia da confian\u00e7a em um time, e ent\u00e3o, listar algumas a\u00e7\u00f5es para melhorar a confian\u00e7a entre seus &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2017\/06\/5-acoes-para-melhorar-confianca-entre-membros-da-equipe\/\">\u00bb<\/a><\/p>\n","protected":false},"author":47,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123,268,265,254,266,267,257],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6472"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/47"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=6472"}],"version-history":[{"count":12,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6472\/revisions"}],"predecessor-version":[{"id":6487,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/6472\/revisions\/6487"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=6472"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=6472"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=6472"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}