{"id":8831,"date":"2019-03-06T12:44:17","date_gmt":"2019-03-06T15:44:17","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=8831"},"modified":"2019-03-06T14:41:12","modified_gmt":"2019-03-06T17:41:12","slug":"5-dicas-essenciais-de-como-olhar-para-a-transformacao-digital-da-sua-empresa","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2019\/03\/5-dicas-essenciais-de-como-olhar-para-a-transformacao-digital-da-sua-empresa\/","title":{"rendered":"5 dicas essenciais de como olhar para a transforma\u00e7\u00e3o digital da sua empresa"},"content":{"rendered":"<p>Com o surgimento e o amadurecimento das tecnologias digitais (exemplo: telefonia m\u00f3vel, big data, intelig\u00eancia artificial etc.), as empresas t\u00eam realizado uma s\u00e9rie de iniciativas para explorar seus benef\u00edcios.<\/p>\n<p>Acompanhar o processo de transforma\u00e7\u00e3o digital da economia tem sido um grande aprendizado. Costumo compartilhar que sou privilegiado por vivenciar um momento na hist\u00f3ria onde \u00e9 poss\u00edvel, de forma acelerada, criar e repensar a entrega de produtos ou servi\u00e7os.<\/p>\n<p>Dada a concorr\u00eancia oriunda da globaliza\u00e7\u00e3o e o aumento do foco no cliente, as empresas est\u00e3o sendo pressionadas a se tornarem digitais antes das outras pela simples necessidade de sobreviver e obter vantagem competitiva. Antigas configura\u00e7\u00f5es de concorr\u00eancia est\u00e3o sendo desestruturadas pela entrada de empresas que j\u00e1 nasceram digitais.<\/p>\n<p>Tais transforma\u00e7\u00f5es exigem altera\u00e7\u00f5es na forma como os neg\u00f3cios enxergam sua proposta de valor, seus processos, o perfil dos seus clientes e sua sustentabilidade econ\u00f4mica. Al\u00e9m disso, as j\u00e1 tradicionais organiza\u00e7\u00f5es passam a ser questionadas, visto a urg\u00eancia em estabelecer novas pr\u00e1ticas de gest\u00e3o para lidar com as complexas mudan\u00e7as e com o perfil de profissional do futuro.<\/p>\n<p>Em 2018 tive a oportunidade de acompanhar o processo de transforma\u00e7\u00e3o digital em empresas dos ramos de energia, de g\u00e1s e de seguros. Tais organiza\u00e7\u00f5es nasceram em um mundo anal\u00f3gico e est\u00e3o enfrentando o desafio de mudar a forma como interagem com um mundo <em>high tech<\/em>. Se voc\u00ea se identifica com este cen\u00e1rio ou tem interesse em saber mais sobre a tal transforma\u00e7\u00e3o digital, compartilharei neste texto 5 dicas de como analisar esta evolu\u00e7\u00e3o.<\/p>\n<h2>1. Tenha clareza do prop\u00f3sito por tr\u00e1s da transforma\u00e7\u00e3o<\/h2>\n<p>Para mim, transforma\u00e7\u00e3o digital \u00e9 o uso de novas tecnologias digitais, como m\u00eddias sociais, dispositivos m\u00f3veis, plataformas anal\u00edticas ou dispositivos embarcados, que permitam grandes evolu\u00e7\u00f5es nos neg\u00f3cios, melhorando a experi\u00eancia do cliente, agilizando as opera\u00e7\u00f5es e concebendo novos modelos de neg\u00f3cios. Tal transi\u00e7\u00e3o vai al\u00e9m da mera digitaliza\u00e7\u00e3o de recursos e resulta em repensar como gerar novas receitas ou economizar a partir de ativos digitais.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8705 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/pilares_transformacao_digital.png\" alt=\"\" width=\"401\" height=\"324\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/pilares_transformacao_digital.png 401w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/pilares_transformacao_digital-300x242.png 300w\" sizes=\"(max-width: 401px) 100vw, 401px\" \/><\/p>\n<p>O primeiro passo para as pessoas entenderem uma transforma\u00e7\u00e3o se consiste pela defini\u00e7\u00e3o de um prop\u00f3sito. Conversando com clientes e analisando processos em empresas do Brasil e no mundo, tenho observado que o prop\u00f3sito de uma transforma\u00e7\u00e3o pode se dividir em 4 perspectivas:<\/p>\n<p><strong>1. Efici\u00eancia operacional:<\/strong> entregar melhor, mais r\u00e1pido e mais barato aquilo que o cliente espera. Se voc\u00ea \u00e9 uma empresa do setor de seguros, seria como se voc\u00ea estivesse preocupada em ter um fluxo de contrata\u00e7\u00e3o de um seguro de autom\u00f3vel em formato digital, permitindo assim que o cliente disponha de autosservi\u00e7o, ou a automatiza\u00e7\u00e3o de algum processo que \u00e9 cr\u00edtico para o neg\u00f3cio (exemplo: aviso de sinistro, acompanhamento de um assist\u00eancia etc.).<\/p>\n<p><strong>2. Cultura digital:<\/strong> revisar o desenho organizacional a fim de promover estruturas org\u00e2nicas que combinem diferentes habilidades, sejam atrativas para novos talentos e tragam mais agilidade na constru\u00e7\u00e3o de solu\u00e7\u00f5es. Caso voc\u00ea esteja no departamento de RH de uma empresa do setor energ\u00e9tico e tenha o desafio de inovar o modelo de neg\u00f3cio da organiza\u00e7\u00e3o, seria como se voc\u00ea promovesse a cria\u00e7\u00e3o de equipes multidisciplinares que reunissem talentos com diferentes compet\u00eancias (exemplo: vis\u00e3o do neg\u00f3cio, capacidade de constru\u00e7\u00e3o de artefatos tecnol\u00f3gicos, entendimento sist\u00eamico da opera\u00e7\u00e3o da empresa etc.) a fim de gerar solu\u00e7\u00f5es para tal miss\u00e3o.<\/p>\n<p><strong>3. Gera\u00e7\u00e3o de novas receitas:<\/strong> repensar a forma como o neg\u00f3cio cria receita e que ele tenha um modelo de neg\u00f3cio sustent\u00e1vel no longo prazo. Se voc\u00ea \u00e9 uma empresa do varejo, \u00e9 importante que voc\u00ea desenvolva estrat\u00e9gias para digitalizar seu processo de vendas, aumentando assim a capilaridade do seu atendimento e gerando receita em mercados que at\u00e9 ent\u00e3o n\u00e3o eram explorados.<\/p>\n<p><strong>4. Presen\u00e7a digital:<\/strong> criar conte\u00fados relevantes, ter um bom relacionamento com pessoas interessadas nos produtos ou servi\u00e7os da empresa, oferecer canais de f\u00e1cil uso e ter um discurso coerente com a sua audi\u00eancia a fim de se tornar uma marca reconhecida digitalmente. Se a sua empresa atua no setor financeiro, seria como se a estrutura de marketing oferecesse um bom servi\u00e7o de autoatendimento que sane as dores dos clientes que desejam abrir uma conta corrente sem depender de outros canais que n\u00e3o sejam o digital.<\/p>\n<h2>2. Transforma\u00e7\u00e3o digital \u00e9 uma integra\u00e7\u00e3o de dados, tecnologia e cliente no centro<\/h2>\n<p>Um processo de transforma\u00e7\u00e3o digital passa pelo desenvolvimento de uma cultura orientada \u00e0 dados, com uma base tecnol\u00f3gica que permita experimenta\u00e7\u00e3o e centrada na cria\u00e7\u00e3o de solu\u00e7\u00f5es que coloquem o cliente no centro.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8708 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/dados_tecnologia_clientenocentro.png\" alt=\"\" width=\"355\" height=\"263\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/dados_tecnologia_clientenocentro.png 355w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/dados_tecnologia_clientenocentro-300x222.png 300w\" sizes=\"(max-width: 355px) 100vw, 355px\" \/><\/p>\n<p>Se a organiza\u00e7\u00e3o n\u00e3o disp\u00f5e de <strong>dados<\/strong> consistentes para an\u00e1lise ou n\u00e3o toma decis\u00f5es baseadas em fatos, dificilmente ela enxergar\u00e1 oportunidades de mudan\u00e7a. Criar a cultura orientada aos dados \u00e9 o sonho de qualquer pessoa que est\u00e1 no n\u00edvel diretivo.<\/p>\n<p>Um turbilh\u00e3o de dados \u00e9 gerado a partir de fontes como transa\u00e7\u00f5es digitais, intera\u00e7\u00f5es nas m\u00eddias sociais, sensores e dispositivos m\u00f3veis. No entanto, para trazer significado para este emaranhado de registros \u00e9 necess\u00e1rio um processo consistente de integra\u00e7\u00e3o.<\/p>\n<p>Muitos aplicativos, como sistemas de recomenda\u00e7\u00e3o ou an\u00e1lise preditiva, n\u00e3o apenas exigem a integra\u00e7\u00e3o e a disponibilidade, mas tamb\u00e9m uma alta qualidade dos dados. Tenha cuidado e trate os dados como um importante ativo do neg\u00f3cio.<\/p>\n<p>Outro ponto que deve ser destacado quanto aos dados diz respeito as pessoas. \u00c9 fundamental ter uma equipe de intelegi\u00eancia que esteja focada tanto na entrega de informa\u00e7\u00f5es relevantes ao neg\u00f3cio, quanto na proposi\u00e7\u00e3o de novos <em>insights<\/em>.<\/p>\n<p>Pensar em uma infraestrutura <strong>tecnol\u00f3gica<\/strong> flex\u00edvel, leve e que permita evolu\u00e7\u00f5es constantes \u00e9 o desejo de qualquer \u00e1rea de Tecnologia da Informa\u00e7\u00e3o, por\u00e9m, a realidade nas empresas envolve lidar com sistemas r\u00edgidos (os famosos legados), que demandam um alto custo de manuten\u00e7\u00e3o e que impactam em larga escala o neg\u00f3cio quando ficam indispon\u00edveis.<\/p>\n<p>Para que a organiza\u00e7\u00e3o possa aprender r\u00e1pido e testar novos artefatos, mudan\u00e7as estruturais ser\u00e3o necess\u00e1rias. N\u00e3o negligencie a revis\u00e3o e a evolu\u00e7\u00e3o da arquitetura das suas aplica\u00e7\u00f5es, pois ela ser\u00e1 uma vantagem ou uma dor de cabe\u00e7a em um futuro n\u00e3o t\u00e3o distante.<\/p>\n<p>Quanto maior a empresa, mais centrada em seus processos ela se torna. J\u00e1 \u00e9 clich\u00ea dizer que nos dias de hoje o <strong>cliente<\/strong> tem uma voz ativa no que tange a reputa\u00e7\u00e3o de uma marca ou de um produto.<\/p>\n<p>Para que uma empresa saiba se posicionar frente a um consumidor cada vez mais digital \u00e9 importante que ela entenda suas necessidades, aprenda com os seus feedbacks e crie solu\u00e7\u00f5es inteligentes.<\/p>\n<p>Tomar decis\u00f5es que foquem apenas em processos eficientes e que n\u00e3o considerem os interesses dos clientes, far\u00e1 com que a empresa perca competitividade.<\/p>\n<p>Em outras palavras, v\u00e1 para a rua e conhe\u00e7a o cliente do seu neg\u00f3cio atrav\u00e9s de grupos focais, entrevistas e testes do seu produto.<\/p>\n<h2>3. Entenda os canais digitais e como os seus clientes os avaliam<\/h2>\n<p>Uma boa diretriz para o processo de transforma\u00e7\u00e3o digital em uma empresa pode se dar quando ela opta por desenvolver seus canais digitais.<\/p>\n<p>Algumas empresas tradicionais do Brasil escolheram come\u00e7ar sua caminhada de evolu\u00e7\u00e3o fortalecendo as vendas online, criando solu\u00e7\u00f5es m\u00f3veis otimizadas, aumentando o n\u00famero de autosservi\u00e7os na <em>web<\/em> e dispositivos m\u00f3veis.<\/p>\n<p>Se a sua empresa estiver buscando uma transforma\u00e7\u00e3o que comece pelos canais, \u00e9 bem prov\u00e1vel que voc\u00ea tenha que responder: como est\u00e1 nossa maturidade digital?<\/p>\n<p>Um dos modelos que tenho utilizado para responder essa pergunta combina no eixo horizontal excel\u00eancia operacional digital (qu\u00e3o bem a empresa oferece seus servi\u00e7os nos canais digitais) e no eixo vertical experi\u00eancia do cliente digital (qu\u00e3o bem a empresa se preocupa em solucionar os problemas do cliente atrav\u00e9s dos canais digitais).<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-8709 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/matriz_experienciacliente_eficienciaoperacional.png\" alt=\"\" width=\"720\" height=\"540\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/matriz_experienciacliente_eficienciaoperacional.png 720w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2019\/02\/matriz_experienciacliente_eficienciaoperacional-300x225.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" \/><\/p>\n<p>O modelo acima poder\u00e1 apoiar voc\u00ea e a sua empresa a definirem como iniciar o processo de transforma\u00e7\u00e3o.<\/p>\n<p>Pode ser que o neg\u00f3cio precise se concentrar em melhorar a experi\u00eancia do cliente, aumentar o engajamento com o mundo exterior e alcan\u00e7ar novos clientes de novas formas. Em contrapartida, talvez o neg\u00f3cio esteja em busca de otimizar os processos internos a fim de reduzir custos e gerar um ganho de efici\u00eancia organizacional.<\/p>\n<p>Independente do caminho que ser\u00e1 seguido, \u00e9 necess\u00e1rio descobrir onde a empresa se encontra e qual ser\u00e1 o foco de atua\u00e7\u00e3o. Lembre-se: quando tudo \u00e9 prioridade, nada \u00e9 prioridade.<\/p>\n<h2>4. N\u00e3o negligencie o car\u00e1ter cultural e o apoio da alta lideran\u00e7a<\/h2>\n<p>Como diria Peter Drucker: <em>&#8220;a cultura come a estrat\u00e9gia no caf\u00e9 da manh\u00e3&#8221;<\/em>. A transforma\u00e7\u00e3o digital s\u00f3 ser\u00e1 bem sucedida em uma ambiente din\u00e2mico e que fomente a colabora\u00e7\u00e3o.<\/p>\n<p>As lideran\u00e7as da organiza\u00e7\u00e3o e suas equipes precisam ser capazes de trabalhar al\u00e9m das fronteiras delimitadas por departamentos e explorar novas ideias. O que tenho observado \u00e9 que a maioria das organiza\u00e7\u00f5es est\u00e1 presa em silos e hierarquias resistentes \u00e0s mudan\u00e7as (como sugest\u00e3o de leitura valhe a pena conferir o livro <a href=\"https:\/\/www.amazon.com\/Leading-Change-New-Preface-Author\/dp\/1422186431\" target=\"_blank\" rel=\"noopener\">Leading Change do John P. Kotter<\/a>).<\/p>\n<p>Sabendo deste desafio, listo algumas dicas de ouro:<\/p>\n<p><strong>1) Defina o significado da transforma\u00e7\u00e3o<\/strong><\/p>\n<p>Qual mudan\u00e7a cultural precisar\u00e1 ocorrer na organiza\u00e7\u00e3o para dar vida ao processo de transforma\u00e7\u00e3o? Como as lideran\u00e7as est\u00e3o comunicando o significado da transforma\u00e7\u00e3o digital para o restante da empresa?<\/p>\n<p>\u00c9 fundamental que a alta lideran\u00e7a da organiza\u00e7\u00e3o explicite porque os ajustes na cultura s\u00e3o importantes. Se a empresa espera ver pessoas adotando uma nova cultura, \u00e9 importante que elas saibam o porqu\u00ea.<\/p>\n<p><strong>2) Tenha um promotor da transforma\u00e7\u00e3o<\/strong><\/p>\n<p>Nem sempre as lideran\u00e7as atuais da empresa ter\u00e3o a capacidade para conduzir a mudan\u00e7a e reconhecer isso n\u00e3o \u00e9 algo t\u00e3o trivial.<\/p>\n<p>Dentro do contexto de transforma\u00e7\u00e3o digital, tem surgido a figura do <em>Chief Digital Officer<\/em> (CDO). Em geral, tal papel est\u00e1 empenhado em desenvolver capacidades digitais em dom\u00ednios relevantes e usar com sucesso v\u00e1rias tecnologias para gerar novas receitas e aumentar a efici\u00eancia operacional.<\/p>\n<p>\u00c9 importante que as pessoas enxerguem que algu\u00e9m na alta hierarquia da organiza\u00e7\u00e3o est\u00e1 conduzindo a transforma\u00e7\u00e3o, porque reflete a relev\u00e2ncia do tema. Sem um apoio no alto escal\u00e3o, dificilmente haver\u00e1 engajamento, for\u00e7a pol\u00edtica e capital social para que a mudan\u00e7a aconte\u00e7a.<\/p>\n<p>Al\u00e9m da dire\u00e7\u00e3o estrat\u00e9gica, as pessoas que est\u00e3o no dia a dia da opera\u00e7\u00e3o precisam acreditar e promover a transforma\u00e7\u00e3o, caso contr\u00e1rio, a mudan\u00e7a n\u00e3o ter\u00e1 a for\u00e7a necess\u00e1ria para acontecer.<\/p>\n<p><strong>3) Crie rotinas para educar as pessoas sobre o impacto da transforma\u00e7\u00e3o<\/strong><\/p>\n<p>As pessoas precisam ser estimuladas a saberem que a organiza\u00e7\u00e3o est\u00e1 passando por modifica\u00e7\u00f5es. Comunicar e criar instrumentos para refor\u00e7ar as altera\u00e7\u00f5es nas estruturas e rotinas \u00e9 um dos t\u00f3picos que deve estar na agenda de quem estiver conduzindo a transforma\u00e7\u00e3o.<\/p>\n<p>Outro tema importante est\u00e1 relacionado com a educa\u00e7\u00e3o. Forma\u00e7\u00f5es continuadas s\u00e3o importantes para a dissemina\u00e7\u00e3o e a assimila\u00e7\u00e3o de novos temas como: agilidade no neg\u00f3cio; m\u00e9todos e pr\u00e1ticas de gest\u00e3o \u00e1gil; equipes celulares; trabalho colaborativo; o papel da pessoa como profissional do futuro; formas de desenvolver solu\u00e7\u00f5es a partir da perspectiva do cliente etc.<\/p>\n<p>Mudan\u00e7as no comportamento e nos padr\u00f5es de pensamento das pessoas funcion\u00e1rias ser\u00e3o cada vez mais importantes para enfrentar os problemas gerados pela economia atual.<\/p>\n<p>Reconhecer que nem todo mundo estar\u00e1 apto para encarar tal cen\u00e1rio e definir estrat\u00e9gias para lidar com isso \u00e9 um dos desafios de uma transforma\u00e7\u00e3o digital.<\/p>\n<p><strong>4) Cuidado com os sistemas de recompensa<\/strong><\/p>\n<p>Se voc\u00ea deseja fazer com que as pessoass atuem de forma colaborativa \u00e9 necess\u00e1rio repensar a forma como elas s\u00e3o recompensadas. Antigos modelos de an\u00e1lise de performance que estimulam a\u00e7\u00f5es individuais precisar\u00e3o ser questionados.<\/p>\n<p>A recomenda\u00e7\u00e3o que tenho feito sobre este assunto \u00e9: <strong>gere uma maneira de analisar a performance que combine avalia\u00e7\u00f5es das pessoas pares e da gest\u00e3o direta. Al\u00e9m disso, crie meios onde a bonifica\u00e7\u00e3o pelo resultado leve em considera\u00e7\u00e3o a performance individual e a meta alcan\u00e7ada pelo grupo<\/strong>.<\/p>\n<p>Trazendo para uma aplica\u00e7\u00e3o pr\u00e1tica, seria como se as pessoas de uma equipe multidisciplinar formada por diferentes \u00e1reas de uma empresa para desenvolver um novo aplicativo de vendas <em>online<\/em>, trimestralmente, se avaliassem, fossem avaliadas pela gest\u00e3o funcional direta e pela lideran\u00e7a do desafio que estivessem trabalhando. Al\u00e9m disto, para cada resultado alcan\u00e7ado pelo desafio, elas receberiam uma bonifica\u00e7\u00e3o pelo bom trabalho em grupo.<\/p>\n<h2>5. Trabalhe com pilotos<\/h2>\n<p>A \u00faltima dica \u00e9 a mais simples: inicie a transforma\u00e7\u00e3o digital com um objetivo claro e que demande baixo esfor\u00e7o.<\/p>\n<p>Quando as empresas tomam a decis\u00e3o de iniciarem um processo de mudan\u00e7a, naturalmente surge uma expectativa pelos resultados nas diferentes esferas.<\/p>\n<p>A diretoria estar\u00e1 interessada em tangibilizar as a\u00e7\u00f5es nos resultados financeiros da empresa, as equipes estar\u00e3o motivadas em trabalhar com um novo formato e as \u00e1reas de neg\u00f3cio estar\u00e3o atra\u00eddas para serem as primeiras a se beneficiarem dos produtos digitais.<\/p>\n<p>Quanto mais simples for a iniciativa trabalhada, menor ser\u00e1 o risco e menos recurso (leia-se dinheiro) ser\u00e1 gasto.<\/p>\n<p>Ao priorizar um <em>&#8220;lote pequeno&#8221;<\/em>, voc\u00ea estar\u00e1 em busca de retornos r\u00e1pidos para a organiza\u00e7\u00e3o, ter\u00e1 feedback mais curto das pessoas clientes e reduzir\u00e1 as chances do processo de transforma\u00e7\u00e3o cair em descr\u00e9dito.<\/p>\n<h2>Considera\u00e7\u00f5es finais<\/h2>\n<p>Conforme p\u00f4de ser observado no texto, os principais desafios para a implementa\u00e7\u00e3o da transforma\u00e7\u00e3o digital s\u00e3o pessoas, cultura, lideran\u00e7a, tecnologia e clientes.<\/p>\n<p>Os resultados obtidos com o modelo de neg\u00f3cio atual geram uma falsa sensa\u00e7\u00e3o de tranquilidade para as empresas e incentivam a continuidade da estrat\u00e9gia atual.<\/p>\n<p>Explorar novos modelos, que incluem a transforma\u00e7\u00e3o digital, torna-se uma necessidade de sobreviv\u00eancia. O sucesso no passado n\u00e3o \u00e9 garantia de um futuro e o mundo digital que vivemos tem nos mostrado isso diariamente. Como tem sido a condu\u00e7\u00e3o da transforma\u00e7\u00e3o digital da sua empresa? Deixe seu coment\u00e1rio abaixo!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Com o surgimento e o amadurecimento das tecnologias digitais (exemplo: telefonia m\u00f3vel, big data, intelig\u00eancia artificial etc.), as empresas t\u00eam realizado uma s\u00e9rie de iniciativas para explorar seus benef\u00edcios. Acompanhar o processo de transforma\u00e7\u00e3o digital da economia tem sido um grande aprendizado. Costumo compartilhar que sou privilegiado por vivenciar um momento na hist\u00f3ria onde \u00e9 &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2019\/03\/5-dicas-essenciais-de-como-olhar-para-a-transformacao-digital-da-sua-empresa\/\">\u00bb<\/a><\/p>\n","protected":false},"author":43,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[123],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8831"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=8831"}],"version-history":[{"count":6,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8831\/revisions"}],"predecessor-version":[{"id":8839,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/8831\/revisions\/8839"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=8831"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=8831"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=8831"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}