{"id":7428,"date":"2018-04-05T10:30:30","date_gmt":"2018-04-05T13:30:30","guid":{"rendered":"http:\/\/blog.plataformatec.com.br\/?p=7428"},"modified":"2018-04-05T09:50:25","modified_gmt":"2018-04-05T12:50:25","slug":"o-agilista-e-o-martelo","status":"publish","type":"post","link":"http:\/\/blog.plataformatec.com.br\/2018\/04\/o-agilista-e-o-martelo\/","title":{"rendered":"O Agilista e o Martelo"},"content":{"rendered":"<h4><b>Vamos discutir tudo o que \u00e9 entendido como certo, verdadeiro e indiscut\u00edvel?<\/b><\/h4>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-7429\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/martelo-1024x576.jpeg\" alt=\"a hammer, relating to the post's title\" width=\"1024\" height=\"576\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/martelo-1024x576.jpeg 1024w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/martelo-300x169.jpeg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/martelo-768x432.jpeg 768w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/martelo.jpeg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Estamos acostumados a sempre discutir e debater sobre como as coisas s\u00e3o ou como elas deveriam ser no nosso ambiente de trabalho, com o uso da filosofia trazemos essa discuss\u00e3o sobre o que fazer ou como conduzir nossas a\u00e7\u00f5es e suas ambiguidades, dado que o mundo \u00e9 do jeito que ele \u00e9. O que fazemos em nossos projetos profissionais, e as decis\u00f5es que tomamos no nosso dia-a-dia, acabam se inserindo nesse contexto de uma forma ou outra. O objetivo desse post \u00e9 fomentar uma ruptura nas certezas e verdades estabelecidas dentro de todo conhecimento criado em torno da &#8220;Agilidade&#8221;. O artefato central dessa discuss\u00e3o \u00e9 o <\/span><b>conhecimento<\/b><span style=\"font-weight: 400;\">, a forma como interagimos com ele e a forma como usamos ele (<\/span><i><span style=\"font-weight: 400;\">ou ele nos usa?<\/span><\/i><span style=\"font-weight: 400;\">). N\u00e3o vejo forma melhor de come\u00e7ar essa s\u00e9rie de provoca\u00e7\u00f5es sen\u00e3o definindo o que \u00e9 conhecimento para mim: <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>| Conhecimento \u00e9 uma cren\u00e7a justific\u00e1vel.<\/b><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Ou seja, perspectiva e conhecimento est\u00e3o diretamente relacionados! Uma &#8220;coisa&#8221; serve como conhecimento at\u00e9 que acreditemos que outra &#8220;coisa&#8221; possua justificativas que superem as anteriores. Se observarmos uma empresa como uma organiza\u00e7\u00e3o que produz conhecimento, \u00e9 poss\u00edvel concluir que o ponto de vista do indiv\u00edduo que lida apenas com uma parte da realidade n\u00e3o \u00e9 o suficiente. O conhecimento n\u00e3o \u00e9 apenas parte da realidade. \u00c9 a realidade, mas vista a partir de um determinado \u00e2ngulo. A mesma realidade pode ser vista diferentemente, dependendo do \u00e2ngulo (<\/span><i><span style=\"font-weight: 400;\">contexto\/circunst\u00e2ncias<\/span><\/i><span style=\"font-weight: 400;\">) do qual se v\u00ea. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">&#8220;Na cria\u00e7\u00e3o do conhecimento, n\u00e3o se pode ser livre do seu pr\u00f3prio conceito. \u2014 Nonaka &amp; Takeuchi&#8221;<\/span><\/i><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Os contextos econ\u00f4mico, cultural e hist\u00f3rico s\u00e3o importantes para os indiv\u00edduos que produzem conhecimento. Esses contextos permitem a interpreta\u00e7\u00e3o da informa\u00e7\u00e3o e a cria\u00e7\u00e3o do significado que se deseja transmitir. \u00c9 por isso que a externaliza\u00e7\u00e3o do <\/span><b>conhecimento pessoal <\/b><span style=\"font-weight: 400;\">pode levar a falsidades ontol\u00f3gicas e fal\u00e1cias (<\/span><i><span style=\"font-weight: 400;\">Spotify model, SAFe, story points, Scrum\u2026<\/span><\/i><span style=\"font-weight: 400;\">), pois a complexidade total de um determinado fen\u00f4meno pode permanecer oculta. Por isso, quando criamos conhecimento \u00e9 important\u00edssimo ver todo o quadro da realidade (perspectiva) interagindo com outros que a vejam a partir de outros \u00e2ngulos, isto \u00e9, compartilhando seus conceitos! E a partir desses conceitos \u00e9 que podemos julgar se o conhecimento a ser transmitido \u00e9 \u00fatil ou n\u00e3o ao nosso contexto atual. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">H\u00e1 quem acredite em certezas imediatas, tais como: scrum \u00e9 \u00e1gil, SAFe \u00e9 a melhor op\u00e7\u00e3o para escalar agilidade, estimativas s\u00e3o imprescind\u00edveis sem nem procurar os conceitos por tr\u00e1s. Me perguntei: o que leva essas pessoas a se tornarem ferramentas do conhecimento ao inv\u00e9s de usar o conhecimento como ferramenta? Elas acham que usam o conhecimento, mas na verdade o conhecimento as usa. <\/span><\/p>\n<h4><b>O poder das Ideias de Massa<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Acredito que o problema principal s\u00e3o as causas que normalmente vem acompanhadas dessas ideias, causas onde os gestores t\u00eam onde se agarrar, causas que sempre vem acompanhadas de um grande vislumbramento de como a organiza\u00e7\u00e3o poderia\/deveria ser melhor (ideologia). O ponto \u00e9 sempre colocar as ideias a seu servi\u00e7o, voc\u00ea ser\u00e1 pragm\u00e1tico quando isso lhe for \u00fatil. Isso significa que voc\u00ea entende que todas as ideias podem ser \u00fateis se usadas de forma puxada pela situa\u00e7\u00e3o\/contexto. \u00c9 diferente de tentar imp\u00f4-las como verdade para todos os contextos existentes\/inexistentes como se fossem coisas sempre <\/span><b>iguais <\/b><span style=\"font-weight: 400;\">(<\/span><i><span style=\"font-weight: 400;\">outra certeza imediata que consultorias de grande porte vendem<\/span><\/i><span style=\"font-weight: 400;\">). O perigo de se identificar com a ideia \u00e9 se tornar viabilizador e propagador dela (a ideia te usa), ao inv\u00e9s de benefici\u00e1rio de sua efetividade perante o contexto\/problema que voc\u00ea vive <\/span><b>hoje.<\/b><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">&#8220;The issue is one of defining your identity by membership of a social group rather than simply a tool user. For example, you could use Pragmatic philosophy without identifying yourself as a Pragmatist. The important thing is not to let an idea, concept, tool or technology define you. A software engineer who uses Java is okay. A Java Developer is not okay. \u2014 David J Anderson&#8221;<\/span><\/i><\/p>\n<div id=\"attachment_7430\" style=\"width: 862px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-7430\" class=\"wp-image-7430 size-full\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/complexity.jpg\" alt=\"\" width=\"852\" height=\"669\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/complexity.jpg 852w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/complexity-300x236.jpg 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/complexity-768x603.jpg 768w\" sizes=\"(max-width: 852px) 100vw, 852px\" \/><p id=\"caption-attachment-7430\" class=\"wp-caption-text\">Complexity<\/p><\/div>\n<h4><b>Isso tudo na pr\u00e1tica <\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Como o gestor pragm\u00e1tico pode voltar a conhecer, a criar princ\u00edpios? S\u00f3 h\u00e1 um meio: experimentando! <\/span><span style=\"font-weight: 400;\">Os caminhos que levam para cima s\u00e3o sempre diferentes, j\u00e1 os caminhos que levam para baixo, s\u00e3o sempre os mesmos<\/span><span style=\"font-weight: 400;\">. Fazer do seu projeto um experimento \u00e9 a \u00fanica forma de criar conhecimento com real valor para a sua organiza\u00e7\u00e3o. Admitindo que n\u00e3o existem contextos iguais, partimos da premissa de que todo o conhecimento produzido e acumulado sobre <\/span><b>gest\u00e3o,<\/b><span style=\"font-weight: 400;\"> do qual temos acesso, n\u00e3o nos d\u00e1 nenhuma certeza imediata quanto a efetividade. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Exemplo:<\/b><span style=\"font-weight: 400;\"> muito se discute sobre a dualidade Efici\u00eancia x Efic\u00e1cia, em qual investir primeiro? Qual priorizar dado o meu contexto? O que o framework XPTO fala sobre isso? E se eu te dissesse que os dois s\u00e3o uma \u00fanica coisa? Faz parte do senso comum achar que quando estamos criando ideias (<\/span><i><span style=\"font-weight: 400;\">upstream<\/span><\/i><span style=\"font-weight: 400;\">) a efic\u00e1cia predomine, pois n\u00e3o queremos cometer o erro de construir a coisa errada, e na constru\u00e7\u00e3o (<\/span><i><span style=\"font-weight: 400;\">downstream<\/span><\/i><span style=\"font-weight: 400;\">) a efici\u00eancia \u00e9 mais importante para fazer as coisas de forma r\u00e1pida. Por\u00e9m se nos colocarmos al\u00e9m dessa dualidade \u00e9 poss\u00edvel enxergar um outro \u00e2ngulo: focando efic\u00e1cia apenas no <\/span><b><i>upstream <\/i><\/b><i><span style=\"font-weight: 400;\">(op\u00e7\u00f5es de ideias)<\/span><\/i> <span style=\"font-weight: 400;\">temos o risco de ocorrer <\/span><b><i>starvation <\/i><\/b><span style=\"font-weight: 400;\">no<\/span><b><i> downstream <\/i><\/b><i><span style=\"font-weight: 400;\">(solicita\u00e7\u00f5es de execu\u00e7\u00e3o)<\/span><\/i><span style=\"font-weight: 400;\">, sem efic\u00e1cia no <\/span><b><i>downstream <\/i><\/b><span style=\"font-weight: 400;\">\u00e9 necess\u00e1rio confiar cegamente no <\/span><b><i>upstream <\/i><\/b><span style=\"font-weight: 400;\">para que seja eliminado os riscos de demandas que n\u00e3o entreguem valor entrarem no fluxo. No final das contas a realidade \u00e9 bem mais complexa do que estamos acostumados a categorizar (<\/span><i><span style=\"font-weight: 400;\">pensamento cartesiano do s\u00e9culo XVIII<\/span><\/i><span style=\"font-weight: 400;\">) e arquivar como &#8220;certezas&#8221; em nossas mentes.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Toda essa teoria p\u00f3s-moderna de cria\u00e7\u00e3o do conhecimento organizacional que foi apresentada aqui, pode ser estudada com mais aprofundamento t\u00e9cnico na obra<\/span><a href=\"https:\/\/www.amazon.com.br\/Gest%C3%A3o-do-Conhecimento-Hirotaka-Takeuchi\/dp\/8577801918\/ref=sr_1_1?ie=UTF8&amp;qid=1507744482&amp;sr=8-1&amp;keywords=gest%C3%A3o+do+conhecimento+Nonaka+e+Takeuchi\"> <span style=\"font-weight: 400;\">Gest\u00e3o do Conhecimento<\/span><\/a><span style=\"font-weight: 400;\"> publicada por Hirotaka Takeuchi e Ikujiro Nonaka. A defini\u00e7\u00e3o ocidental mais comum sobre o que \u00e9 conhecimento enfoca a &#8220;veracidade&#8221; (<\/span><i><span style=\"font-weight: 400;\">conhecimento das coisas em si<\/span><\/i><span style=\"font-weight: 400;\">) como atributo essencial para a constru\u00e7\u00e3o do conhecimento, ou seja, esperam que a verdade seja sempre <\/span><b>limpinha.<\/b><span style=\"font-weight: 400;\"> Aqui alimento a natureza do conhecimento como &#8220;cren\u00e7a justificada&#8221; onde a perspectiva tem mais valor do que a &#8220;veracidade&#8221;, isso serve como um convite para uma grande pluralidade de ideias e experimentos que ainda est\u00e3o por acontecer, essa experimenta\u00e7\u00e3o permitir\u00e1 uma gama completamente nova de conhecimentos, mais audazes, mais genu\u00ednos! <\/span><\/p>\n<p><span style=\"font-weight: 400;\">E voc\u00ea? Como tem sido sua rela\u00e7\u00e3o com o conhecimento? <\/span><\/p>\n<p><a href=\"http:\/\/pages.plataformatec.com.br\/contagil-newsletter-assinatura?utm_source=our-blog&amp;utm_medium=referral&amp;utm_campaign=contagil-subscription&amp;utm_content=banner-sidebar\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-7432\" src=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar.png\" alt=\"\" width=\"867\" height=\"153\" srcset=\"http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar.png 831w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar-300x53.png 300w, http:\/\/blog.plataformatec.com.br\/wp-content\/uploads\/2018\/04\/Banner-Contagilwide-Quero-Assinar-768x136.png 768w\" sizes=\"(max-width: 867px) 100vw, 867px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Vamos discutir tudo o que \u00e9 entendido como certo, verdadeiro e indiscut\u00edvel? Estamos acostumados a sempre discutir e debater sobre como as coisas s\u00e3o ou como elas deveriam ser no nosso ambiente de trabalho, com o uso da filosofia trazemos essa discuss\u00e3o sobre o que fazer ou como conduzir nossas a\u00e7\u00f5es e suas ambiguidades, dado &#8230; <a class=\"read-more-link\" href=\"http:\/\/blog.plataformatec.com.br\/2018\/04\/o-agilista-e-o-martelo\/\">\u00bb<\/a><\/p>\n","protected":false},"author":53,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"ngg_post_thumbnail":0,"footnotes":""},"categories":[3],"tags":[284,257],"aioseo_notices":[],"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7428"}],"collection":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/users\/53"}],"replies":[{"embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/comments?post=7428"}],"version-history":[{"count":5,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7428\/revisions"}],"predecessor-version":[{"id":7437,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/posts\/7428\/revisions\/7437"}],"wp:attachment":[{"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/media?parent=7428"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/categories?post=7428"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/blog.plataformatec.com.br\/wp-json\/wp\/v2\/tags?post=7428"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}